-- MySQL dump 10.13  Distrib 5.7.10, for osx10.9 (x86_64)
--
-- Host: localhost    Database: xw
-- ------------------------------------------------------
-- Server version	5.7.10

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '管理员id',
  `username` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '用户名',
  `password` char(24) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '密码',
  `salt` char(16) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '密码盐值',
  `status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '状态 -1为删除，0为禁用，1为正常',
  `last_login_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '最近登录时间',
  `last_login_ip` char(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '上次登陆系统时的IP',
  `creator` int(11) NOT NULL DEFAULT '0' COMMENT '创建人ID',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='管理员表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

LOCK TABLES `admin` WRITE;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_profile`
--

DROP TABLE IF EXISTS `admin_profile`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `admin_profile` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '管理员id',
  `employee_number` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '员工工号',
  `email` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '邮箱',
  `real_name` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '姓名',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `employee_number` (`employee_number`),
  CONSTRAINT `fk_adminProfile_admin` FOREIGN KEY (`id`) REFERENCES `admin` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='管理员个人资料表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_profile`
--

LOCK TABLES `admin_profile` WRITE;
/*!40000 ALTER TABLE `admin_profile` DISABLE KEYS */;
/*!40000 ALTER TABLE `admin_profile` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `applicant_preference`
--

DROP TABLE IF EXISTS `applicant_preference`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `applicant_preference` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `preference_id` int(11) NOT NULL DEFAULT '0' COMMENT '偏好ID',
  `position_id` int(11) NOT NULL DEFAULT '0' COMMENT '职位id',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  UNIQUE KEY `preference_id` (`preference_id`),
  KEY `fk_applicantPreference_position` (`position_id`),
  CONSTRAINT `fk_applicantPreference_position` FOREIGN KEY (`position_id`) REFERENCES `position` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='求职偏好表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `applicant_preference`
--

LOCK TABLES `applicant_preference` WRITE;
/*!40000 ALTER TABLE `applicant_preference` DISABLE KEYS */;
/*!40000 ALTER TABLE `applicant_preference` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bizteam`
--

DROP TABLE IF EXISTS `bizteam`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bizteam` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '业务团队ID',
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '名称',
  `address` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '地址',
  `city_id` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '城市ID',
  `longitude` decimal(10,6) NOT NULL DEFAULT '0.000000' COMMENT '经度',
  `latitude` decimal(10,6) NOT NULL DEFAULT '0.000000' COMMENT '纬度',
  `remark` varchar(300) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '备注',
  `category` tinyint(4) NOT NULL DEFAULT '0' COMMENT '团队类别，1为转让，2为选址，3为招聘，4为预订',
  `creator` int(11) NOT NULL DEFAULT '0' COMMENT '创建人',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0为待审核，1为正常，2为审核失败，3为冻结，4为解散',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `operator` int(11) NOT NULL DEFAULT '0' COMMENT '操作人',
  PRIMARY KEY (`id`),
  KEY `city_id` (`city_id`),
  KEY `status` (`status`),
  KEY `fk_bizteam_user` (`creator`),
  CONSTRAINT `fk_bizteam_user` FOREIGN KEY (`creator`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='业务团队表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bizteam`
--

LOCK TABLES `bizteam` WRITE;
/*!40000 ALTER TABLE `bizteam` DISABLE KEYS */;
/*!40000 ALTER TABLE `bizteam` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bizteam_article`
--

DROP TABLE IF EXISTS `bizteam_article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bizteam_article` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '文章ID',
  `bizteam_id` int(11) NOT NULL DEFAULT '0' COMMENT '业务团队ID',
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '标题',
  `content` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '内容',
  `category` tinyint(4) NOT NULL DEFAULT '0' COMMENT '类别，1为培训，2为活动',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，-1为删除，0为正常',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `bizteam_id` (`bizteam_id`,`create_time`),
  CONSTRAINT `fk_bizteamArticle_bizteam` FOREIGN KEY (`bizteam_id`) REFERENCES `bizteam` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='业务团队文章表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bizteam_article`
--

LOCK TABLES `bizteam_article` WRITE;
/*!40000 ALTER TABLE `bizteam_article` DISABLE KEYS */;
/*!40000 ALTER TABLE `bizteam_article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bizteam_message`
--

DROP TABLE IF EXISTS `bizteam_message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bizteam_message` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '消息ID',
  `bizteam_id` int(11) NOT NULL DEFAULT '0' COMMENT '业务团队ID',
  `content` varchar(1024) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '内容',
  `uri` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '消息跳转地址,如page://bizteam.list或http://www.xw.com,其中page协议表示跳转到站内，http协议表示跳转到一个URL',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `bizteam_id` (`bizteam_id`),
  CONSTRAINT `fk_bizteamMessage_bizteam` FOREIGN KEY (`bizteam_id`) REFERENCES `bizteam` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='业务团队消息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bizteam_message`
--

LOCK TABLES `bizteam_message` WRITE;
/*!40000 ALTER TABLE `bizteam_message` DISABLE KEYS */;
/*!40000 ALTER TABLE `bizteam_message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bizteam_recruit`
--

DROP TABLE IF EXISTS `bizteam_recruit`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bizteam_recruit` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `bizteam_id` int(11) NOT NULL DEFAULT '0' COMMENT '业务团队ID',
  `content` text COLLATE utf8mb4_unicode_ci COMMENT '招募信息',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `bizteam_id` (`bizteam_id`),
  CONSTRAINT `fk_bizteamRecruit_bizteam` FOREIGN KEY (`bizteam_id`) REFERENCES `bizteam` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='业务团队招募表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bizteam_recruit`
--

LOCK TABLES `bizteam_recruit` WRITE;
/*!40000 ALTER TABLE `bizteam_recruit` DISABLE KEYS */;
/*!40000 ALTER TABLE `bizteam_recruit` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `business`
--

DROP TABLE IF EXISTS `business`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `business` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `opportunity_id` int(11) NOT NULL COMMENT '商机 id',
  `sales_id` int(11) NOT NULL COMMENT '业务员 id',
  `merchant_id` int(11) DEFAULT NULL COMMENT '商户 id, 为 -1 表示还没有商户',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建于（领取业务时间）',
  `modified_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '最后修改于',
  `expires_at` timestamp NULL DEFAULT NULL COMMENT '过期时间',
  `closed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '关闭时间',
  `status` int(11) NOT NULL DEFAULT '1' COMMENT '1=业务中, 2=签约中, 3=已成交, 4=已关闭',
  `service_days` int(11) NOT NULL DEFAULT '-1' COMMENT '服务日 （-1 表示无限期）',
  `standard_price` decimal(12,2) DEFAULT NULL COMMENT '标准价格, 0.00~12345678.90',
  `discount_price` decimal(12,2) DEFAULT NULL COMMENT '优惠价格, 0.00~12345678.90',
  `plugin_id` char(64) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '插件 id',
  `postponed` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '0=未延期, 1=已延期',
  `reason` varchar(300) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '关闭业务的原因',
  `mode` int(11) DEFAULT NULL COMMENT '服务方式(1 按结果，2 按周期)',
  `cycle` int(11) DEFAULT NULL COMMENT '周期(转店 按周期，必填，其它不填)',
  `advertising` int(11) DEFAULT NULL COMMENT '广告位 (按周期，按结果不填)',
  `price` int(11) DEFAULT NULL COMMENT '价格',
  `prepay` int(11) DEFAULT NULL COMMENT '预付比例 50~100% (选填)',
  PRIMARY KEY (`id`),
  KEY `fk_business_opportunity_idx` (`opportunity_id`),
  KEY `fk_business_sales_idx` (`sales_id`),
  KEY `fk_business_merchant_idx` (`merchant_id`),
  CONSTRAINT `fk_business_merchant` FOREIGN KEY (`merchant_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_business_opportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `opportunity` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_business_sales` FOREIGN KEY (`sales_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `business`
--

LOCK TABLES `business` WRITE;
/*!40000 ALTER TABLE `business` DISABLE KEYS */;
/*!40000 ALTER TABLE `business` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `consume_preference`
--

DROP TABLE IF EXISTS `consume_preference`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `consume_preference` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `preference_id` int(11) NOT NULL DEFAULT '0' COMMENT '偏好ID',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  UNIQUE KEY `preference_id` (`preference_id`),
  KEY `fk_consumePreference_industry` (`industry_id`),
  CONSTRAINT `fk_consumePreference_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='消费偏好表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `consume_preference`
--

LOCK TABLES `consume_preference` WRITE;
/*!40000 ALTER TABLE `consume_preference` DISABLE KEYS */;
/*!40000 ALTER TABLE `consume_preference` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `contract`
--

DROP TABLE IF EXISTS `contract`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `contract` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `merchant_id` int(11) NOT NULL COMMENT '商户 ID ',
  `business_id` int(11) DEFAULT NULL COMMENT '业务 ID (null 代表商户主动签约)',
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '状态',
  `plugin_id` char(64) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '插件 ID',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `service_id` int(11) NOT NULL DEFAULT '0' COMMENT '服务ID',
  `shop_id` int(11) NOT NULL DEFAULT '0' COMMENT '店铺ID',
  `reason` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '失效原因',
  `auditor_id` int(11) DEFAULT NULL COMMENT '审核人',
  `audited_at` datetime DEFAULT NULL COMMENT '审核时间',
  `content` text COLLATE utf8mb4_unicode_ci COMMENT '合同内容',
  `amount` int(11) NOT NULL DEFAULT '0' COMMENT '合同金额',
  `mode` tinyint(4) NOT NULL DEFAULT '0' COMMENT '服务方式：1 按次，2 服务到指定时间',
  `cycle` int(11) DEFAULT '0' COMMENT '天数',
  `prepay` int(11) NOT NULL DEFAULT '0' COMMENT '预付款比例',
  PRIMARY KEY (`id`),
  KEY `fk_contract_business_idx` (`business_id`),
  KEY `fk_contract_user_idx` (`merchant_id`),
  CONSTRAINT `fk_contract_user` FOREIGN KEY (`merchant_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `contract`
--

LOCK TABLES `contract` WRITE;
/*!40000 ALTER TABLE `contract` DISABLE KEYS */;
/*!40000 ALTER TABLE `contract` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `district`
--

DROP TABLE IF EXISTS `district`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `district` (
  `code` int(11) NOT NULL DEFAULT '0' COMMENT '编码',
  `name` varchar(16) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '名称',
  UNIQUE KEY `code` (`code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='地区表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `district`
--

LOCK TABLES `district` WRITE;
/*!40000 ALTER TABLE `district` DISABLE KEYS */;
INSERT INTO `district` VALUES (11,'北京'),(12,'天津'),(13,'河北'),(14,'山西'),(15,'内蒙古'),(21,'辽宁'),(22,'吉林'),(23,'黑龙江'),(31,'上海'),(32,'江苏'),(33,'浙江'),(34,'安徽'),(35,'福建'),(36,'江西'),(37,'山东'),(41,'河南'),(42,'湖北'),(43,'湖南'),(44,'广东'),(45,'广西'),(46,'海南'),(50,'重庆'),(51,'四川'),(52,'贵州'),(53,'云南'),(54,'西藏'),(61,'陕西'),(62,'甘肃'),(63,'青海'),(64,'宁夏'),(65,'新疆'),(71,'台湾'),(81,'香港'),(82,'澳门'),(1101,'北京'),(1201,'天津'),(1301,'石家庄'),(1302,'唐山'),(1303,'秦皇岛'),(1304,'邯郸'),(1305,'邢台'),(1306,'保定'),(1307,'张家口'),(1308,'承德'),(1309,'沧州'),(1310,'廊坊'),(1311,'衡水'),(1401,'太原'),(1402,'大同'),(1403,'阳泉'),(1404,'长治'),(1405,'晋城'),(1406,'朔州'),(1407,'晋中'),(1408,'运城'),(1409,'忻州'),(1410,'临汾'),(1411,'吕梁'),(1501,'呼和浩特'),(1502,'包头'),(1503,'乌海'),(1504,'赤峰'),(1505,'通辽'),(1506,'鄂尔多斯'),(1507,'呼伦贝尔'),(1508,'巴彦淖尔'),(1509,'乌兰察布'),(1522,'兴安盟'),(1525,'锡林郭勒盟'),(1529,'阿拉善盟'),(2101,'沈阳'),(2102,'大连'),(2103,'鞍山'),(2104,'抚顺'),(2105,'本溪'),(2106,'丹东'),(2107,'锦州'),(2108,'营口'),(2109,'阜新'),(2110,'辽阳'),(2111,'盘锦'),(2112,'铁岭'),(2113,'朝阳'),(2114,'葫芦岛'),(2201,'长春'),(2202,'吉林'),(2203,'四平'),(2204,'辽源'),(2205,'通化'),(2206,'白山'),(2207,'松原'),(2208,'白城'),(2224,'延边'),(2301,'哈尔滨'),(2302,'齐齐哈尔'),(2303,'鸡西'),(2304,'鹤岗'),(2305,'双鸭山'),(2306,'大庆'),(2307,'伊春'),(2308,'佳木斯'),(2309,'七台河'),(2310,'牡丹江'),(2311,'黑河'),(2312,'绥化'),(2327,'大兴安岭地区'),(3101,'上海'),(3201,'南京'),(3202,'无锡'),(3203,'徐州'),(3204,'常州'),(3205,'苏州'),(3206,'南通'),(3207,'连云港'),(3208,'淮安'),(3209,'盐城'),(3210,'扬州'),(3211,'镇江'),(3212,'泰州'),(3213,'宿迁'),(3301,'杭州'),(3302,'宁波'),(3303,'温州'),(3304,'嘉兴'),(3305,'湖州'),(3306,'绍兴'),(3307,'金华'),(3308,'衢州'),(3309,'舟山'),(3310,'台州'),(3311,'丽水'),(3312,'义乌'),(3401,'合肥'),(3402,'芜湖'),(3403,'蚌埠'),(3404,'淮南'),(3405,'马鞍山'),(3407,'铜陵'),(3408,'安庆'),(3410,'黄山'),(3411,'滁州'),(3412,'阜阳'),(3413,'宿州'),(3414,'巢湖'),(3415,'六安'),(3416,'亳州'),(3417,'池州'),(3418,'宣城'),(3501,'福州'),(3502,'厦门'),(3503,'莆田'),(3504,'三明'),(3505,'泉州'),(3506,'漳州'),(3507,'南平'),(3508,'龙岩'),(3509,'宁德'),(3601,'南昌'),(3602,'景德镇'),(3603,'萍乡'),(3604,'九江'),(3605,'新余'),(3606,'鹰潭'),(3607,'赣州'),(3608,'吉安'),(3609,'宜春'),(3610,'抚州'),(3611,'上饶'),(3701,'济南'),(3702,'青岛'),(3703,'淄博'),(3704,'枣庄'),(3705,'东营'),(3706,'烟台'),(3707,'潍坊'),(3708,'济宁'),(3709,'泰安'),(3710,'威海'),(3711,'日照'),(3712,'莱芜'),(3713,'临沂'),(3714,'德州'),(3715,'聊城'),(3716,'滨州'),(3717,'菏泽'),(4101,'郑州'),(4102,'开封'),(4103,'洛阳'),(4104,'平顶山'),(4105,'安阳'),(4106,'鹤壁'),(4107,'新乡'),(4108,'焦作'),(4109,'濮阳'),(4110,'许昌'),(4111,'漯河'),(4112,'三门峡'),(4113,'南阳'),(4114,'商丘'),(4115,'信阳'),(4116,'周口'),(4117,'驻马店'),(4201,'武汉'),(4202,'黄石'),(4203,'十堰'),(4205,'宜昌'),(4206,'襄阳'),(4207,'鄂州'),(4208,'荆门'),(4209,'孝感'),(4210,'荆州'),(4211,'黄冈'),(4212,'咸宁'),(4213,'随州'),(4228,'恩施'),(4290,'省直辖县'),(4301,'长沙'),(4302,'株洲'),(4303,'湘潭'),(4304,'衡阳'),(4305,'邵阳'),(4306,'岳阳'),(4307,'常德'),(4308,'张家界'),(4309,'益阳'),(4310,'郴州'),(4311,'永州'),(4312,'怀化'),(4313,'娄底'),(4331,'湘西'),(4401,'广州'),(4402,'韶关'),(4403,'深圳'),(4404,'珠海'),(4405,'汕头'),(4406,'佛山'),(4407,'江门'),(4408,'湛江'),(4409,'茂名'),(4412,'肇庆'),(4413,'惠州'),(4414,'梅州'),(4415,'汕尾'),(4416,'河源'),(4417,'阳江'),(4418,'清远'),(4419,'东莞'),(4420,'中山'),(4451,'潮州'),(4452,'揭阳'),(4453,'云浮'),(4501,'南宁'),(4502,'柳州'),(4503,'桂林'),(4504,'梧州'),(4505,'北海'),(4506,'防城港'),(4507,'钦州'),(4508,'贵港'),(4509,'玉林'),(4510,'百色'),(4511,'贺州'),(4512,'河池'),(4513,'来宾'),(4514,'崇左'),(4601,'海口'),(4602,'三亚'),(4690,'省直辖县'),(5001,'重庆'),(5101,'成都'),(5103,'自贡'),(5104,'攀枝花'),(5105,'泸州'),(5106,'德阳'),(5107,'绵阳'),(5108,'广元'),(5109,'遂宁'),(5110,'内江'),(5111,'乐山'),(5113,'南充'),(5114,'眉山'),(5115,'宜宾'),(5116,'广安'),(5117,'达州'),(5118,'雅安'),(5119,'巴中'),(5120,'资阳'),(5132,'阿坝'),(5133,'甘孜'),(5134,'凉山'),(5201,'贵阳'),(5202,'六盘水'),(5203,'遵义'),(5204,'安顺'),(5222,'铜仁地区'),(5223,'黔西南'),(5224,'毕节地区'),(5226,'黔东南'),(5227,'黔南布'),(5301,'昆明'),(5303,'曲靖'),(5304,'玉溪'),(5305,'保山'),(5306,'昭通'),(5307,'丽江'),(5308,'普洱'),(5309,'临沧'),(5323,'楚雄'),(5325,'红河'),(5326,'文山'),(5328,'西双版纳'),(5329,'大理'),(5331,'德宏'),(5333,'怒江傈'),(5334,'迪庆'),(5401,'拉萨'),(5421,'昌都地区'),(5422,'山南地区'),(5423,'日喀则地区'),(5424,'那曲地区'),(5425,'阿里地区'),(5426,'林芝地区'),(6101,'西安'),(6102,'铜川'),(6103,'宝鸡'),(6104,'咸阳'),(6105,'渭南'),(6106,'延安'),(6107,'汉中'),(6108,'榆林'),(6109,'安康'),(6110,'商洛'),(6201,'兰州'),(6202,'嘉峪关'),(6203,'金昌'),(6204,'白银'),(6205,'天水'),(6206,'武威'),(6207,'张掖'),(6208,'平凉'),(6209,'酒泉'),(6210,'庆阳'),(6211,'定西'),(6212,'陇南'),(6229,'临夏'),(6230,'甘南'),(6301,'西宁'),(6321,'海东地区'),(6322,'海北'),(6323,'黄南'),(6325,'海南'),(6326,'果洛'),(6327,'玉树'),(6328,'海西'),(6401,'银川'),(6402,'石嘴山'),(6403,'吴忠'),(6404,'固原'),(6405,'中卫'),(6501,'乌鲁木齐'),(6502,'克拉玛依'),(6521,'吐鲁番地区'),(6522,'哈密地区'),(6523,'昌吉'),(6527,'博尔塔拉'),(6528,'巴音郭楞'),(6529,'阿克苏地区'),(6530,'克孜勒苏柯尔克孜'),(6531,'喀什地区'),(6532,'和田地区'),(6540,'伊犁'),(6542,'塔城地区'),(6543,'阿勒泰地区'),(6590,'自治区直辖县'),(7101,'台北'),(7102,'高雄'),(7103,'台中'),(7104,'嘉興'),(7105,'台南'),(7106,'嘉義'),(8101,'香港岛'),(8102,'九龙'),(8103,'新界'),(8104,'离岛'),(8201,'澳门'),(110101,'东城区'),(110102,'西城区'),(110103,'崇文区'),(110104,'宣武区'),(110105,'朝阳区'),(110106,'丰台区'),(110107,'石景山区'),(110108,'海淀区'),(110109,'门头沟区'),(110110,'北京周边'),(110111,'房山区'),(110112,'通州区'),(110113,'顺义区'),(110114,'昌平区'),(110115,'大兴区'),(110116,'怀柔区'),(110117,'平谷区'),(110128,'密云县'),(110129,'延庆县'),(110130,'燕郊'),(120101,'和平区'),(120102,'河东区'),(120103,'河西区'),(120104,'南开区'),(120105,'河北区'),(120106,'红桥区'),(120107,'塘沽区'),(120108,'汉沽区'),(120109,'大港区'),(120110,'东丽区'),(120111,'西青区'),(120112,'津南区'),(120113,'北辰区'),(120114,'武清区'),(120115,'宝坻区'),(120121,'宁河县'),(120123,'静海县'),(120125,'蓟县'),(120126,'经济开发区'),(130102,'长安区'),(130103,'桥东区'),(130104,'桥西区'),(130105,'新华区'),(130107,'井陉矿区'),(130108,'裕华区'),(130121,'井陉县'),(130123,'正定县'),(130124,'栾城县'),(130125,'行唐县'),(130126,'灵寿县'),(130127,'高邑县'),(130128,'深泽县'),(130129,'赞皇县'),(130130,'无极县'),(130131,'平山县'),(130132,'元氏县'),(130133,'赵县'),(130181,'辛集'),(130182,'藁城'),(130183,'晋州'),(130184,'新乐'),(130185,'鹿泉'),(130186,'开发区'),(130202,'路南区'),(130203,'路北区'),(130204,'古冶区'),(130205,'开平区'),(130207,'丰南区'),(130208,'丰润区'),(130223,'滦县'),(130224,'滦南县'),(130225,'乐亭县'),(130227,'迁西县'),(130229,'玉田县'),(130230,'唐海县'),(130281,'遵化'),(130283,'迁安'),(130302,'海港区'),(130303,'山海关区'),(130304,'北戴河区'),(130321,'青龙县'),(130322,'昌黎县'),(130323,'抚宁县'),(130324,'卢龙县'),(130402,'邯山区'),(130403,'丛台区'),(130404,'复兴区'),(130406,'峰峰矿区'),(130421,'邯郸县'),(130423,'临漳县'),(130424,'成安县'),(130425,'大名县'),(130426,'涉县'),(130427,'磁县'),(130428,'肥乡县'),(130429,'永年县'),(130430,'邱县'),(130431,'鸡泽县'),(130432,'广平县'),(130433,'馆陶县'),(130434,'魏县'),(130435,'曲周县'),(130481,'武安'),(130502,'桥东区'),(130503,'桥西区'),(130521,'邢台县'),(130522,'临城县'),(130523,'内丘县'),(130524,'柏乡县'),(130525,'隆尧县'),(130526,'任县'),(130527,'南和县'),(130528,'宁晋县'),(130529,'巨鹿县'),(130530,'新河县'),(130531,'广宗县'),(130532,'平乡县'),(130533,'威县'),(130534,'清河县'),(130535,'临西县'),(130581,'南宫'),(130582,'沙河'),(130602,'新市区'),(130603,'北市区'),(130604,'南市区'),(130621,'满城县'),(130622,'清苑县'),(130623,'涞水县'),(130624,'阜平县'),(130625,'徐水县'),(130626,'定兴县'),(130627,'唐县'),(130628,'高阳县'),(130629,'容城县'),(130630,'涞源县'),(130631,'望都县'),(130632,'安新县'),(130633,'易县'),(130634,'曲阳县'),(130635,'蠡县'),(130636,'顺平县'),(130637,'博野县'),(130638,'雄县'),(130681,'涿州'),(130682,'定州'),(130683,'安国'),(130684,'高碑店'),(130702,'桥东区'),(130703,'桥西区'),(130705,'宣化区'),(130706,'下花园区'),(130721,'宣化县'),(130722,'张北县'),(130723,'康保县'),(130724,'沽源县'),(130725,'尚义县'),(130726,'蔚县'),(130727,'阳原县'),(130728,'怀安县'),(130729,'万全县'),(130730,'怀来县'),(130731,'涿鹿县'),(130732,'赤城县'),(130733,'崇礼县'),(130802,'双桥区'),(130803,'双滦区'),(130804,'鹰手营子矿'),(130821,'承德县'),(130822,'兴隆县'),(130823,'平泉县'),(130824,'滦平县'),(130825,'隆化县'),(130826,'丰宁县'),(130827,'宽城县'),(130828,'围场满族蒙'),(130902,'新华区'),(130903,'运河区'),(130921,'沧县'),(130922,'青县'),(130923,'东光县'),(130924,'海兴县'),(130925,'盐山县'),(130926,'肃宁县'),(130927,'南皮县'),(130928,'吴桥县'),(130929,'献县'),(130930,'孟村县'),(130981,'泊头'),(130982,'任丘'),(130983,'黄骅'),(130984,'河间'),(131002,'安次区'),(131003,'广阳区'),(131022,'固安县'),(131023,'永清县'),(131024,'香河县'),(131025,'大城县'),(131026,'文安县'),(131028,'大厂县'),(131081,'霸州'),(131082,'三河'),(131102,'桃城区'),(131121,'枣强县'),(131122,'武邑县'),(131123,'武强县'),(131124,'饶阳县'),(131125,'安平县'),(131126,'故城县'),(131127,'景县'),(131128,'阜城县'),(131181,'冀州'),(131182,'深州'),(140105,'小店区'),(140106,'迎泽区'),(140107,'杏花岭区'),(140108,'尖草坪区'),(140109,'万柏林区'),(140110,'晋源区'),(140121,'清徐县'),(140122,'阳曲县'),(140123,'娄烦县'),(140181,'古交'),(140182,'榆次'),(140183,'大同'),(140184,'侯马'),(140185,'晋中'),(140202,'城区'),(140203,'矿区'),(140211,'南郊区'),(140212,'新荣区'),(140221,'阳高县'),(140222,'天镇县'),(140223,'广灵县'),(140224,'灵丘县'),(140225,'浑源县'),(140226,'左云县'),(140227,'大同县'),(140302,'城区'),(140303,'矿区'),(140311,'郊区'),(140321,'平定县'),(140322,'盂县'),(140402,'城区'),(140411,'郊区'),(140421,'长治县'),(140423,'襄垣县'),(140424,'屯留县'),(140425,'平顺县'),(140426,'黎城县'),(140427,'壶关县'),(140428,'长子县'),(140429,'武乡县'),(140430,'沁县'),(140431,'沁源县'),(140481,'潞城'),(140502,'城区'),(140521,'沁水县'),(140522,'阳城县'),(140524,'陵川县'),(140525,'泽州县'),(140581,'高平'),(140602,'朔城区'),(140603,'平鲁区'),(140621,'山阴县'),(140622,'应县'),(140623,'右玉县'),(140624,'怀仁县'),(140702,'榆次区'),(140721,'榆社县'),(140722,'左权县'),(140723,'和顺县'),(140724,'昔阳县'),(140725,'寿阳县'),(140726,'太谷县'),(140727,'祁县'),(140728,'平遥县'),(140729,'灵石县'),(140781,'介休'),(140802,'盐湖区'),(140821,'临猗县'),(140822,'万荣县'),(140823,'闻喜县'),(140824,'稷山县'),(140825,'新绛县'),(140826,'绛县'),(140827,'垣曲县'),(140828,'夏县'),(140829,'平陆县'),(140830,'芮城县'),(140881,'永济'),(140882,'河津'),(140902,'忻府区'),(140921,'定襄县'),(140922,'五台县'),(140923,'代县'),(140924,'繁峙县'),(140925,'宁武县'),(140926,'静乐县'),(140927,'神池县'),(140928,'五寨县'),(140929,'岢岚县'),(140930,'河曲县'),(140931,'保德县'),(140932,'偏关县'),(140981,'原平'),(141002,'尧都区'),(141021,'曲沃县'),(141022,'翼城县'),(141023,'襄汾县'),(141024,'洪洞县'),(141025,'古县'),(141026,'安泽县'),(141027,'浮山县'),(141028,'吉县'),(141029,'乡宁县'),(141030,'大宁县'),(141031,'隰县'),(141032,'永和县'),(141033,'蒲县'),(141034,'汾西县'),(141081,'侯马'),(141082,'霍州'),(141102,'离石区'),(141121,'文水县'),(141122,'交城县'),(141123,'兴县'),(141124,'临县'),(141125,'柳林县'),(141126,'石楼县'),(141127,'岚县'),(141128,'方山县'),(141129,'中阳县'),(141130,'交口县'),(141181,'孝义'),(141182,'汾阳'),(150101,'新城'),(150102,'赛罕'),(150103,'回民'),(150104,'玉泉'),(150105,'如意开发区'),(150106,'金桥开发区'),(150107,'金川开发区'),(150108,'金山开发区'),(150109,'土默特左旗'),(150110,'托克托'),(150111,'和林格尔'),(150112,'清水河'),(150113,'武川'),(150114,'呼和浩特周边'),(150202,'东河区'),(150203,'昆都仑区'),(150204,'青山区'),(150205,'石拐区'),(150206,'白云矿区'),(150207,'九原区'),(150221,'土默特右旗'),(150222,'固阳县'),(150223,'达尔罕茂明'),(150224,'滨河新区'),(150225,'稀土高新区'),(150302,'海勃湾区'),(150303,'海南区'),(150304,'乌达区'),(150402,'红山区'),(150403,'元宝山区'),(150404,'松山区'),(150421,'阿鲁科尔沁'),(150422,'巴林左旗'),(150423,'巴林右旗'),(150424,'林西县'),(150425,'克什克腾旗'),(150426,'翁牛特旗'),(150428,'喀喇沁旗'),(150429,'宁城县'),(150430,'敖汉旗'),(150502,'科尔沁区'),(150521,'科尔沁左翼'),(150522,'科尔沁左翼'),(150523,'开鲁县'),(150524,'库伦旗'),(150525,'奈曼旗'),(150526,'扎鲁特旗'),(150581,'霍林郭勒'),(150601,'市辖区'),(150602,'东胜区'),(150621,'达拉特旗'),(150622,'准格尔旗'),(150623,'鄂托克前旗'),(150624,'鄂托克旗'),(150625,'杭锦旗'),(150626,'乌审旗'),(150627,'伊金霍洛旗'),(150702,'海拉尔区'),(150721,'阿荣旗'),(150722,'莫力达瓦'),(150723,'鄂伦春'),(150724,'鄂温'),(150725,'陈巴尔虎旗'),(150726,'新巴尔虎左旗'),(150727,'新巴尔虎右旗'),(150781,'满洲里'),(150782,'牙克石'),(150783,'扎兰屯'),(150784,'额尔古纳'),(150785,'根河'),(150802,'临河区'),(150821,'五原县'),(150822,'磴口县'),(150823,'乌拉特前旗'),(150824,'乌拉特中旗'),(150825,'乌拉特后旗'),(150826,'杭锦后旗'),(150902,'集宁区'),(150921,'卓资县'),(150922,'化德县'),(150923,'商都县'),(150924,'兴和县'),(150925,'凉城县'),(150926,'察哈尔右翼'),(150927,'察哈尔右翼'),(150928,'察哈尔右翼'),(150929,'四子王旗'),(150981,'丰镇'),(152201,'乌兰浩特'),(152202,'阿尔山'),(152221,'科尔沁右翼'),(152222,'科尔沁右翼'),(152223,'扎赉特旗'),(152224,'突泉县'),(152501,'二连浩特'),(152502,'锡林浩特'),(152522,'阿巴嘎旗'),(152523,'苏尼特左旗'),(152524,'苏尼特右旗'),(152525,'东乌珠穆沁'),(152526,'西乌珠穆沁'),(152527,'太仆寺旗'),(152528,'镶黄旗'),(152529,'正镶白旗'),(152530,'正蓝旗'),(152531,'多伦县'),(152921,'阿拉善左旗'),(152922,'阿拉善右旗'),(152923,'额济纳旗'),(210102,'和平区'),(210103,'沈河区'),(210104,'大东区'),(210105,'皇姑区'),(210106,'铁西区'),(210111,'苏家屯区'),(210112,'东陵区'),(210113,'沈北新区'),(210114,'于洪区'),(210122,'辽中县'),(210123,'康平县'),(210124,'法库县'),(210181,'新民'),(210182,'浑南新区'),(210202,'中山区'),(210203,'西岗区'),(210204,'沙河口'),(210211,'甘井子区'),(210212,'旅顺口区'),(210213,'金州区'),(210214,'高新园区'),(210215,'开发区'),(210224,'长海县'),(210281,'瓦房店'),(210282,'普兰店'),(210283,'庄河'),(210302,'铁东区'),(210303,'铁西区'),(210304,'立山区'),(210311,'千山区'),(210321,'台安县'),(210323,'岫岩县'),(210381,'海城'),(210402,'新抚区'),(210403,'东洲区'),(210404,'望花区'),(210411,'顺城区'),(210421,'抚顺县'),(210422,'新宾县'),(210423,'清原县'),(210502,'平山区'),(210503,'溪湖区'),(210504,'明山区'),(210505,'南芬区'),(210521,'本溪县'),(210522,'桓仁县'),(210602,'元宝区'),(210603,'振兴区'),(210604,'振安区'),(210624,'宽甸县'),(210681,'东港'),(210682,'凤城'),(210702,'古塔区'),(210703,'凌河区'),(210711,'太和区'),(210726,'黑山县'),(210727,'义县'),(210781,'凌海'),(210782,'北镇'),(210802,'站前区'),(210803,'西市区'),(210804,'鲅鱼圈区'),(210811,'老边区'),(210881,'盖州'),(210882,'大石桥'),(210902,'海州区'),(210903,'新邱区'),(210904,'太平区'),(210905,'清河门区'),(210911,'细河区'),(210921,'阜新'),(210922,'彰武县'),(211002,'白塔区'),(211003,'文圣区'),(211004,'宏伟区'),(211005,'弓长岭区'),(211011,'太子河区'),(211021,'辽阳县'),(211081,'灯塔'),(211102,'双台子区'),(211103,'兴隆台区'),(211121,'大洼县'),(211122,'盘山县'),(211202,'银州区'),(211204,'清河区'),(211221,'铁岭县'),(211223,'西丰县'),(211224,'昌图县'),(211281,'调兵山'),(211282,'开原'),(211302,'双塔区'),(211303,'龙城区'),(211321,'朝阳县'),(211322,'建平县'),(211324,'喀喇沁左翼'),(211381,'北票'),(211382,'凌源'),(211402,'连山区'),(211403,'龙港区'),(211404,'南票区'),(211421,'绥中县'),(211422,'建昌县'),(211481,'兴城'),(220102,'南关区'),(220103,'宽城区'),(220104,'朝阳区'),(220105,'二道区'),(220106,'绿园区'),(220112,'双阳区'),(220122,'农安县'),(220181,'九台'),(220182,'榆树'),(220183,'德惠'),(220184,'高新区'),(220185,'净月区'),(220186,'经开区'),(220187,'汽车厂'),(220202,'昌邑区'),(220203,'龙潭区'),(220204,'船营区'),(220211,'丰满区'),(220221,'永吉县'),(220281,'蛟河'),(220282,'桦甸'),(220283,'舒兰'),(220284,'磐石'),(220302,'铁西区'),(220303,'铁东区'),(220322,'梨树县'),(220323,'伊通县'),(220381,'公主岭'),(220382,'双辽'),(220402,'龙山区'),(220403,'西安区'),(220421,'东丰县'),(220422,'东辽县'),(220502,'东昌区'),(220503,'二道江区'),(220521,'通化县'),(220523,'辉南县'),(220524,'柳河县'),(220581,'梅河口'),(220582,'集安'),(220602,'八道江区'),(220605,'江源区'),(220621,'抚松县'),(220622,'靖宇县'),(220623,'长白'),(220681,'临江'),(220702,'宁江区'),(220721,'前郭尔罗斯'),(220722,'长岭县'),(220723,'乾安县'),(220724,'扶余县'),(220802,'洮北区'),(220821,'镇赉县'),(220822,'通榆县'),(220881,'洮南'),(220882,'大安'),(222401,'延吉'),(222402,'图们'),(222403,'敦化'),(222404,'珲春'),(222405,'龙井'),(222406,'和龙'),(222424,'汪清县'),(222426,'安图县'),(230102,'道里区'),(230103,'南岗区'),(230104,'道外区'),(230108,'平房区'),(230109,'松北区'),(230110,'香坊区'),(230111,'呼兰区'),(230112,'阿城区'),(230123,'依兰县'),(230124,'方正县'),(230125,'宾县'),(230126,'巴彦县'),(230127,'木兰县'),(230128,'通河县'),(230129,'延寿县'),(230182,'双城区'),(230183,'尚志'),(230184,'五常'),(230185,'江北区'),(230186,'开发区'),(230202,'龙沙区'),(230203,'建华区'),(230204,'铁锋区'),(230205,'昂昂溪区'),(230206,'富拉尔基区'),(230207,'碾子山区'),(230208,'梅里斯'),(230221,'龙江县'),(230223,'依安县'),(230224,'泰来县'),(230225,'甘南县'),(230227,'富裕县'),(230229,'克山县'),(230230,'克东县'),(230231,'拜泉县'),(230281,'讷河'),(230302,'鸡冠区'),(230303,'恒山区'),(230304,'滴道区'),(230305,'梨树区'),(230306,'城子河区'),(230307,'麻山区'),(230321,'鸡东县'),(230381,'虎林'),(230382,'密山'),(230402,'向阳区'),(230403,'工农区'),(230404,'南山区'),(230405,'兴安区'),(230406,'东山区'),(230407,'兴山区'),(230421,'萝北县'),(230422,'绥滨县'),(230502,'尖山区'),(230503,'岭东区'),(230505,'四方台区'),(230506,'宝山区'),(230521,'集贤县'),(230522,'友谊县'),(230523,'宝清县'),(230524,'饶河县'),(230602,'萨尔图区'),(230603,'龙凤区'),(230604,'让胡路区'),(230605,'红岗区'),(230606,'大同区'),(230621,'肇州县'),(230622,'肇源县'),(230623,'林甸县'),(230624,'杜尔伯特'),(230702,'伊春区'),(230703,'南岔区'),(230704,'友好区'),(230705,'西林区'),(230706,'翠峦区'),(230707,'新青区'),(230708,'美溪区'),(230709,'金山屯区'),(230710,'五营区'),(230711,'乌马河区'),(230712,'汤旺河区'),(230713,'带岭区'),(230714,'乌伊岭区'),(230715,'红星区'),(230716,'上甘岭区'),(230722,'嘉荫县'),(230781,'铁力'),(230803,'向阳区'),(230804,'前进区'),(230805,'东风区'),(230811,'郊区'),(230822,'桦南县'),(230826,'桦川县'),(230828,'汤原县'),(230833,'抚远县'),(230881,'同江'),(230882,'富锦'),(230902,'新兴区'),(230903,'桃山区'),(230904,'茄子河区'),(230921,'勃利县'),(231002,'东安区'),(231003,'阳明区'),(231004,'爱民区'),(231005,'西安区'),(231024,'东宁县'),(231025,'林口县'),(231081,'绥芬河'),(231083,'海林'),(231084,'宁安'),(231085,'穆棱'),(231102,'爱辉区'),(231121,'嫩江县'),(231123,'逊克县'),(231124,'孙吴县'),(231181,'北安'),(231182,'五大连池'),(231202,'北林区'),(231221,'望奎县'),(231222,'兰西县'),(231223,'青冈县'),(231224,'庆安县'),(231225,'明水县'),(231226,'绥棱县'),(231281,'安达'),(231282,'肇东'),(231283,'海伦'),(232701,'加格达奇区'),(232702,'松岭区'),(232703,'新林区'),(232704,'呼中区'),(232721,'呼玛县'),(232722,'塔河县'),(232723,'漠河县'),(310101,'黄浦区'),(310103,'卢湾区'),(310104,'徐汇区'),(310105,'长宁区'),(310106,'静安区'),(310107,'普陀区'),(310108,'闸北区'),(310109,'虹口区'),(310110,'杨浦区'),(310112,'闵行区'),(310113,'宝山区'),(310114,'嘉定区'),(310115,'浦东新区'),(310116,'金山区'),(310117,'松江区'),(310118,'青浦区'),(310120,'奉贤区'),(310130,'崇明县'),(320102,'玄武区'),(320103,'白下区'),(320104,'秦淮区'),(320105,'建邺区'),(320106,'鼓楼区'),(320107,'下关区'),(320111,'浦口区'),(320113,'栖霞区'),(320114,'雨花台区'),(320115,'江宁区'),(320116,'六合区'),(320124,'溧水县'),(320125,'高淳县'),(320132,'大厂区'),(320202,'崇安区'),(320203,'南长区'),(320204,'北塘区'),(320205,'锡山区'),(320206,'惠山区'),(320211,'滨湖区'),(320212,'新区'),(320281,'江阴'),(320282,'宜兴'),(320302,'鼓楼区'),(320303,'云龙区'),(320304,'九里区'),(320305,'贾汪区'),(320311,'泉山区'),(320321,'丰县'),(320322,'沛县'),(320323,'铜山县'),(320324,'睢宁县'),(320381,'新沂'),(320382,'邳州'),(320383,'金山桥开发区'),(320384,'新城区'),(320402,'天宁区'),(320404,'钟楼区'),(320405,'戚墅堰区'),(320411,'新北区'),(320412,'武进区'),(320481,'溧阳'),(320482,'金坛'),(320502,'沧浪区'),(320503,'平江区'),(320504,'金阊区'),(320505,'虎丘区'),(320506,'吴中区'),(320507,'相城区'),(320508,'新区'),(320509,'园区'),(320581,'常熟'),(320582,'张家港'),(320583,'昆山市'),(320584,'吴江'),(320585,'太仓'),(320602,'崇川区'),(320611,'港闸区'),(320621,'海安县'),(320623,'如东县'),(320681,'启东'),(320682,'如皋'),(320683,'通州'),(320684,'海门'),(320685,'开发区'),(320703,'连云区'),(320705,'新浦区'),(320706,'海州区'),(320721,'赣榆县'),(320722,'东海县'),(320723,'灌云县'),(320724,'灌南县'),(320802,'清河区'),(320803,'楚州区'),(320804,'淮阴区'),(320811,'清浦区'),(320826,'涟水县'),(320829,'洪泽县'),(320830,'盱眙县'),(320831,'金湖县'),(320832,'淮安区'),(320833,'经济开发区'),(320902,'亭湖区'),(320903,'盐都区'),(320921,'响水县'),(320922,'滨海县'),(320923,'阜宁县'),(320924,'射阳县'),(320925,'建湖县'),(320981,'东台'),(320982,'大丰'),(321002,'广陵区'),(321003,'邗江区'),(321011,'维扬区'),(321023,'宝应县'),(321081,'仪征'),(321084,'高邮'),(321088,'江都'),(321102,'京口区'),(321111,'润州区'),(321112,'丹徒区'),(321181,'丹阳'),(321182,'扬中'),(321183,'句容'),(321202,'海陵区'),(321203,'高港区'),(321281,'兴化'),(321282,'靖江'),(321283,'泰兴'),(321284,'姜堰'),(321302,'宿城区'),(321311,'宿豫区'),(321322,'沭阳县'),(321323,'泗阳县'),(321324,'泗洪县'),(330102,'上城区'),(330103,'下城区'),(330104,'江干区'),(330105,'拱墅区'),(330106,'西湖区'),(330108,'滨江区'),(330109,'萧山区'),(330110,'余杭区'),(330122,'桐庐县'),(330127,'淳安县'),(330182,'建德'),(330183,'富阳'),(330185,'临安'),(330186,'其他'),(330203,'海曙区'),(330204,'江东区'),(330205,'江北区'),(330206,'北仑区'),(330211,'镇海区'),(330212,'鄞州区'),(330225,'象山县'),(330226,'宁海县'),(330281,'余姚'),(330282,'慈溪'),(330283,'奉化'),(330284,'高新区'),(330302,'鹿城区'),(330303,'龙湾区'),(330304,'瓯海区'),(330322,'洞头县'),(330324,'永嘉县'),(330326,'平阳县'),(330327,'苍南县'),(330328,'文成县'),(330329,'泰顺县'),(330381,'瑞安'),(330382,'乐清'),(330402,'南湖区'),(330411,'秀洲区'),(330421,'嘉善县'),(330424,'海盐县'),(330481,'海宁'),(330482,'平湖'),(330483,'桐乡'),(330484,'经济开发区'),(330485,'嘉兴市区'),(330502,'吴兴区'),(330503,'南浔区'),(330521,'德清县'),(330522,'长兴县'),(330523,'安吉县'),(330602,'越城区'),(330621,'绍兴县'),(330624,'新昌县'),(330681,'诸暨'),(330682,'上虞'),(330683,'嵊州'),(330702,'婺城区'),(330703,'金东区'),(330723,'武义县'),(330726,'浦江县'),(330727,'磐安县'),(330781,'兰溪'),(330782,'义乌'),(330783,'东阳'),(330784,'永康'),(330802,'柯城区'),(330803,'衢江区'),(330822,'常山县'),(330824,'开化县'),(330825,'龙游县'),(330881,'江山'),(330902,'定海区'),(330903,'普陀区'),(330921,'岱山县'),(330922,'嵊泗县'),(331002,'椒江区'),(331003,'黄岩区'),(331004,'路桥区'),(331021,'玉环县'),(331022,'三门县'),(331023,'天台县'),(331024,'仙居县'),(331081,'温岭'),(331082,'临海'),(331102,'莲都区'),(331121,'青田县'),(331122,'缙云县'),(331123,'遂昌县'),(331124,'松阳县'),(331125,'云和县'),(331126,'庆元县'),(331127,'景宁'),(331181,'龙泉'),(331201,'稠城'),(331202,'北苑'),(331203,'稠江'),(331204,'江东'),(331205,'后宅'),(331206,'城西'),(331207,'廿三里'),(331208,'义乌市区'),(331209,'义乌周边'),(340102,'瑶海区'),(340103,'庐阳区'),(340104,'蜀山区'),(340111,'包河区'),(340121,'长丰县'),(340122,'肥东县'),(340123,'肥西县'),(340124,'滨湖新区'),(340125,'经开区'),(340126,'新站区'),(340127,'政务区'),(340128,'高新区'),(340129,'其他'),(340202,'镜湖区'),(340203,'弋江区'),(340207,'鸠江区'),(340208,'三山区'),(340221,'芜湖县'),(340222,'繁昌县'),(340223,'南陵县'),(340224,'无为县'),(340225,'周边'),(340302,'龙子湖区'),(340303,'蚌山区'),(340304,'禹会区'),(340311,'淮上区'),(340321,'怀远县'),(340322,'五河县'),(340323,'固镇县'),(340402,'大通区'),(340403,'田家庵区'),(340404,'谢家集区'),(340405,'八公山区'),(340406,'潘集区'),(340421,'凤台县'),(340502,'金家庄区'),(340503,'花山区'),(340504,'雨山区'),(340521,'当涂县'),(340602,'杜集区'),(340603,'相山区'),(340604,'烈山区'),(340621,'濉溪县'),(340702,'铜官山区'),(340703,'狮子山区'),(340711,'郊区'),(340721,'铜陵县'),(340802,'迎江区'),(340803,'大观区'),(340811,'宜秀区'),(340822,'怀宁县'),(340823,'枞阳县'),(340824,'潜山县'),(340825,'太湖县'),(340826,'宿松县'),(340827,'望江县'),(340828,'岳西县'),(340881,'桐城'),(341002,'屯溪区'),(341003,'黄山区'),(341004,'徽州区'),(341021,'歙县'),(341022,'休宁县'),(341023,'黟县'),(341024,'祁门县'),(341102,'琅琊区'),(341103,'南谯区'),(341122,'来安县'),(341124,'全椒县'),(341125,'定远县'),(341126,'凤阳县'),(341181,'天长'),(341182,'明光'),(341202,'颍州区'),(341203,'颍东区'),(341204,'颍泉区'),(341221,'临泉县'),(341222,'太和县'),(341225,'阜南县'),(341226,'颍上县'),(341282,'界首'),(341302,'埇桥区'),(341321,'砀山县'),(341322,'萧县'),(341323,'灵璧县'),(341324,'泗县'),(341402,'居巢区'),(341421,'庐江县'),(341422,'无为县'),(341423,'含山县'),(341424,'和县'),(341502,'金安区'),(341503,'裕安区'),(341521,'寿县'),(341522,'霍邱县'),(341523,'舒城县'),(341524,'金寨县'),(341525,'霍山县'),(341602,'谯城区'),(341621,'涡阳县'),(341622,'蒙城县'),(341623,'利辛县'),(341702,'贵池区'),(341721,'东至县'),(341722,'石台县'),(341723,'青阳县'),(341802,'宣州区'),(341821,'郎溪县'),(341822,'广德县'),(341823,'泾县'),(341824,'绩溪县'),(341825,'旌德县'),(341881,'宁国'),(350102,'鼓楼区'),(350103,'台江区'),(350104,'仓山区'),(350105,'马尾区'),(350111,'晋安区'),(350121,'闽侯县'),(350122,'连江县'),(350123,'罗源县'),(350124,'闽清县'),(350125,'永泰县'),(350128,'平潭县'),(350181,'福清'),(350182,'长乐'),(350183,'其他'),(350203,'思明区'),(350205,'海沧区'),(350206,'湖里区'),(350211,'集美区'),(350212,'同安区'),(350213,'翔安区'),(350214,'漳州'),(350302,'城厢区'),(350303,'涵江区'),(350304,'荔城区'),(350305,'秀屿区'),(350322,'仙游县'),(350402,'梅列区'),(350403,'三元区'),(350421,'明溪县'),(350423,'清流县'),(350424,'宁化县'),(350425,'大田县'),(350426,'尤溪县'),(350427,'沙县'),(350428,'将乐县'),(350429,'泰宁县'),(350430,'建宁县'),(350481,'永安'),(350502,'鲤城区'),(350503,'丰泽区'),(350504,'洛江区'),(350505,'泉港区'),(350521,'惠安县'),(350524,'安溪县'),(350525,'永春县'),(350526,'德化县'),(350527,'金门县'),(350581,'石狮'),(350582,'晋江'),(350583,'南安'),(350584,'台商投资区'),(350585,'清濛开发区'),(350602,'芗城区'),(350603,'龙文区'),(350622,'云霄县'),(350623,'漳浦县'),(350624,'诏安县'),(350625,'长泰县'),(350626,'东山县'),(350627,'南靖县'),(350628,'平和县'),(350629,'华安县'),(350681,'龙海'),(350702,'延平区'),(350721,'顺昌县'),(350722,'浦城县'),(350723,'光泽县'),(350724,'松溪县'),(350725,'政和县'),(350781,'邵武'),(350782,'武夷山'),(350783,'建瓯'),(350784,'建阳'),(350802,'新罗区'),(350821,'长汀县'),(350822,'永定县'),(350823,'上杭县'),(350824,'武平县'),(350825,'连城县'),(350881,'漳平'),(350902,'蕉城区'),(350921,'霞浦县'),(350922,'古田县'),(350923,'屏南县'),(350924,'寿宁县'),(350925,'周宁县'),(350926,'柘荣县'),(350981,'福安'),(350982,'福鼎'),(360102,'东湖区'),(360103,'西湖区'),(360104,'青云谱区'),(360105,'湾里区'),(360111,'青山湖区'),(360112,'红谷滩新区'),(360113,'昌北经济开发区'),(360115,'高新开发区'),(360121,'南昌县'),(360122,'新建县'),(360123,'安义县'),(360124,'进贤县'),(360202,'昌江区'),(360203,'珠山区'),(360222,'浮梁县'),(360281,'乐平'),(360302,'安源区'),(360313,'湘东区'),(360321,'莲花县'),(360322,'上栗县'),(360323,'芦溪县'),(360402,'庐山区'),(360403,'浔阳区'),(360421,'九江县'),(360423,'武宁县'),(360424,'修水县'),(360425,'永修县'),(360426,'德安县'),(360427,'星子县'),(360428,'都昌县'),(360429,'湖口县'),(360430,'彭泽县'),(360481,'瑞昌'),(360502,'渝水区'),(360521,'分宜县'),(360602,'月湖区'),(360622,'余江县'),(360681,'贵溪'),(360702,'章贡区'),(360721,'赣县'),(360722,'信丰县'),(360723,'大余县'),(360724,'上犹县'),(360725,'崇义县'),(360726,'安远县'),(360727,'龙南县'),(360728,'定南县'),(360729,'全南县'),(360730,'宁都县'),(360731,'于都县'),(360732,'兴国县'),(360733,'会昌县'),(360734,'寻乌县'),(360735,'石城县'),(360781,'瑞金'),(360782,'南康'),(360783,'章江新区'),(360784,'开发区'),(360785,'站北区'),(360802,'吉州区'),(360803,'青原区'),(360821,'吉安县'),(360822,'吉水县'),(360823,'峡江县'),(360824,'新干县'),(360825,'永丰县'),(360826,'泰和县'),(360827,'遂川县'),(360828,'万安县'),(360829,'安福县'),(360830,'永新县'),(360881,'井冈山'),(360902,'袁州区'),(360921,'奉新县'),(360922,'万载县'),(360923,'上高县'),(360924,'宜丰县'),(360925,'靖安县'),(360926,'铜鼓县'),(360981,'丰城'),(360982,'樟树'),(360983,'高安'),(361002,'临川区'),(361021,'南城县'),(361022,'黎川县'),(361023,'南丰县'),(361024,'崇仁县'),(361025,'乐安县'),(361026,'宜黄县'),(361027,'金溪县'),(361028,'资溪县'),(361029,'东乡县'),(361030,'广昌县'),(361102,'信州区'),(361121,'上饶县'),(361122,'广丰县'),(361123,'玉山县'),(361124,'铅山县'),(361125,'横峰县'),(361126,'弋阳县'),(361127,'余干县'),(361128,'鄱阳县'),(361129,'万年县'),(361130,'婺源县'),(361181,'德兴'),(370102,'历下区'),(370103,'市中区'),(370104,'槐荫区'),(370105,'天桥区'),(370112,'历城区'),(370113,'长清区'),(370124,'平阴县'),(370125,'济阳县'),(370126,'商河县'),(370181,'章丘'),(370182,'高新区'),(370183,'齐河县'),(370202,'市南区'),(370203,'市北区'),(370205,'四方区'),(370211,'黄岛区'),(370212,'崂山区'),(370213,'李沧区'),(370214,'城阳区'),(370281,'胶州'),(370282,'即墨'),(370283,'平度'),(370284,'胶南'),(370285,'莱西'),(370302,'淄川区'),(370303,'张店区'),(370304,'博山区'),(370305,'临淄区'),(370306,'周村区'),(370321,'桓台县'),(370322,'高青县'),(370323,'沂源县'),(370402,'市中区'),(370403,'薛城区'),(370404,'峄城区'),(370405,'台儿庄区'),(370406,'山亭区'),(370481,'滕州'),(370502,'东营区'),(370503,'河口区'),(370521,'垦利县'),(370522,'利津县'),(370523,'广饶县'),(370602,'芝罘区'),(370611,'福山区'),(370612,'牟平区'),(370613,'莱山区'),(370634,'长岛县'),(370681,'龙口'),(370682,'莱阳'),(370683,'莱州'),(370684,'蓬莱'),(370685,'招远'),(370686,'栖霞'),(370687,'海阳'),(370688,'开发区'),(370689,'大学城'),(370690,'高新区'),(370702,'潍城区'),(370703,'寒亭区'),(370704,'坊子区'),(370705,'奎文区'),(370724,'临朐县'),(370725,'昌乐县'),(370781,'青州'),(370782,'诸城'),(370783,'寿光'),(370784,'安丘'),(370785,'高密'),(370786,'昌邑'),(370787,'高新区'),(370788,'滨海新区'),(370789,'经开区'),(370802,'市中区'),(370811,'任城区'),(370826,'微山县'),(370827,'鱼台县'),(370828,'金乡县'),(370829,'嘉祥县'),(370830,'汶上县'),(370831,'泗水县'),(370832,'梁山县'),(370881,'曲阜'),(370882,'兖州'),(370883,'邹城'),(370902,'泰山区'),(370911,'岱岳区'),(370921,'宁阳县'),(370923,'东平县'),(370982,'新泰'),(370983,'肥城'),(371002,'环翠区'),(371081,'文登'),(371082,'荣成'),(371083,'乳山'),(371084,'高区'),(371085,'经区'),(371102,'东港区'),(371103,'岚山区'),(371121,'五莲县'),(371122,'莒县'),(371202,'莱城区'),(371203,'钢城区'),(371302,'兰山区'),(371311,'罗庄区'),(371312,'河东区'),(371321,'沂南县'),(371322,'郯城县'),(371323,'沂水县'),(371324,'苍山县'),(371325,'费县'),(371326,'平邑县'),(371327,'莒南县'),(371328,'蒙阴县'),(371329,'临沭县'),(371330,'北城新区'),(371331,'开发区'),(371332,'高新区'),(371402,'德城区'),(371421,'陵县'),(371422,'宁津县'),(371423,'庆云县'),(371424,'临邑县'),(371425,'齐河县'),(371426,'平原县'),(371427,'夏津县'),(371428,'武城县'),(371481,'乐陵'),(371482,'禹城'),(371502,'东昌府区'),(371521,'阳谷县'),(371522,'莘县'),(371523,'茌平县'),(371524,'东阿县'),(371525,'冠县'),(371526,'高唐县'),(371581,'临清'),(371602,'滨城区'),(371621,'惠民县'),(371622,'阳信县'),(371623,'无棣县'),(371624,'沾化县'),(371625,'博兴县'),(371626,'邹平县'),(371702,'牡丹区'),(371721,'曹县'),(371722,'单县'),(371723,'成武县'),(371724,'巨野县'),(371725,'郓城县'),(371726,'鄄城县'),(371727,'定陶县'),(371728,'东明县'),(410102,'中原区'),(410103,'二七区'),(410104,'管城'),(410105,'金水区'),(410106,'上街区'),(410108,'惠济区'),(410109,'郑东新区'),(410110,'高新区'),(410181,'巩义'),(410182,'荥阳'),(410183,'新密'),(410185,'登封'),(410186,'经开区'),(410187,'新郑'),(410202,'龙亭区'),(410203,'顺河'),(410204,'鼓楼区'),(410205,'禹王台区'),(410211,'金明区'),(410221,'杞县'),(410222,'通许县'),(410223,'尉氏县'),(410224,'开封县'),(410225,'兰考县'),(410302,'老城区'),(410303,'西工区'),(410304,'瀍河'),(410305,'涧西区'),(410306,'吉利区'),(410311,'洛龙区'),(410322,'孟津县'),(410323,'新安县'),(410324,'栾川县'),(410325,'嵩县'),(410326,'汝阳县'),(410327,'宜阳县'),(410328,'洛宁县'),(410329,'伊川县'),(410381,'偃师'),(410402,'新华区'),(410403,'卫东区'),(410404,'石龙区'),(410411,'湛河区'),(410421,'宝丰县'),(410422,'叶县'),(410423,'鲁山县'),(410425,'郏县'),(410481,'舞钢'),(410482,'汝州'),(410502,'文峰区'),(410503,'北关区'),(410505,'殷都区'),(410506,'龙安区'),(410522,'安阳县'),(410523,'汤阴县'),(410526,'滑县'),(410527,'内黄县'),(410581,'林州'),(410602,'鹤山区'),(410603,'山城区'),(410611,'淇滨区'),(410621,'浚县'),(410622,'淇县'),(410702,'红旗区'),(410703,'卫滨区'),(410704,'凤泉区'),(410711,'牧野区'),(410721,'新乡县'),(410724,'获嘉县'),(410725,'原阳县'),(410726,'延津县'),(410727,'封丘县'),(410728,'长垣县'),(410781,'卫辉'),(410782,'辉县'),(410802,'解放区'),(410803,'中站区'),(410804,'马村区'),(410811,'山阳区'),(410821,'修武县'),(410822,'博爱县'),(410823,'武陟县'),(410825,'温县'),(410881,'济源'),(410882,'沁阳'),(410883,'孟州'),(410902,'华龙区'),(410922,'清丰县'),(410923,'南乐县'),(410926,'范县'),(410927,'台前县'),(410928,'濮阳县'),(411002,'魏都区'),(411023,'许昌县'),(411024,'鄢陵县'),(411025,'襄城县'),(411081,'禹州'),(411082,'长葛'),(411102,'源汇区'),(411103,'郾城区'),(411104,'召陵区'),(411121,'舞阳县'),(411122,'临颍县'),(411202,'湖滨区'),(411221,'渑池县'),(411222,'陕县'),(411224,'卢氏县'),(411281,'义马'),(411282,'灵宝'),(411302,'宛城区'),(411303,'卧龙区'),(411321,'南召县'),(411322,'方城县'),(411323,'西峡县'),(411324,'镇平县'),(411325,'内乡县'),(411326,'淅川县'),(411327,'社旗县'),(411328,'唐河县'),(411329,'新野县'),(411330,'桐柏县'),(411381,'邓州'),(411382,'白银区'),(411402,'梁园区'),(411403,'睢阳区'),(411421,'民权县'),(411422,'睢县'),(411423,'宁陵县'),(411424,'柘城县'),(411425,'虞城县'),(411426,'夏邑县'),(411481,'永城'),(411502,'浉河区'),(411503,'平桥区'),(411521,'罗山县'),(411522,'光山县'),(411523,'新县'),(411524,'商城县'),(411525,'固始县'),(411526,'潢川县'),(411527,'淮滨县'),(411528,'息县'),(411602,'川汇区'),(411621,'扶沟县'),(411622,'西华县'),(411623,'商水县'),(411624,'沈丘县'),(411625,'郸城县'),(411626,'淮阳县'),(411627,'太康县'),(411628,'鹿邑县'),(411681,'项城'),(411702,'驿城区'),(411721,'西平县'),(411722,'上蔡县'),(411723,'平舆县'),(411724,'正阳县'),(411725,'确山县'),(411726,'泌阳县'),(411727,'汝南县'),(411728,'遂平县'),(411729,'新蔡县'),(420102,'江岸区'),(420103,'江汉区'),(420104,'硚口区'),(420105,'汉阳区'),(420106,'武昌区'),(420107,'青山区'),(420111,'洪山区'),(420112,'东西湖区'),(420113,'汉南区'),(420114,'蔡甸区'),(420115,'江夏区'),(420116,'黄陂区'),(420117,'新洲区'),(420118,'其他'),(420202,'黄石港区'),(420203,'西塞山区'),(420204,'下陆区'),(420205,'铁山区'),(420222,'阳新县'),(420281,'大冶'),(420302,'茅箭区'),(420303,'张湾区'),(420321,'郧县'),(420322,'郧西县'),(420323,'竹山县'),(420324,'竹溪县'),(420325,'房县'),(420381,'丹江口'),(420502,'西陵区'),(420503,'伍家岗区'),(420504,'点军区'),(420505,'猇亭区'),(420506,'夷陵区'),(420525,'远安县'),(420526,'兴山县'),(420527,'秭归县'),(420528,'长阳'),(420529,'五峰'),(420581,'宜都'),(420582,'当阳'),(420583,'枝江'),(420602,'襄城区'),(420606,'樊城区'),(420607,'襄州区'),(420624,'南漳县'),(420625,'谷城县'),(420626,'保康县'),(420682,'老河口'),(420683,'枣阳'),(420684,'宜城'),(420685,'高新区'),(420686,'鱼梁州区'),(420702,'梁子湖区'),(420703,'华容区'),(420704,'鄂城区'),(420802,'东宝区'),(420804,'掇刀区'),(420821,'京山县'),(420822,'沙洋县'),(420881,'钟祥'),(420902,'孝南区'),(420921,'孝昌县'),(420922,'大悟县'),(420923,'云梦县'),(420981,'应城'),(420982,'安陆'),(420984,'汉川'),(421002,'沙市区'),(421003,'荆州区'),(421022,'公安县'),(421023,'监利县'),(421024,'江陵县'),(421081,'石首'),(421083,'洪湖'),(421087,'松滋'),(421102,'黄州区'),(421121,'团风县'),(421122,'红安县'),(421123,'罗田县'),(421124,'英山县'),(421125,'浠水县'),(421126,'蕲春县'),(421127,'黄梅县'),(421181,'麻城'),(421182,'武穴'),(421202,'咸安区'),(421221,'嘉鱼县'),(421222,'通城县'),(421223,'崇阳县'),(421224,'通山县'),(421281,'赤壁'),(421302,'曾都区'),(421381,'广水'),(422801,'恩施'),(422802,'利川'),(422822,'建始县'),(422823,'巴东县'),(422825,'宣恩县'),(422826,'咸丰县'),(422827,'来凤县'),(422828,'鹤峰县'),(429004,'仙桃'),(429005,'潜江'),(429006,'天门'),(429021,'神农架林区'),(430102,'芙蓉区'),(430103,'天心区'),(430104,'岳麓区'),(430105,'开福区'),(430111,'雨花区'),(430121,'长沙县'),(430122,'望城县'),(430124,'宁乡县'),(430181,'浏阳'),(430202,'荷塘区'),(430203,'芦淞区'),(430204,'石峰区'),(430211,'天元区'),(430221,'株洲县'),(430223,'攸县'),(430224,'茶陵县'),(430225,'炎陵县'),(430281,'醴陵'),(430302,'雨湖区'),(430304,'岳塘区'),(430321,'湘潭县'),(430381,'湘乡'),(430382,'韶山'),(430405,'珠晖区'),(430406,'雁峰区'),(430407,'石鼓区'),(430408,'蒸湘区'),(430412,'南岳区'),(430421,'衡阳县'),(430422,'衡南县'),(430423,'衡山县'),(430424,'衡东县'),(430426,'祁东县'),(430481,'耒阳'),(430482,'常宁'),(430502,'双清区'),(430503,'大祥区'),(430511,'北塔区'),(430521,'邵东县'),(430522,'新邵县'),(430523,'邵阳县'),(430524,'隆回县'),(430525,'洞口县'),(430527,'绥宁县'),(430528,'新宁县'),(430529,'城步'),(430581,'武冈'),(430602,'岳阳楼区'),(430603,'云溪区'),(430611,'君山区'),(430621,'岳阳县'),(430623,'华容县'),(430624,'湘阴县'),(430626,'平江县'),(430681,'汨罗'),(430682,'临湘'),(430702,'武陵区'),(430703,'鼎城区'),(430721,'安乡县'),(430722,'汉寿县'),(430723,'澧县'),(430724,'临澧县'),(430725,'桃源县'),(430726,'石门县'),(430781,'津'),(430802,'永定区'),(430811,'武陵源区'),(430821,'慈利县'),(430822,'桑植县'),(430902,'资阳区'),(430903,'赫山区'),(430921,'南县'),(430922,'桃江县'),(430923,'安化县'),(430981,'沅江'),(431002,'北湖区'),(431003,'苏仙区'),(431021,'桂阳县'),(431022,'宜章县'),(431023,'永兴县'),(431024,'嘉禾县'),(431025,'临武县'),(431026,'汝城县'),(431027,'桂东县'),(431028,'安仁县'),(431081,'资兴'),(431102,'零陵区'),(431103,'冷水滩区'),(431121,'祁阳县'),(431122,'东安县'),(431123,'双牌县'),(431124,'道县'),(431125,'江永县'),(431126,'宁远县'),(431127,'蓝山县'),(431128,'新田县'),(431129,'江华'),(431202,'鹤城区'),(431221,'中方县'),(431222,'沅陵县'),(431223,'辰溪县'),(431224,'溆浦县'),(431225,'会同县'),(431226,'麻阳'),(431227,'新晃'),(431228,'芷江'),(431229,'靖州'),(431230,'通道'),(431281,'洪江'),(431302,'娄星区'),(431321,'双峰县'),(431322,'新化县'),(431381,'冷水江'),(431382,'涟源'),(433101,'吉首'),(433122,'泸溪县'),(433123,'凤凰县'),(433124,'花垣县'),(433125,'保靖县'),(433126,'古丈县'),(433127,'永顺县'),(433130,'龙山县'),(440103,'荔湾区'),(440104,'越秀区'),(440105,'海珠区'),(440106,'天河区'),(440111,'白云区'),(440112,'黄埔区'),(440113,'番禺区'),(440114,'花都区'),(440115,'南沙区'),(440116,'萝岗区'),(440183,'增城'),(440184,'从化'),(440203,'武江区'),(440204,'浈江区'),(440205,'曲江区'),(440222,'始兴县'),(440224,'仁化县'),(440229,'翁源县'),(440232,'乳源'),(440233,'新丰县'),(440281,'乐昌'),(440282,'南雄'),(440283,'北江'),(440303,'罗湖区'),(440304,'福田区'),(440305,'南山区'),(440306,'宝安区'),(440307,'龙岗区'),(440308,'盐田区'),(440309,'坪山新区'),(440310,'光明新区'),(440311,'大鹏新区'),(440312,'龙华新区'),(440402,'香洲区'),(440403,'斗门区'),(440404,'金湾区'),(440507,'龙湖区'),(440511,'金平区'),(440512,'濠江区'),(440513,'潮阳区'),(440514,'潮南区'),(440515,'澄海区'),(440523,'南澳县'),(440604,'禅城区'),(440605,'南海区'),(440606,'顺德区'),(440607,'三水区'),(440608,'高明区'),(440703,'蓬江区'),(440704,'江海区'),(440705,'新会区'),(440781,'台山'),(440783,'开平'),(440784,'鹤山'),(440785,'恩平'),(440786,'南新'),(440787,'北新'),(440802,'赤坎区'),(440803,'霞山区'),(440804,'坡头区'),(440811,'麻章区'),(440823,'遂溪县'),(440825,'徐闻县'),(440881,'廉江'),(440882,'雷州'),(440883,'吴川'),(440884,'开发区'),(440902,'茂南区'),(440903,'茂港区'),(440923,'电白县'),(440981,'高州'),(440982,'化州'),(440983,'信宜'),(441202,'端州区'),(441203,'鼎湖区'),(441223,'广宁县'),(441224,'怀集县'),(441225,'封开县'),(441226,'德庆县'),(441283,'高要'),(441284,'四会'),(441302,'惠城区'),(441303,'惠阳区'),(441322,'博罗县'),(441323,'惠东县'),(441324,'龙门县'),(441325,'大亚湾开发区'),(441402,'梅江区'),(441421,'梅县'),(441422,'大埔县'),(441423,'丰顺县'),(441424,'五华县'),(441426,'平远县'),(441427,'蕉岭县'),(441481,'兴宁'),(441502,'城区'),(441521,'海丰县'),(441523,'陆河县'),(441581,'陆丰'),(441602,'源城区'),(441621,'紫金县'),(441622,'龙川县'),(441623,'连平县'),(441624,'和平县'),(441625,'东源县'),(441702,'江城区'),(441721,'阳西县'),(441723,'阳东县'),(441781,'阳春'),(441802,'清城区'),(441821,'佛冈县'),(441823,'阳山县'),(441825,'连山'),(441826,'连南'),(441827,'清新县'),(441881,'英德'),(441882,'连州'),(441901,'莞城区'),(441902,'南城'),(441903,'东城'),(441904,'万江'),(441905,'厚街'),(441906,'虎门'),(441907,'长安'),(441908,'常平'),(441909,'寮步'),(441910,'大朗'),(441911,'东坑'),(441912,'黄江'),(441913,'樟木头'),(441914,'塘厦'),(441915,'凤岗'),(441916,'清溪'),(441917,'石碣'),(441918,'石龙'),(441919,'石排'),(441920,'茶山'),(441921,'横沥'),(441922,'企石'),(441923,'桥头'),(441924,'谢岗'),(441925,'大岭山'),(441926,'松山湖'),(441927,'沙田'),(441928,'高埗'),(441929,'中堂'),(441930,'麻涌'),(441931,'望牛墩'),(441932,'洪梅'),(441933,'道滘'),(442001,'东区'),(442002,'南区'),(442003,'西区'),(442004,'石岐区'),(442005,'火炬开发区'),(442006,'港口镇'),(442007,'三角镇'),(442008,'民众镇'),(442009,'南朗镇'),(442010,'三乡镇'),(442011,'坦洲镇'),(442012,'神湾镇'),(442013,'板芙镇'),(442014,'大涌镇'),(442015,'沙溪镇'),(442016,'横栏镇'),(442017,'古镇镇'),(442018,'小榄镇'),(442019,'东凤镇'),(442020,'南头镇'),(442021,'阜沙镇'),(442022,'黄圃镇'),(442023,'东升镇'),(442024,'五桂山'),(445102,'湘桥区'),(445121,'潮安县'),(445122,'饶平县'),(445202,'榕城区'),(445221,'揭东县'),(445222,'揭西县'),(445224,'惠来县'),(445281,'普宁'),(445302,'云城区'),(445321,'新兴县'),(445322,'郁南县'),(445323,'云安县'),(445381,'罗定'),(450102,'兴宁区'),(450103,'青秀区'),(450105,'江南区'),(450107,'西乡塘区'),(450108,'良庆区'),(450109,'邕宁区'),(450122,'武鸣县'),(450123,'隆安县'),(450124,'马山县'),(450125,'上林县'),(450126,'宾阳县'),(450127,'横县'),(450128,'南宁周边'),(450202,'城中区'),(450203,'鱼峰区'),(450204,'柳南区'),(450205,'柳北区'),(450221,'柳江县'),(450222,'柳城县'),(450223,'鹿寨县'),(450224,'融安县'),(450225,'融水'),(450226,'三江'),(450302,'秀峰区'),(450303,'叠彩区'),(450304,'象山区'),(450305,'七星区'),(450311,'雁山区'),(450321,'阳朔县'),(450322,'临桂县'),(450323,'灵川县'),(450324,'全州县'),(450325,'兴安县'),(450326,'永福县'),(450327,'灌阳县'),(450328,'龙胜'),(450329,'资源县'),(450330,'平乐县'),(450331,'荔蒲县'),(450332,'恭城'),(450333,'八里街'),(450403,'万秀区'),(450404,'蝶山区'),(450405,'长洲区'),(450421,'苍梧县'),(450422,'藤县'),(450423,'蒙山县'),(450481,'岑溪'),(450502,'海城区'),(450503,'银海区'),(450512,'铁山港区'),(450521,'合浦县'),(450602,'港口区'),(450603,'防城区'),(450621,'上思县'),(450681,'东兴'),(450702,'钦南区'),(450703,'钦北区'),(450721,'灵山县'),(450722,'浦北县'),(450802,'港北区'),(450803,'港南区'),(450804,'覃塘区'),(450821,'平南县'),(450881,'桂平'),(450902,'玉州区'),(450921,'容县'),(450922,'陆川县'),(450923,'博白县'),(450924,'兴业县'),(450981,'北流'),(451002,'右江区'),(451021,'田阳县'),(451022,'田东县'),(451023,'平果县'),(451024,'德保县'),(451025,'靖西县'),(451026,'那坡县'),(451027,'凌云县'),(451028,'乐业县'),(451029,'田林县'),(451030,'西林县'),(451031,'隆林'),(451102,'八步区'),(451121,'昭平县'),(451122,'钟山县'),(451123,'富川'),(451202,'金城江区'),(451221,'南丹县'),(451222,'天峨县'),(451223,'凤山县'),(451224,'东兰县'),(451225,'罗城'),(451226,'环江'),(451227,'巴马'),(451228,'都安'),(451229,'大化'),(451281,'宜州'),(451302,'兴宾区'),(451321,'忻城县'),(451322,'象州县'),(451323,'武宣县'),(451324,'金秀'),(451381,'合山'),(451402,'江洲区'),(451421,'扶绥县'),(451422,'宁明县'),(451423,'龙州县'),(451424,'大新县'),(451425,'天等县'),(451481,'凭祥'),(460105,'秀英区'),(460106,'龙华区'),(460107,'琼山区'),(460108,'美兰区'),(460109,'海口周边'),(460201,'河西'),(460202,'天涯区'),(460203,'海棠区'),(460204,'吉阳区'),(460205,'凤凰镇'),(460206,'崖州区'),(460207,'三亚周边'),(469001,'五指山'),(469002,'琼海'),(469003,'儋州'),(469005,'文昌'),(469006,'万宁'),(469007,'东方'),(469021,'定安县'),(469022,'屯昌县'),(469023,'澄迈县'),(469024,'临高县'),(469025,'白沙'),(469026,'昌江'),(469027,'乐东'),(469028,'陵水'),(469029,'保亭'),(469030,'琼中'),(469031,'西沙群岛'),(469032,'南沙群岛'),(469033,'中沙群岛'),(500101,'万州区'),(500102,'涪陵区'),(500103,'渝中区'),(500104,'大渡口区'),(500105,'江北区'),(500106,'沙坪坝区'),(500107,'九龙坡区'),(500108,'南岸区'),(500109,'北碚区'),(500110,'万盛区'),(500112,'渝北区'),(500113,'巴南区'),(500114,'黔江区'),(500115,'长寿区'),(500116,'江津区'),(500117,'合川区'),(500118,'永川区'),(500119,'南川区'),(500122,'綦江县'),(500123,'潼南县'),(500124,'铜梁县'),(500125,'大足县'),(500126,'荣昌县'),(500127,'璧山县'),(500128,'梁平县'),(500129,'城口县'),(500130,'丰都县'),(500131,'垫江县'),(500132,'武隆县'),(500133,'忠县'),(500134,'开县'),(500135,'云阳县'),(500136,'奉节县'),(500137,'巫山县'),(500138,'巫溪县'),(500142,'酉阳'),(510104,'锦江区'),(510105,'青羊区'),(510106,'金牛区'),(510107,'武侯区'),(510108,'成华区'),(510112,'龙泉驿区'),(510113,'青白江区'),(510114,'新都区'),(510115,'温江区'),(510116,'高新区'),(510121,'金堂县'),(510122,'双流县'),(510124,'郫县'),(510129,'大邑县'),(510131,'蒲江县'),(510132,'新津县'),(510181,'都江堰'),(510182,'彭州'),(510183,'邛崃'),(510184,'崇州'),(510185,'高新西区'),(510302,'自流井区'),(510303,'贡井区'),(510304,'大安区'),(510311,'沿滩区'),(510321,'荣县'),(510322,'富顺县'),(510402,'东区'),(510403,'西区'),(510411,'仁和区'),(510421,'米易县'),(510422,'盐边县'),(510502,'江阳区'),(510503,'纳溪区'),(510504,'龙马潭区'),(510521,'泸县'),(510522,'合江县'),(510524,'叙永县'),(510525,'古蔺县'),(510603,'旌阳区'),(510623,'中江县'),(510626,'罗江县'),(510681,'广汉'),(510682,'什邡'),(510683,'绵竹'),(510703,'涪城区'),(510704,'游仙区'),(510722,'三台县'),(510723,'盐亭县'),(510724,'安县'),(510725,'梓潼县'),(510726,'北川'),(510727,'平武县'),(510781,'江油'),(510782,'经开区'),(510783,'科创园区'),(510784,'青义镇'),(510802,'市中区'),(510811,'元坝区'),(510812,'朝天区'),(510821,'旺苍县'),(510822,'青川县'),(510823,'剑阁县'),(510824,'苍溪县'),(510903,'船山区'),(510904,'安居区'),(510921,'蓬溪县'),(510922,'射洪县'),(510923,'大英县'),(511002,'市中区'),(511011,'东兴区'),(511024,'威远县'),(511025,'资中县'),(511028,'隆昌县'),(511102,'市中区'),(511111,'沙湾区'),(511112,'五通桥区'),(511113,'金口河区'),(511123,'犍为县'),(511124,'井研县'),(511126,'夹江县'),(511129,'沐川县'),(511132,'峨边'),(511133,'马边'),(511181,'峨眉山'),(511302,'顺庆区'),(511303,'高坪区'),(511304,'嘉陵区'),(511321,'南部县'),(511322,'营山县'),(511323,'蓬安县'),(511324,'仪陇县'),(511325,'西充县'),(511381,'阆中'),(511402,'东坡区'),(511421,'仁寿县'),(511422,'彭山县'),(511423,'洪雅县'),(511424,'丹棱县'),(511425,'青神县'),(511502,'翠屏区'),(511521,'宜宾县'),(511522,'南溪县'),(511523,'江安县'),(511524,'长宁县'),(511525,'高县'),(511526,'珙县'),(511527,'筠连县'),(511528,'兴文县'),(511529,'屏山县'),(511602,'广安区'),(511621,'岳池县'),(511622,'武胜县'),(511623,'邻水县'),(511681,'华蓥'),(511702,'通川区'),(511721,'达县'),(511722,'宣汉县'),(511723,'开江县'),(511724,'大竹县'),(511725,'渠县'),(511781,'万源'),(511802,'雨城区'),(511821,'名山县'),(511822,'荥经县'),(511823,'汉源县'),(511824,'石棉县'),(511825,'天全县'),(511826,'芦山县'),(511827,'宝兴县'),(511902,'巴州区'),(511921,'通江县'),(511922,'南江县'),(511923,'平昌县'),(512002,'雁江区'),(512021,'安岳县'),(512022,'乐至县'),(512081,'简阳'),(513221,'汶川县'),(513222,'理县'),(513223,'茂县'),(513224,'松潘县'),(513225,'九寨沟县'),(513226,'金川县'),(513227,'小金县'),(513228,'黑水县'),(513229,'马尔康县'),(513230,'壤塘县'),(513231,'阿坝县'),(513232,'若尔盖县'),(513233,'红原县'),(513321,'康定县'),(513322,'泸定县'),(513323,'丹巴县'),(513324,'九龙县'),(513325,'雅江县'),(513326,'道孚县'),(513327,'炉霍县'),(513328,'甘孜县'),(513329,'新龙县'),(513330,'德格县'),(513331,'白玉县'),(513332,'石渠县'),(513333,'色达县'),(513334,'理塘县'),(513335,'巴塘县'),(513336,'乡城县'),(513337,'稻城县'),(513338,'得荣县'),(513401,'西昌'),(513422,'木里'),(513423,'盐源县'),(513424,'德昌县'),(513425,'会理县'),(513426,'会东县'),(513427,'宁南县'),(513428,'普格县'),(513429,'布拖县'),(513430,'金阳县'),(513431,'昭觉县'),(513432,'喜德县'),(513433,'冕宁县'),(513434,'越西县'),(513435,'甘洛县'),(513436,'美姑县'),(513437,'雷波县'),(520102,'南明区'),(520103,'云岩区'),(520111,'花溪区'),(520112,'乌当区'),(520113,'白云区'),(520114,'小河区'),(520121,'开阳县'),(520122,'息烽县'),(520123,'修文县'),(520124,'金阳'),(520181,'清镇'),(520182,'贵阳周边'),(520201,'钟山区'),(520203,'六枝特区'),(520221,'水城县'),(520222,'盘县'),(520302,'红花岗区'),(520303,'汇川区'),(520321,'遵义县'),(520322,'桐梓县'),(520323,'绥阳县'),(520324,'正安县'),(520325,'道真'),(520326,'务川'),(520327,'凤冈县'),(520328,'湄潭县'),(520329,'余庆县'),(520330,'习水县'),(520381,'赤水'),(520382,'仁怀'),(520402,'西秀区'),(520421,'平坝县'),(520422,'普定县'),(520423,'镇宁'),(520424,'关岭'),(520425,'紫云'),(522201,'铜仁'),(522222,'江口县'),(522223,'玉屏'),(522224,'石阡县'),(522225,'思南县'),(522226,'印江'),(522227,'德江县'),(522228,'沿河'),(522229,'松桃'),(522230,'万山特区'),(522301,'兴义'),(522322,'兴仁县'),(522323,'普安县'),(522324,'晴隆县'),(522325,'贞丰县'),(522326,'望谟县'),(522327,'册亨县'),(522328,'安龙县'),(522401,'毕节'),(522422,'大方县'),(522423,'黔西县'),(522424,'金沙县'),(522425,'织金县'),(522426,'纳雍县'),(522427,'威宁'),(522428,'赫章县'),(522601,'凯里'),(522622,'黄平县'),(522623,'施秉县'),(522624,'三穗县'),(522625,'镇远县'),(522626,'岑巩县'),(522627,'天柱县'),(522628,'锦屏县'),(522629,'剑河县'),(522630,'台江县'),(522631,'黎平县'),(522632,'榕江县'),(522633,'从江县'),(522634,'雷山县'),(522635,'麻江县'),(522636,'丹寨县'),(522701,'都匀'),(522702,'福泉'),(522722,'荔波县'),(522723,'贵定县'),(522725,'瓮安县'),(522726,'独山县'),(522727,'平塘县'),(522728,'罗甸县'),(522729,'长顺县'),(522730,'龙里县'),(522731,'惠水县'),(522732,'三都'),(530102,'五华区'),(530103,'盘龙区'),(530111,'官渡区'),(530112,'西山区'),(530113,'东川区'),(530121,'呈贡县'),(530122,'晋宁县'),(530124,'富民县'),(530125,'宜良县'),(530126,'石林'),(530127,'嵩明县'),(530128,'禄劝'),(530129,'寻甸'),(530181,'安宁'),(530182,'昆明周边'),(530302,'麒麟区'),(530321,'马龙县'),(530322,'陆良县'),(530323,'师宗县'),(530324,'罗平县'),(530325,'富源县'),(530326,'会泽县'),(530328,'沾益县'),(530381,'宣威'),(530402,'红塔区'),(530421,'江川县'),(530422,'澄江县'),(530423,'通海县'),(530424,'华宁县'),(530425,'易门县'),(530426,'峨山'),(530427,'新平'),(530428,'元江'),(530502,'隆阳区'),(530521,'施甸县'),(530522,'腾冲县'),(530523,'龙陵县'),(530524,'昌宁县'),(530602,'昭阳区'),(530621,'鲁甸县'),(530622,'巧家县'),(530623,'盐津县'),(530624,'大关县'),(530625,'永善县'),(530626,'绥江县'),(530627,'镇雄县'),(530628,'彝良县'),(530629,'威信县'),(530630,'水富县'),(530702,'古城区'),(530721,'玉龙'),(530722,'永胜县'),(530723,'华坪县'),(530724,'宁蒗'),(530802,'思茅区'),(530821,'宁洱'),(530822,'墨江'),(530823,'景东'),(530824,'景谷'),(530825,'镇沅'),(530826,'江城'),(530827,'孟连'),(530828,'澜沧'),(530829,'西盟'),(530902,'临翔区'),(530921,'凤庆县'),(530922,'云县'),(530923,'永德县'),(530924,'镇康县'),(530925,'双江'),(530926,'耿马'),(530927,'沧源'),(532301,'楚雄'),(532322,'双柏县'),(532323,'牟定县'),(532324,'南华县'),(532325,'姚安县'),(532326,'大姚县'),(532327,'永仁县'),(532328,'元谋县'),(532329,'武定县'),(532331,'禄丰县'),(532501,'个旧'),(532502,'开远'),(532522,'蒙自县'),(532523,'屏边'),(532524,'建水县'),(532525,'石屏县'),(532526,'弥勒县'),(532527,'泸西县'),(532528,'元阳县'),(532529,'红河县'),(532530,'金平'),(532531,'绿春县'),(532532,'河口'),(532621,'文山县'),(532622,'砚山县'),(532623,'西畴县'),(532624,'麻栗坡县'),(532625,'马关县'),(532626,'丘北县'),(532627,'广南县'),(532628,'富宁县'),(532801,'景洪'),(532822,'勐海县'),(532823,'勐腊县'),(532901,'大理'),(532922,'漾濞'),(532923,'祥云县'),(532924,'宾川县'),(532925,'弥渡县'),(532926,'南涧'),(532927,'巍山'),(532928,'永平县'),(532929,'云龙县'),(532930,'洱源县'),(532931,'剑川县'),(532932,'鹤庆县'),(533102,'瑞丽'),(533103,'潞西'),(533122,'梁河县'),(533123,'盈江县'),(533124,'陇川县'),(533321,'泸水县'),(533323,'福贡县'),(533324,'贡山'),(533325,'兰坪'),(533421,'香格里拉县'),(533422,'德钦县'),(533423,'维西傈'),(540102,'城关区'),(540121,'林周县'),(540122,'当雄县'),(540123,'尼木县'),(540124,'曲水县'),(540125,'堆龙德庆县'),(540126,'达孜县'),(540127,'墨竹工卡县'),(542121,'昌都县'),(542122,'江达县'),(542123,'贡觉县'),(542124,'类乌齐县'),(542125,'丁青县'),(542126,'察雅县'),(542127,'八宿县'),(542128,'左贡县'),(542129,'芒康县'),(542132,'洛隆县'),(542133,'边坝县'),(542221,'乃东县'),(542222,'扎囊县'),(542223,'贡嘎县'),(542224,'桑日县'),(542225,'琼结县'),(542226,'曲松县'),(542227,'措美县'),(542228,'洛扎县'),(542229,'加查县'),(542231,'隆子县'),(542232,'错那县'),(542233,'浪卡子县'),(542301,'日喀则'),(542322,'南木林县'),(542323,'江孜县'),(542324,'定日县'),(542325,'萨迦县'),(542326,'拉孜县'),(542327,'昂仁县'),(542328,'谢通门县'),(542329,'白朗县'),(542330,'仁布县'),(542331,'康马县'),(542332,'定结县'),(542333,'仲巴县'),(542334,'亚东县'),(542335,'吉隆县'),(542336,'聂拉木县'),(542337,'萨嘎县'),(542338,'岗巴县'),(542421,'那曲县'),(542422,'嘉黎县'),(542423,'比如县'),(542424,'聂荣县'),(542425,'安多县'),(542426,'申扎县'),(542427,'索县'),(542428,'班戈县'),(542429,'巴青县'),(542430,'尼玛县'),(542521,'普兰县'),(542522,'札达县'),(542523,'噶尔县'),(542524,'日土县'),(542525,'革吉县'),(542526,'改则县'),(542527,'措勤县'),(542621,'林芝县'),(542622,'工布江达县'),(542623,'米林县'),(542624,'墨脱县'),(542625,'波密县'),(542626,'察隅县'),(542627,'朗县'),(610102,'新城区'),(610103,'碑林区'),(610104,'莲湖区'),(610111,'灞桥区'),(610112,'未央区'),(610113,'雁塔区'),(610114,'阎良区'),(610115,'临潼区'),(610116,'长安区'),(610122,'蓝田县'),(610124,'周至县'),(610125,'户县'),(610126,'高陵县'),(610127,'高新区'),(610128,'其他'),(610202,'王益区'),(610203,'印台区'),(610204,'耀州区'),(610222,'宜君县'),(610302,'渭滨区'),(610303,'金台区'),(610304,'陈仓区'),(610322,'凤翔县'),(610323,'岐山县'),(610324,'扶风县'),(610326,'眉县'),(610327,'陇县'),(610328,'千阳县'),(610329,'麟游县'),(610330,'凤县'),(610331,'太白县'),(610332,'高新技术产业开发区'),(610333,'蟠龙新区'),(610334,'陆港新区'),(610335,'蔡家坡经济技术开发区'),(610402,'秦都区'),(610403,'杨凌区'),(610404,'渭城区'),(610422,'三原县'),(610423,'泾阳县'),(610424,'乾县'),(610425,'礼泉县'),(610426,'永寿县'),(610427,'彬县'),(610428,'长武县'),(610429,'旬邑县'),(610430,'淳化县'),(610431,'武功县'),(610481,'兴平'),(610502,'临渭区'),(610521,'华县'),(610522,'潼关县'),(610523,'大荔县'),(610524,'合阳县'),(610525,'澄城县'),(610526,'蒲城县'),(610527,'白水县'),(610528,'富平县'),(610581,'韩城'),(610582,'华阴'),(610602,'宝塔区'),(610621,'延长县'),(610622,'延川县'),(610623,'子长县'),(610624,'安塞县'),(610625,'志丹县'),(610626,'吴起县'),(610627,'甘泉县'),(610628,'富县'),(610629,'洛川县'),(610630,'宜川县'),(610631,'黄龙县'),(610632,'黄陵县'),(610702,'汉台区'),(610721,'南郑县'),(610722,'城固县'),(610723,'洋县'),(610724,'西乡县'),(610725,'勉县'),(610726,'宁强县'),(610727,'略阳县'),(610728,'镇巴县'),(610729,'留坝县'),(610730,'佛坪县'),(610802,'榆阳区'),(610821,'神木县'),(610822,'府谷县'),(610823,'横山县'),(610824,'靖边县'),(610825,'定边县'),(610826,'绥德县'),(610827,'米脂县'),(610828,'佳县'),(610829,'吴堡县'),(610830,'清涧县'),(610831,'子洲县'),(610902,'汉滨区'),(610921,'汉阴县'),(610922,'石泉县'),(610923,'宁陕县'),(610924,'紫阳县'),(610925,'岚皋县'),(610926,'平利县'),(610927,'镇坪县'),(610928,'旬阳县'),(610929,'白河县'),(611002,'商州区'),(611021,'洛南县'),(611022,'丹凤县'),(611023,'商南县'),(611024,'山阳县'),(611025,'镇安县'),(611026,'柞水县'),(620102,'城关区'),(620103,'七里河区'),(620104,'西固区'),(620105,'安宁区'),(620111,'红古区'),(620121,'永登县'),(620122,'皋兰县'),(620123,'榆中县'),(620302,'金川区'),(620321,'永昌县'),(620402,'白银区'),(620403,'平川区'),(620421,'靖远县'),(620422,'会宁县'),(620423,'景泰县'),(620502,'秦州区'),(620503,'麦积区'),(620521,'清水县'),(620522,'秦安县'),(620523,'甘谷县'),(620524,'武山县'),(620525,'张家川县'),(620602,'凉州区'),(620621,'民勤县'),(620622,'古浪县'),(620623,'天祝'),(620702,'甘州区'),(620721,'肃南'),(620722,'民乐县'),(620723,'临泽县'),(620724,'高台县'),(620725,'山丹县'),(620802,'崆峒区'),(620821,'泾川县'),(620822,'灵台县'),(620823,'崇信县'),(620824,'华亭县'),(620825,'庄浪县'),(620826,'静宁县'),(620902,'肃州区'),(620921,'金塔县'),(620922,'瓜州县'),(620923,'肃北'),(620924,'阿克塞'),(620981,'玉门'),(620982,'敦煌'),(621002,'西峰区'),(621021,'庆城县'),(621022,'环县'),(621023,'华池县'),(621024,'合水县'),(621025,'正宁县'),(621026,'宁县'),(621027,'镇原县'),(621102,'安定区'),(621121,'通渭县'),(621122,'陇西县'),(621123,'渭源县'),(621124,'临洮县'),(621125,'漳县'),(621126,'岷县'),(621202,'武都区'),(621221,'成县'),(621222,'文县'),(621223,'宕昌县'),(621224,'康县'),(621225,'西和县'),(621226,'礼县'),(621227,'徽县'),(621228,'两当县'),(622901,'临夏'),(622921,'临夏县'),(622922,'康乐县'),(622923,'永靖县'),(622924,'广河县'),(622925,'和政县'),(622926,'东乡族自治县'),(622927,'积石山保安'),(623001,'合作'),(623021,'临潭县'),(623022,'卓尼县'),(623023,'舟曲县'),(623024,'迭部县'),(623025,'玛曲县'),(623026,'碌曲县'),(623027,'夏河县'),(630102,'城东区'),(630103,'城中区'),(630104,'城西区'),(630105,'城北区'),(630121,'大通'),(630122,'湟中县'),(630123,'湟源县'),(632121,'平安县'),(632122,'民和'),(632123,'乐都县'),(632126,'互助'),(632127,'化隆县'),(632128,'循化'),(632221,'门源县'),(632222,'祁连县'),(632223,'海晏县'),(632224,'刚察县'),(632321,'同仁县'),(632322,'尖扎县'),(632323,'泽库县'),(632324,'河南'),(632521,'共和县'),(632522,'同德县'),(632523,'贵德县'),(632524,'兴海县'),(632525,'贵南县'),(632621,'玛沁县'),(632622,'班玛县'),(632623,'甘德县'),(632624,'达日县'),(632625,'久治县'),(632626,'玛多县'),(632721,'玉树县'),(632722,'杂多县'),(632723,'称多县'),(632724,'治多县'),(632725,'囊谦县'),(632726,'曲麻莱县'),(632801,'格尔木'),(632802,'德令哈'),(632821,'乌兰县'),(632822,'都兰县'),(632823,'天峻县'),(640104,'兴庆区'),(640105,'西夏区'),(640106,'金凤区'),(640121,'永宁县'),(640122,'贺兰县'),(640181,'灵武'),(640202,'大武口区'),(640205,'惠农区'),(640221,'平罗县'),(640302,'利通区'),(640323,'盐池县'),(640324,'同心县'),(640381,'青铜峡'),(640402,'原州区'),(640422,'西吉县'),(640423,'隆德县'),(640424,'泾源县'),(640425,'彭阳县'),(640502,'沙坡头区'),(640521,'中宁县'),(640522,'海原县'),(650102,'天山区'),(650103,'沙依巴克区'),(650104,'新市区'),(650105,'水磨沟区'),(650106,'头屯河区'),(650107,'达坂城区'),(650109,'米东区'),(650121,'乌鲁木齐县'),(650202,'独山子区'),(650203,'克拉玛依区'),(650204,'白碱滩区'),(650205,'乌尔禾区'),(652101,'吐鲁番'),(652122,'鄯善县'),(652123,'托克逊县'),(652201,'哈密'),(652222,'巴里坤'),(652223,'伊吾县'),(652301,'昌吉'),(652302,'阜康'),(652323,'呼图壁县'),(652324,'玛纳斯县'),(652325,'奇台县'),(652327,'吉木萨尔县'),(652328,'木垒哈'),(652701,'博乐'),(652722,'精河县'),(652723,'温泉县'),(652801,'库尔勒'),(652822,'轮台县'),(652823,'尉犁县'),(652824,'若羌县'),(652825,'且末县'),(652826,'焉耆县'),(652827,'和静县'),(652828,'和硕县'),(652829,'博湖县'),(652901,'阿克苏'),(652922,'温宿县'),(652923,'库车县'),(652924,'沙雅县'),(652925,'新和县'),(652926,'拜城县'),(652927,'乌什县'),(652928,'阿瓦提县'),(652929,'柯坪县'),(653001,'阿图什'),(653022,'阿克陶县'),(653023,'阿合奇县'),(653024,'乌恰县'),(653101,'喀什'),(653121,'疏附县'),(653122,'疏勒县'),(653123,'英吉沙县'),(653124,'泽普县'),(653125,'莎车县'),(653126,'叶城县'),(653127,'麦盖提县'),(653128,'岳普湖县'),(653129,'伽师县'),(653130,'巴楚县'),(653131,'塔什库尔干'),(653201,'和田'),(653221,'和田县'),(653222,'墨玉县'),(653223,'皮山县'),(653224,'洛浦县'),(653225,'策勒县'),(653226,'于田县'),(653227,'民丰县'),(654002,'伊宁'),(654003,'奎屯'),(654021,'伊宁县'),(654022,'察布查尔锡伯'),(654023,'霍城县'),(654024,'巩留县'),(654025,'新源县'),(654026,'昭苏县'),(654027,'特克斯县'),(654028,'尼勒克县'),(654201,'塔城'),(654202,'乌苏'),(654221,'额敏县'),(654223,'沙湾县'),(654224,'托里县'),(654225,'裕民县'),(654226,'和布克赛尔'),(654301,'阿勒泰'),(654321,'布尔津县'),(654322,'富蕴县'),(654323,'福海县'),(654324,'哈巴河县'),(654325,'青河县'),(654326,'吉木乃县'),(659001,'石河子'),(659002,'阿拉尔'),(659003,'图木舒克'),(659004,'五家渠'),(810101,'中西区'),(810102,'湾仔区'),(810103,'东区'),(810104,'南区'),(810201,'九龙城区'),(810202,'黄大仙区'),(810203,'观塘区'),(810204,'深水埗区'),(810205,'油尖旺区'),(810301,'沙田区'),(810302,'屯门区'),(810303,'大埔区'),(810304,'荃湾区'),(810305,'葵青区'),(810306,'北区'),(810307,'元朗区'),(810308,'西贡区'),(11010101,'东直门'),(11010102,'和平里'),(11010103,'雍和宫'),(11010104,'安定门'),(11010105,'交道口'),(11010106,'地坛'),(11010107,'金宝街'),(11010108,'东四十条'),(11010109,'东四'),(11010110,'朝阳门'),(11010111,'建国门'),(11010112,'东单'),(11010113,'王府井'),(11010114,'灯市口'),(11010115,'东外大街'),(11010116,'其他'),(11010117,'雅宝路'),(11010118,'东中街'),(11010201,'西直门'),(11010202,'新街口'),(11010203,'积水潭'),(11010204,'小西天'),(11010205,'德胜门'),(11010206,'钓鱼台'),(11010207,'后海'),(11010208,'什刹海'),(11010209,'西四'),(11010210,'西单'),(11010211,'复兴门'),(11010212,'金融街'),(11010213,'阜成门'),(11010214,'北营房'),(11010215,'车公庄'),(11010216,'南锣鼓巷'),(11010217,'白云路'),(11010218,'月坛'),(11010219,'其他'),(11010220,'三里河'),(11010221,'木樨地'),(11010222,'西便门'),(11010301,'幸福大街'),(11010302,'崇文门'),(11010303,'东花市'),(11010304,'广渠门'),(11010305,'光明楼'),(11010309,'天坛'),(11010310,'其他'),(11010311,'沙子口'),(11010401,'广安门'),(11010402,'西客站'),(11010403,'马连道'),(11010404,'天宁寺'),(11010405,'白纸坊'),(11010406,'南菜园'),(11010407,'右安门'),(11010408,'枣林前街'),(11010409,'牛街'),(11010410,'长椿街'),(11010411,'天伦北里'),(11010412,'双槐里'),(11010413,'陶然亭'),(11010414,'虎坊桥'),(11010415,'其他'),(11010501,'北苑'),(11010502,'雅宝路'),(11010503,'望京'),(11010504,'京广'),(11010505,'酒仙桥'),(11010506,'化工大学'),(11010507,'北沙滩'),(11010508,'中日医院'),(11010509,'亚运村'),(11010510,'麦子店'),(11010511,'八王坟'),(11010512,'光熙门'),(11010513,'延静里'),(11010514,'静安庄'),(11010515,'安贞'),(11010516,'大悦城'),(11010517,'慈云寺'),(11010518,'芍药居'),(11010519,'太阳宫'),(11010520,'西坝河'),(11010521,'官庄'),(11010522,'国展'),(11010523,'左家庄'),(11010524,'三元桥'),(11010525,'燕莎'),(11010526,'朝阳公园'),(11010529,'团结湖'),(11010530,'三里屯'),(11010533,'建外大街'),(11010534,'东大桥'),(11010535,'CBD'),(11010536,'呼家楼'),(11010537,'国贸'),(11010538,'双井'),(11010539,'劲松'),(11010540,'潘家园'),(11010541,'华威桥'),(11010543,'大望路'),(11010544,'百子湾'),(11010545,'四惠'),(11010546,'红庙'),(11010547,'八里庄'),(11010548,'石佛营'),(11010549,'十里堡'),(11010551,'高碑店'),(11010553,'姚家园'),(11010555,'定福庄'),(11010556,'双桥'),(11010557,'管庄'),(11010559,'豆各庄'),(11010560,'垡头'),(11010561,'十八里店'),(11010562,'其他'),(11010563,'十里河'),(11010564,'永安里'),(11010601,'六里桥'),(11010602,'太平桥'),(11010603,'开阳里'),(11010604,'丽泽桥'),(11010605,'菜户营'),(11010606,'玉泉营'),(11010607,'草桥'),(11010608,'万柳桥'),(11010609,'马家堡'),(11010610,'角门'),(11010611,'洋桥'),(11010612,'西罗园'),(11010613,'木樨园'),(11010614,'赵公口'),(11010615,'刘家窑'),(11010616,'蒲黄榆'),(11010617,'方庄'),(11010618,'左安门'),(11010619,'成寿寺'),(11010620,'宋家庄'),(11010621,'大红门'),(11010622,'南苑'),(11010623,'西局'),(11010624,'东高地'),(11010625,'丰益桥'),(11010626,'花乡'),(11010627,'世界公园'),(11010628,'科技园区'),(11010629,'北大地'),(11010630,'夏家胡同'),(11010634,'岳各庄'),(11010635,'青塔'),(11010636,'五里店'),(11010637,'卢沟桥'),(11010638,'其他'),(11010639,'云岗'),(11010701,'晋元庄'),(11010702,'玉泉路'),(11010703,'老山'),(11010705,'鲁谷'),(11010707,'八角'),(11010708,'古城'),(11010709,'杨庄'),(11010710,'苹果园'),(11010711,'金顶街'),(11010712,'模式口'),(11010713,'其他'),(11010801,'清河'),(11010802,'小营'),(11010803,'西三旗'),(11010804,'西二旗'),(11010805,'上地'),(11010806,'西北旺'),(11010807,'马连洼'),(11010808,'西苑'),(11010809,'北京大学'),(11010810,'苏州街'),(11010811,'中关村'),(11010812,'北大清华'),(11010813,'五道口'),(11010814,'学院路'),(11010815,'二里庄'),(11010816,'牡丹园'),(11010817,'北太平庄'),(11010818,'马甸'),(11010819,'大钟寺'),(11010820,'知春路'),(11010821,'双榆树'),(11010822,'人民大学'),(11010823,'万柳'),(11010824,'世纪城'),(11010825,'魏公村'),(11010826,'皂君庙'),(11010827,'交通大学'),(11010828,'圆明园'),(11010829,'海淀黄庄'),(11010830,'紫竹桥'),(11010831,'万寿寺'),(11010832,'车道沟'),(11010833,'北洼路'),(11010834,'蓟门桥'),(11010835,'航天桥'),(11010836,'三义庙'),(11010837,'甘家口'),(11010838,'军博'),(11010839,'公主坟'),(11010840,'万寿路'),(11010841,'五棵松'),(11010842,'永定路'),(11010843,'定慧寺'),(11010844,'百万庄'),(11010845,'四季青'),(11010846,'香山'),(11010847,'农大'),(11010848,'小南庄'),(11010850,'其他'),(11010901,'大峪'),(11010902,'其他'),(11010903,'东辛房'),(11011001,'河北'),(11011002,'涿州'),(11011003,'香河'),(11011004,'三河'),(11011101,'长阳'),(11011102,'良乡'),(11011103,'行宫园'),(11011104,'窦店'),(11011105,'燕山'),(11011106,'其他'),(11011201,'北关'),(11011202,'新华大街'),(11011203,'西上园'),(11011204,'果园'),(11011205,'九棵树'),(11011206,'梨园'),(11011207,'梨园城铁'),(11011208,'临河里'),(11011209,'土桥'),(11011210,'玉桥'),(11011211,'乔庄'),(11011212,'武夷花园'),(11011213,'潞城'),(11011214,'马驹桥'),(11011215,'物资学院'),(11011216,'新华联'),(11011217,'张家湾'),(11011218,'西门'),(11011301,'后沙峪'),(11011302,'胜利'),(11011303,'樱花园'),(11011304,'石园'),(11011305,'建新北门'),(11011306,'石门苑'),(11011307,'机场'),(11011308,'天竺'),(11011309,'新国展'),(11011310,'马坡'),(11011311,'其他'),(11011401,'龙泽'),(11011402,'回龙观'),(11011403,'霍营'),(11011404,'立水桥'),(11011405,'天通苑'),(11011406,'北七家'),(11011407,'沙河镇'),(11011408,'昌平县城'),(11011409,'其他'),(11011415,'小汤山'),(11011501,'黄村'),(11011502,'西红门'),(11011503,'旧宫'),(11011504,'亦庄'),(11011505,'兴华大街'),(11011506,'兴华园'),(11011507,'上清园'),(11011508,'郁花园'),(11011509,'海子角'),(11011510,'高米店'),(11011511,'其他'),(11011601,'怀柔城区'),(11011606,'雁栖'),(11011607,'其他'),(11011701,'平谷城区'),(11011702,'滨河路'),(11011703,'其他'),(11012801,'密云城区'),(11012802,'其他'),(11012901,'延庆'),(11012902,'康庄'),(11012903,'八达岭'),(11012904,'大榆树'),(11012905,'永宁'),(11013001,'燕顺路'),(11013002,'迎宾路'),(11013003,'上上城'),(12010101,'劝业场'),(12010102,'小白楼'),(12010103,'滨江道'),(12010104,'体育馆'),(12010105,'新兴街'),(12010106,'南营门'),(12010107,'南市'),(12010108,'和平周边'),(12010201,'大王庄'),(12010202,'大直沽'),(12010203,'大桥道'),(12010204,'中山门'),(12010205,'富民路'),(12010206,'二号桥'),(12010207,'春华街'),(12010208,'常州道'),(12010209,'向阳楼'),(12010210,'上杭路'),(12010211,'唐口'),(12010212,'鲁山道'),(12010213,'程林街'),(12010214,'张贵庄路'),(12010215,'东新街'),(12010217,'河东周边'),(12010301,'大营门'),(12010302,'下瓦房'),(12010303,'桃园街'),(12010304,'挂甲寺'),(12010305,'尖山路'),(12010306,'越秀路'),(12010307,'马场道'),(12010308,'友谊路'),(12010309,'天塔'),(12010310,'梅江'),(12010311,'小海地'),(12010312,'柳林'),(12010313,'东海'),(12010314,'陈塘庄'),(12010315,'土城'),(12010316,'河西周边'),(12010317,'梅江南'),(12010401,'王顶堤'),(12010402,'华苑'),(12010403,'体育中心'),(12010404,'八里台'),(12010405,'学府街'),(12010406,'万兴街'),(12010407,'兴南街'),(12010408,'鼓楼'),(12010409,'广开街'),(12010410,'黄河道'),(12010411,'长虹街'),(12010412,'嘉陵道'),(12010413,'向阳路'),(12010414,'密云路'),(12010415,'天拖南'),(12010416,'荣业大街'),(12010417,'古文化街'),(12010418,'南开周边'),(12010501,'望海楼街'),(12010502,'光复道街'),(12010503,'鸿顺里街'),(12010504,'建昌道街'),(12010505,'铁东路街'),(12010506,'宁园街'),(12010507,'王串场街'),(12010508,'江都路街'),(12010509,'靖江路街'),(12010510,'月牙河街'),(12010511,'河北周边'),(12010601,'咸阳北路街'),(12010602,'丁字沽街'),(12010603,'西于庄街'),(12010604,'西沽街'),(12010605,'邵公庄街'),(12010606,'芥园街'),(12010607,'铃铛阁街'),(12010608,'三条石街'),(12010609,'大胡同街'),(12010610,'红桥周边'),(12010611,'双环邨街'),(12010701,'大梁子街'),(12010702,'新港街'),(12010703,'工农村街'),(12010704,'杭州道街'),(12010705,'向阳街'),(12010706,'解放路街'),(12010707,'塘沽新村街'),(12010708,'新河街'),(12010709,'胡家园街'),(12010710,'东大沽街'),(12010711,'渤海石油街'),(12010712,'三槐路街'),(12010713,'新城镇'),(12010714,'北塘街'),(12010715,'西大沽街'),(12010716,'塘沽周边'),(12010801,'汉沽'),(12010802,'寨上'),(12010803,'河西'),(12010804,'天化'),(12010805,'盐场'),(12010806,'茶淀'),(12010807,'大田'),(12010808,'营城'),(12010809,'杨家泊'),(12010901,'迎宾街'),(12010902,'胜利街'),(12010903,'古林街'),(12010904,'海滨'),(12010905,'港西'),(12010906,'太平'),(12010907,'中塘'),(12010908,'小王庄'),(12010909,'世纪大道'),(12010910,'大港周边'),(12011001,'新立镇'),(12011002,'华明镇'),(12011003,'利津路'),(12011004,'先锋路'),(12011005,'津塘路'),(12011006,'地毯路'),(12011007,'赤土镇'),(12011008,'大毕庄镇'),(12011009,'军粮城'),(12011012,'么六桥乡'),(12011013,'东丽周边'),(12011101,'杨柳青'),(12011102,'中北'),(12011103,'侯台'),(12011104,'李七庄'),(12011105,'大寺'),(12011106,'南河'),(12011107,'张家窝'),(12011108,'辛口'),(12011109,'王稳庄'),(12011110,'青泊洼'),(12011111,'西青周边'),(12011201,'咸水沽'),(12011202,'双港'),(12011203,'八里台'),(12011204,'小站'),(12011205,'北闸口'),(12011206,'辛庄'),(12011207,'葛沽'),(12011208,'双桥河'),(12011209,'津南周边'),(12011301,'宜兴埠'),(12011302,'天穆'),(12011303,'果园新村'),(12011304,'北仓'),(12011305,'集贤里'),(12011306,'双街'),(12011307,'双口'),(12011308,'青光'),(12011309,'红光农场'),(12011310,'小淀'),(12011311,'大张庄镇'),(12011312,'西堤头镇'),(12011313,'津京公路街'),(12011314,'北辰周边'),(12011315,'新村街'),(12011401,'杨村'),(12011402,'运河西'),(12011403,'徐官屯'),(12011404,'下朱庄'),(12011405,'黄庄'),(12011406,'东蒲洼'),(12011407,'东马圈'),(12011408,'黄花店'),(12011409,'石各庄'),(12011410,'王庆坨'),(12011411,'汊沽港'),(12011412,'陈嘴'),(12011413,'梅厂'),(12011414,'上马台'),(12011415,'崔黄口'),(12011416,'河北屯'),(12011417,'下伍旗'),(12011418,'大良'),(12011419,'大碱厂'),(12011420,'南蔡村'),(12011421,'大孟庄'),(12011422,'泗村店'),(12011423,'河西务'),(12011424,'城关'),(12011425,'大王古庄'),(12011426,'豆张庄'),(12011427,'大黄堡'),(12011428,'曹子里'),(12011429,'高村'),(12011430,'白古屯'),(12011501,'马家店'),(12011502,'大口屯'),(12011503,'新开口'),(12011504,'大白庄'),(12011505,'黄庄'),(12011506,'郝各庄'),(12011507,'牛道口'),(12011508,'大钟庄'),(12011509,'新安'),(12011510,'王卜庄'),(12011511,'方家庄'),(12011512,'口东'),(12011513,'高家庄'),(12011514,'霍各庄'),(12011515,'八门城'),(12011516,'林亭口'),(12011517,'周良庄'),(12011518,'大唐庄'),(12011519,'史各庄'),(12011520,'牛家牌'),(12011521,'尔王庄'),(12011522,'城关'),(12012101,'芦台'),(12012102,'丰台'),(12012103,'岳龙'),(12012104,'板桥'),(12012105,'苗庄'),(12012106,'宁河'),(12012107,'东棘坨'),(12012108,'大北涧沽'),(12012109,'潘庄'),(12012110,'造甲城'),(12012111,'廉庄'),(12012112,'俵口'),(12012113,'北淮淀'),(12012114,'清河农场'),(12012115,'芦台经济开发区'),(12012301,'静海'),(12012302,'独流'),(12012303,'台头'),(12012304,'王口'),(12012305,'梁头'),(12012306,'子牙'),(12012307,'沿庄'),(12012308,'双塘'),(12012309,'陈官屯'),(12012310,'唐官屯'),(12012311,'大丰堆'),(12012312,'西翟庄'),(12012313,'大邱庄'),(12012314,'团泊'),(12012315,'蔡公庄'),(12012316,'中旺'),(12012317,'良王庄'),(12012318,'杨成庄'),(12012319,'七里海'),(12012501,'文昌街道'),(12012502,'城关'),(12012503,'下营'),(12012504,'罗庄子'),(12012505,'马伸桥'),(12012506,'出头岭'),(12012507,'西龙虎峪'),(12012508,'官庄'),(12012509,'白涧'),(12012510,'邦均'),(12012511,'洇溜'),(12012512,'别山'),(12012513,'桑梓'),(12012514,'尤古庄'),(12012515,'侯家营'),(12012516,'施古'),(12012517,'上仓'),(12012518,'下窝头'),(12012519,'杨津庄'),(12012520,'下仓'),(12012521,'穿芳峪'),(12012522,'许家台'),(12012523,'礼明庄'),(12012524,'东赵各庄'),(12012525,'东二营'),(12012526,'孙各庄满族'),(12012601,'第一大街'),(12012602,'第二大街'),(12012603,'第三大街'),(12012604,'第四大街'),(12012605,'第五大街'),(12012606,'鲲鹏街'),(12012607,'开发区周边'),(13010201,'白佛'),(13010202,'长丰'),(13010203,'丰收路'),(13010204,'广安'),(13010205,'光华路'),(13010206,'河东'),(13010207,'和平东路'),(13010208,'建北'),(13010209,'建华'),(13010210,'建明'),(13010211,'热电厂'),(13010212,'省博物馆'),(13010213,'谈固'),(13010214,'体育北大街'),(13010215,'土贤庄'),(13010216,'沿东'),(13010217,'育才'),(13010218,'跃进'),(13010219,'长安周边'),(13010301,'长征街'),(13010302,'东风'),(13010303,'东华'),(13010304,'东平路'),(13010305,'阜康'),(13010306,'和平东路'),(13010307,'槐中路'),(13010308,'汇通路'),(13010309,'建安'),(13010310,'佳农市场'),(13010311,'建设北大街'),(13010312,'建设南大街'),(13010313,'棉六'),(13010314,'彭后'),(13010315,'平安北大街'),(13010316,'平安南大街'),(13010317,'胜北'),(13010318,'胜南'),(13010319,'四中路'),(13010320,'塔南路'),(13010321,'休门'),(13010322,'中山东路'),(13010323,'桥东周边'),(13010401,'滨河'),(13010402,'城角'),(13010403,'东里'),(13010404,'工农路'),(13010405,'红旗'),(13010406,'槐安路'),(13010407,'槐西'),(13010408,'火车站'),(13010409,'建国路'),(13010410,'简良'),(13010411,'南长'),(13010412,'桥西周边'),(13010413,'七里河'),(13010414,'师范街'),(13010415,'石铜路'),(13010416,'维明'),(13010417,'西里'),(13010418,'新华路南'),(13010419,'新石'),(13010420,'西三教'),(13010421,'友谊'),(13010422,'裕西'),(13010423,'振头'),(13010424,'中华南大街'),(13010425,'中山'),(13010426,'自强路'),(13010501,'柏林'),(13010502,'北荣街'),(13010503,'北新街'),(13010504,'北苑'),(13010505,'电大街'),(13010506,'东焦'),(13010507,'二中'),(13010508,'高柱'),(13010509,'革新'),(13010510,'和平西路'),(13010511,'合作路'),(13010512,'红军大街'),(13010513,'纪念碑'),(13010514,'联盟'),(13010515,'联强'),(13010516,'宁安'),(13010517,'石岗'),(13010518,'水上公园'),(13010519,'泰华街'),(13010520,'天苑'),(13010521,'五七'),(13010522,'兴凯路'),(13010523,'新华路'),(13010524,'西苑'),(13010525,'友谊街口'),(13010526,'新华周边'),(13010527,'四微'),(13010701,'矿市'),(13010702,'井陉矿周边'),(13010703,'四微'),(13010801,'大马村'),(13010802,'东风路'),(13010803,'东岗'),(13010804,'东苑'),(13010805,'富强'),(13010806,'槐北'),(13010807,'槐底'),(13010808,'金马'),(13010809,'南货厂'),(13010810,'青园'),(13010811,'世纪公园'),(13010812,'石门'),(13010813,'市庄路'),(13010814,'孙村'),(13010815,'谈固大街'),(13010816,'塔冢'),(13010817,'体育南大街'),(13010818,'万达'),(13010819,'裕东'),(13010820,'裕华'),(13010821,'裕强'),(13010822,'裕兴'),(13010823,'翟营大街'),(13010824,'赵陵铺'),(13010825,'众美'),(13010826,'中强'),(13010827,'裕华周边'),(13018601,'长江大道'),(13018602,'黄河大道'),(13018603,'经济技术开发区'),(13018604,'精英中学'),(13018605,'昆仑大街'),(13018606,'师专'),(13018607,'天山大街'),(13018608,'天山海世界'),(13018609,'五十四中学'),(13018610,'湘江道'),(14010501,'北营'),(14010502,'并州南路'),(14010503,'滨河东路'),(14010504,'长风'),(14010505,'富士康'),(14010506,'高新区'),(14010507,'建设南路'),(14010508,'经济技术开发区'),(14010509,'经济区'),(14010510,'南中环'),(14010511,'平阳'),(14010512,'亲贤'),(14010513,'太榆路'),(14010514,'体育路'),(14010515,'体育西路'),(14010516,'王村南街'),(14010517,'坞城'),(14010518,'小店'),(14010519,'学府街'),(14010520,'许坦东西街'),(14010521,'其他'),(14010601,'并州北路'),(14010602,'并州东西街'),(14010603,'朝阳'),(14010604,'大南门'),(14010605,'大营盘'),(14010606,'服装城'),(14010607,'郝庄'),(14010608,'解放路'),(14010609,'老军营'),(14010610,'柳巷'),(14010611,'庙前'),(14010612,'民营经济园区'),(14010613,'民营区'),(14010614,'南内环'),(14010615,'桥东'),(14010616,'青年路'),(14010617,'双塔东西街'),(14010618,'水西关'),(14010619,'水西门'),(14010620,'桃园'),(14010621,'体育馆'),(14010622,'文庙'),(14010623,'五一广场'),(14010624,'迎泽大街'),(14010625,'其他'),(14010701,'半坡东西街'),(14010702,'北大街'),(14010703,'大东关'),(14010704,'典膳所'),(14010705,'动物园'),(14010706,'敦化坊'),(14010707,'府东府西'),(14010708,'鼓楼'),(14010709,'旱西关'),(14010710,'涧河'),(14010711,'建设北路'),(14010712,'解放北路'),(14010713,'巨轮'),(14010714,'龙潭湖'),(14010715,'赛马场'),(14010716,'三墙路'),(14010717,'三桥'),(14010718,'五龙口'),(14010719,'五一路'),(14010720,'小东门'),(14010721,'西华门'),(14010722,'杨家峪'),(14010723,'中涧河'),(14010724,'其他'),(14010801,'北宫'),(14010802,'胜利桥'),(14010803,'迎新桥'),(14010804,'光社'),(14010805,'上兰'),(14010806,'南寨'),(14010807,'柴村'),(14010808,'其他'),(14010901,'滨河西路'),(14010902,'东社'),(14010903,'和平路'),(14010904,'千峰'),(14010905,'小井'),(14010906,'下元'),(14010907,'西宫'),(14010908,'西客站'),(14010909,'兴华'),(14010910,'漪汾'),(14010911,'迎泽西大街'),(14010912,'其他'),(14011001,'晋祠'),(14011002,'晋阳湖'),(14011003,'义井'),(14011004,'其他'),(15010101,'阿尔泰游乐园'),(15010102,'八一市场'),(15010103,'长乐宫'),(15010104,'光华街'),(15010105,'鼓楼'),(15010106,'海东路'),(15010107,'火车站'),(15010108,'润宇'),(15010109,'润宇家居'),(15010110,'新城区政府'),(15010111,'展览馆'),(15010112,'哲里木路'),(15010113,'其他'),(15010201,'驰誉'),(15010202,'东瓦窑'),(15010203,'鄂尔多斯东街'),(15010204,'丰州路'),(15010205,'金帝商城'),(15010206,'桥华世纪村'),(15010207,'赛罕区政府'),(15010208,'乌兰察布东路'),(15010209,'西把栅乡政府'),(15010210,'其他'),(15010301,'海西路'),(15010302,'西龙王庙'),(15010303,'县府街'),(15010304,'植物园'),(15010305,'中山西路'),(15010306,'钢铁路'),(15010401,'大召'),(15010402,'南茶坊'),(15010403,'石羊桥东路'),(15010404,'大南街'),(15010405,'兴隆巷'),(15010406,'长和廊'),(15010407,'小召前街'),(15011401,'土默特左旗'),(15020201,'包头东站'),(15020202,'巴彦塔拉大街'),(15020203,'财神庙'),(15020204,'东大桥'),(15020205,'东河劝业环西'),(15020206,'二宫'),(15020207,'工业路'),(15020208,'红星'),(15020209,'南海湿地公园'),(15020210,'人民公园'),(15020211,'铁西'),(15020212,'西脑包'),(15020213,'站北路'),(15020301,'阿尔丁广场'),(15020302,'阿尔丁植物园'),(15020303,'包百'),(15020304,'包头乐园'),(15020305,'八一公园'),(15020306,'丰盈道'),(15020307,'钢铁大街'),(15020308,'火车站'),(15020309,'甲尔坝'),(15020310,'科技大学'),(15020311,'恰特'),(15020312,'青年路'),(15020313,'少先路'),(15020314,'市政府'),(15020315,'团结大街'),(15020316,'五一市场'),(15020317,'稀土大厦'),(15020318,'友谊大街'),(15020319,'其他'),(15020401,'二机一中'),(15020402,'呼得木林大街'),(15020403,'九星电子大厦'),(15020404,'科学路'),(15020405,'劳动公园'),(15020406,'娜琳广场'),(15020407,'南壕'),(15020408,'南郊苗圃'),(15020409,'青东东路'),(15020410,'青东路'),(15020411,'青山公园'),(15020412,'食品大世界'),(15020413,'万达广场'),(15020414,'文化路'),(15020415,'五一市场'),(15020416,'一宫环岛'),(15020417,'赵家营'),(15020418,'自由路'),(15020419,'其他'),(15020701,'绿色产业区'),(15020702,'果园区'),(15020703,'巴音高勒公园'),(15020704,'沙河街'),(15020705,'哈屯高勒大街'),(15020706,'其他'),(15022401,'海富商业街'),(15022402,'滨河购物街'),(15022403,'屹林广场'),(15022404,'万水泉大街'),(15022405,'红旗大道'),(15022406,'其他'),(15022501,'黄河大街'),(15022502,'富林路'),(15022503,'劳动路'),(15022504,'稀土路'),(15022505,'体育休闲公园'),(15022506,'稀土大厦'),(15022507,'其他'),(21010201,'三好街'),(21010202,'太原街'),(21010203,'马路湾'),(21010204,'南湖'),(21010205,'西塔'),(21010206,'北市'),(21010207,'皇寺'),(21010208,'遂川'),(21010209,'八经'),(21010210,'十四纬路'),(21010211,'云集'),(21010212,'中山广场'),(21010213,'南站'),(21010214,'中华路'),(21010215,'南京街'),(21010216,'民主'),(21010217,'和平广场'),(21010218,'集贤'),(21010219,'新华'),(21010220,'胜利'),(21010223,'五里河'),(21010224,'文体西路'),(21010225,'其他'),(21010301,'大西街'),(21010302,'广宜街'),(21010303,'惠工'),(21010304,'北站'),(21010305,'市府广场'),(21010306,'一经'),(21010307,'二经'),(21010308,'一经街'),(21010309,'二经街'),(21010310,'风雨坛'),(21010311,'五爱市场'),(21010312,'小南'),(21010313,'大南'),(21010314,'文艺路'),(21010315,'展览馆'),(21010316,'文化路'),(21010317,'南塔'),(21010318,'滨河'),(21010319,'万莲'),(21010320,'方家栏'),(21010321,'正阳街'),(21010322,'中街'),(21010401,'小北'),(21010402,'八王寺'),(21010403,'大北'),(21010404,'小津桥'),(21010405,'珠林'),(21010406,'滂江街'),(21010407,'北海街'),(21010408,'其他'),(21010409,'吉祥'),(21010410,'辽沈'),(21010411,'东北大马路'),(21010412,'东站'),(21010413,'二台子'),(21010414,'老瓜堡'),(21010415,'上园路'),(21010416,'北大营'),(21010417,'望花'),(21010418,'724地区'),(21010419,'小东'),(21010420,'大东路'),(21010421,'长安'),(21010422,'东塔'),(21010423,'204医院'),(21010424,'新东'),(21010425,'五中家乐福'),(21010426,'万泉'),(21010427,'陶瓷城'),(21010428,'丰乐'),(21010501,'北行'),(21010502,'长江街'),(21010503,'昆山路'),(21010504,'塔湾'),(21010505,'明廉'),(21010506,'向工'),(21010507,'太平'),(21010508,'怒江北街'),(21010509,'百鸟公园'),(21010510,'崇山'),(21010511,'其他'),(21010512,'黑龙江街'),(21010513,'辽河街'),(21010514,'五一商店'),(21010515,'北塔'),(21010516,'长客'),(21010517,'北陵'),(21010518,'陵东'),(21010519,'黄河'),(21010520,'泰山路'),(21010521,'新乐'),(21010522,'陵西'),(21010523,'三台子'),(21010524,'寿泉'),(21010525,'华山'),(21010526,'珠江桥'),(21010527,'三洞桥'),(21010528,'亚明'),(21010529,'皇姑屯火车站'),(21010601,'兴工'),(21010603,'爱工街'),(21010604,'云峰'),(21010605,'铁西广场'),(21010606,'兴华'),(21010607,'兴顺'),(21010608,'家具城'),(21010609,'九路市场'),(21010610,'齐贤'),(21010611,'建设大路'),(21010612,'保工'),(21010613,'北二路'),(21010614,'北三路'),(21010615,'北四路'),(21010616,'启工'),(21010617,'肇工街'),(21010618,'十二路'),(21010619,'工人村'),(21010620,'劳动公园'),(21010621,'卫工'),(21010622,'西站'),(21010623,'沈辽路'),(21010624,'艳粉'),(21010625,'滑翔小区'),(21010626,'凌空'),(21010627,'工业大学'),(21010628,'铁西区政府'),(21010629,'铁西体育场'),(21010630,'铁百'),(21010631,'路官'),(21010632,'啤酒厂'),(21010633,'重工'),(21010634,'贵和'),(21010635,'其它'),(21011101,'民主'),(21011102,'湖西'),(21011103,'解放'),(21011104,'中兴'),(21011105,'城郊'),(21011106,'临湖'),(21011107,'铁友'),(21011201,'东陵'),(21011202,'泉园'),(21011203,'马官桥'),(21011204,'丰乐'),(21011205,'五三'),(21011206,'浑河站东'),(21011207,'浑河站西'),(21011208,'白塔'),(21011209,'桃仙'),(21011210,'前进'),(21011211,'英达'),(21011212,'东湖'),(21011213,'其它'),(21011301,'新城子'),(21011302,'虎石台'),(21011303,'道义'),(21011304,'辉山'),(21011305,'蒲河'),(21011306,'清水台'),(21011307,'财落'),(21011308,'兴隆台锡伯族'),(21011401,'于洪'),(21011402,'迎宾路'),(21011403,'于洪广场'),(21011404,'和泰新城'),(21011405,'沈辽路'),(21011406,'杨士'),(21011407,'于洪新城'),(21011408,'丁香湖'),(21011409,'白山路'),(21011410,'荷兰村'),(21011411,'国奥现代城'),(21011412,'松山小区'),(21011413,'造化'),(21011414,'沙岭'),(21011415,'其他'),(21011416,'大潘镇'),(21011417,'大兴乡'),(21011418,'马三家'),(21011419,'于洪区委'),(21011420,'城东湖'),(21012201,'辽中'),(21012202,'茨榆坨'),(21012203,'朱家房'),(21012204,'于家房'),(21012205,'满都户'),(21012206,'肖寨门'),(21012207,'杨士岗'),(21012208,'冷子堡'),(21012209,'新民屯'),(21012210,'长滩'),(21012211,'刘二堡'),(21012212,'四方台'),(21012301,'康平'),(21012302,'东关屯'),(21012303,'张强'),(21012304,'小城子'),(21012305,'方家屯'),(21012306,'郝官屯'),(21012307,'二牛所口'),(21012401,'运动系'),(21012402,'法库'),(21012403,'秀水河子'),(21012404,'登仕堡子'),(21012405,'叶茂台'),(21012406,'柏家沟'),(21012407,'大孤家子'),(21012408,'三面船'),(21012409,'丁家房'),(21018101,'东城'),(21018102,'西城'),(21018103,'辽滨'),(21018104,'新城'),(21020201,'中山广场'),(21020202,'人民路'),(21020203,'三八广场'),(21020204,'二七广场'),(21020205,'火车站'),(21020206,'老虎滩'),(21020207,'寺儿沟'),(21020208,'青泥洼桥'),(21020209,'昆明街'),(21020210,'华乐广场'),(21020211,'解放路'),(21020212,'秀月街'),(21020213,'葵英街'),(21020214,'天津街'),(21020215,'长江路'),(21020216,'桃源街'),(21020217,'港湾广场'),(21020218,'大外'),(21020219,'青云街'),(21020220,'景山小区'),(21020221,'胜利桥'),(21020222,'武昌街'),(21020223,'七七街'),(21020224,'中山公园'),(21020225,'友好广场'),(21020226,'中南路'),(21020227,'39中'),(21020228,'迎宾路'),(21020229,'跃进路'),(21020230,'海军广场'),(21020231,'希望广场'),(21020232,'小龙街'),(21020233,'景山市场'),(21020234,'中山周边'),(21020301,'西岗周边'),(21020302,'大菜市'),(21020303,'北京街'),(21020304,'长春路'),(21020305,'英华街'),(21020306,'鞍山路'),(21020307,'香工街'),(21020308,'高尔基路'),(21020309,'香炉礁'),(21020310,'奥林匹克广场'),(21020311,'胜利桥北'),(21020312,'东关街'),(21020313,'站北'),(21020314,'八一路'),(21020315,'新开路'),(21020316,'人民广场'),(21020317,'石道街'),(21020318,'胜利路'),(21020319,'北岗桥'),(21020320,'石葵路'),(21020321,'工人村'),(21020322,'付家庄'),(21020323,'五一广场'),(21020324,'体育场'),(21020325,'红旗公社'),(21020326,'北海广场'),(21020327,'大工街'),(21020328,'黄河路'),(21020329,'沈阳路'),(21020330,'五四路'),(21020331,'34中'),(21020332,'新起屯'),(21020333,'实验小学'),(21020334,'永丰街'),(21020401,'兴工街'),(21020402,'西安路'),(21020403,'和平广场'),(21020404,'红旗镇'),(21020405,'星海公园'),(21020406,'黑石礁'),(21020407,'马栏广场'),(21020408,'交大'),(21020409,'侯家沟'),(21020410,'春柳'),(21020411,'刘家桥'),(21020412,'锦绣'),(21020413,'绿波'),(21020414,'五一路'),(21020415,'西南路'),(21020416,'孙家沟'),(21020417,'南沙'),(21020418,'星海湾'),(21020419,'辽师'),(21020420,'解放广场'),(21020421,'五一广场'),(21020422,'华北路'),(21020423,'西山'),(21020424,'白山路'),(21020425,'太原街'),(21020426,'车家村'),(21020427,'民权'),(21020428,'中山路'),(21020429,'白云新村'),(21020430,'台山'),(21020431,'宁夏路'),(21020433,'盖州街'),(21020434,'沙河口周边'),(21020437,'泉涌'),(21021101,'西山水库'),(21021102,'山东路'),(21021103,'泡崖子'),(21021104,'辛寨子'),(21021105,'革镇堡'),(21021106,'南关岭'),(21021107,'华南'),(21021108,'大连湾'),(21021109,'泉水'),(21021110,'椒房'),(21021111,'金三角'),(21021112,'营城子'),(21021113,'周水子'),(21021114,'千山路'),(21021115,'西南路'),(21021116,'松江路'),(21021117,'红旗中路'),(21021118,'甘井子周边'),(21021119,'华西小区'),(21021120,'大纺'),(21021121,'机场'),(21021122,'张家村'),(21021123,'机场前'),(21021124,'甘井子'),(21021125,'华北路'),(21021126,'香周路'),(21021127,'东北路'),(21021128,'王家桥'),(21021129,'后盐'),(21021130,'凌水'),(21021131,'庙岭'),(21021132,'迎客路'),(21021133,'华东路'),(21021201,'世界和平公园'),(21021202,'水师营'),(21021203,'滨港路'),(21021204,'龙王塘'),(21021205,'老铁山'),(21021206,'水师营'),(21021207,'江西'),(21021208,'老铁山'),(21021209,'江西'),(21021210,'白玉山'),(21021211,'三涧堡'),(21021212,'长城'),(21021213,'港湾街'),(21021214,'北海'),(21021215,'鸡冠山路'),(21021216,'黄河路'),(21021217,'斯大林路'),(21021218,'友谊路'),(21021219,'长江路'),(21021220,'营顺路'),(21021221,'向阳街'),(21021222,'双盛路'),(21021223,'旅顺周边'),(21021301,'友谊'),(21021302,'光明'),(21021303,'拥政'),(21021304,'先进'),(21021305,'站前'),(21021306,'三十里堡'),(21021307,'登沙河'),(21021308,'中长'),(21021309,'马桥子'),(21021310,'海青岛'),(21021311,'大孤山'),(21021312,'新港'),(21021313,'董家沟'),(21021314,'金石滩'),(21021315,'湾里'),(21021316,'二十里堡'),(21021317,'亮甲店'),(21021318,'杏树屯'),(21021319,'石河'),(21021320,'大魏家'),(21021321,'北山路'),(21021322,'金州周边'),(21021323,'东山快轨站'),(21021401,'七贤岭'),(21021402,'东财'),(21021403,'海事'),(21021404,'东软'),(21021405,'软件园'),(21021406,'小平岛'),(21021407,'凌水镇'),(21021408,'火炬路'),(21021409,'河口'),(21021410,'庙岭'),(21021411,'数码路'),(21021412,'王家村'),(21021413,'黄浦路'),(21021414,'岭南路'),(21021415,'广贤路'),(21021416,'亿阳路'),(21021417,'汇贤路'),(21021418,'高新园周边'),(21021501,'双D港'),(21021502,'快轨金石滩'),(21021503,'快轨开发区'),(21021504,'小瑶湾'),(21021505,'小孤山'),(21021506,'保税区'),(21021507,'快轨金马路'),(21021508,'南坨子'),(21021509,'东山'),(21028101,'砖石街'),(21122301,'重工'),(22010201,'南岭街道'),(22010202,'自强街道'),(22010203,'民康街道'),(22010204,'新春街道'),(22010205,'长通街道'),(22010206,'全安街道'),(22010207,'曙光街道'),(22010208,'永吉街道'),(22010209,'桃源街道'),(22010210,'鸿城街道'),(22010211,'临河街道办事处'),(22010212,'永兴街道办事处'),(22010213,'净月街道办事处'),(22010214,'新立城镇'),(22010215,'新湖镇'),(22010216,'玉潭镇'),(22010217,'幸福乡'),(22010301,'新发街道'),(22010302,'站前街道'),(22010303,'南广街道'),(22010304,'东广街道'),(22010305,'群英街道'),(22010306,'兴业街道'),(22010307,'凯旋街道'),(22010308,'团山街道'),(22010309,'柳影街道'),(22010310,'兰家镇'),(22010311,'米沙子镇'),(22010312,'万宝镇'),(22010313,'兴隆山镇'),(22010314,'合隆镇'),(22010315,'奋进乡'),(22010316,'兴业农场'),(22010401,'南站街道'),(22010402,'桂林街道'),(22010403,'南湖街道'),(22010404,'永昌街道'),(22010405,'重庆街道'),(22010406,'清和街道'),(22010407,'红旗街道'),(22010408,'湖西街道'),(22010409,'富锋街道'),(22010410,'乐山镇'),(22010411,'永春镇'),(22010412,'双德乡'),(22010501,'东盛街道'),(22010502,'吉林街道'),(22010503,'荣光街道'),(22010504,'东站街道'),(22010505,'远达街道'),(22010506,'八里堡街道'),(22010507,'东方广场街道办事处'),(22010508,'英俊镇'),(22010509,'劝农山镇'),(22010510,'泉眼镇'),(22010511,'龙嘉镇'),(22010512,'卡伦湖镇'),(22010513,'东湖镇'),(22010514,'四家乡'),(22010601,'正阳街道'),(22010602,'普阳街道'),(22010603,'春城街道'),(22010604,'铁西街道'),(22010605,'青年街道'),(22010606,'锦程街道办事处'),(22010607,'东风街道办事处'),(22010608,'合心镇'),(22010609,'西新镇'),(22010610,'城西镇'),(22010611,'长春汽车产业开发区'),(22010612,'绿园经济开发区'),(22011201,'云山街道'),(22011202,'平湖街道'),(22011203,'奢岭街道'),(22011204,'山河街道'),(22011205,'齐家镇'),(22011206,'太平镇'),(22011207,'鹿乡镇'),(22011208,'双营乡'),(22012201,'农安镇'),(22012202,'伏龙泉镇'),(22012203,'哈拉海镇'),(22012204,'靠山镇'),(22012205,'开安镇'),(22012206,'烧锅镇'),(22012207,'高家店镇'),(22012208,'华家镇'),(22012209,'三盛玉镇'),(22012210,'巴吉垒镇'),(22012211,'前岗乡'),(22012212,'龙王乡'),(22012213,'三岗乡'),(22012214,'万顺乡'),(22012215,'杨树林乡'),(22012216,'永安乡'),(22012217,'青山口乡'),(22012218,'黄鱼圈乡'),(22012219,'新农乡'),(22012220,'万金塔乡'),(22012221,'小城子乡'),(22012222,'洼中高农场'),(22018101,'九台街道'),(22018102,'营城街道'),(22018103,'九郊街道'),(22018104,'沐石河镇'),(22018105,'城子街镇'),(22018106,'其塔木镇'),(22018107,'上河湾镇'),(22018108,'西营城镇'),(22018109,'土们岭镇'),(22018110,'苇子沟镇'),(22018111,'兴隆镇'),(22018112,'纪家镇'),(22018113,'波泥河镇'),(22018114,'胡家回族乡'),(22018115,'莽卡满族乡'),(22018201,'华昌街道'),(22018202,'正阳街道'),(22018203,'培英街道'),(22018204,'城郊街道'),(22018205,'五棵树镇'),(22018206,'弓棚镇'),(22018207,'闵家镇'),(22018208,'大坡镇'),(22018209,'黑林镇'),(22018210,'土桥镇'),(22018211,'新立镇'),(22018212,'大岭镇'),(22018213,'向阳镇'),(22018214,'泗河镇'),(22018215,'八号镇'),(22018216,'刘家镇'),(22018217,'秀水镇'),(22018218,'保寿镇'),(22018219,'新庄镇'),(22018220,'育民乡'),(22018221,'红星乡'),(22018222,'太安乡'),(22018223,'先峰乡'),(22018224,'青山乡'),(22018225,'延和朝鲜族乡'),(22018226,'恩育乡'),(22018227,'城发乡'),(22018228,'环城乡'),(22018301,'胜利街道'),(22018302,'建设街道'),(22018303,'惠发街道'),(22018304,'夏家店街道'),(22018305,'大青嘴镇'),(22018306,'郭家镇'),(22018307,'松花江镇'),(22018308,'达家沟镇'),(22018309,'大房身镇'),(22018310,'岔路口镇'),(22018311,'朱城子镇'),(22018312,'布海镇'),(22018313,'天台镇'),(22018314,'菜园子镇'),(22018315,'同太乡'),(22018316,'边岗乡'),(22018317,'朝阳乡'),(22018318,'五台乡'),(23010201,'埃德蒙顿路'),(23010202,'爱建'),(23010203,'安国街'),(23010204,'城乡路'),(23010205,'大发'),(23010206,'道里周边'),(23010207,'地段街'),(23010208,'抚顺'),(23010209,'工程街'),(23010210,'公路大桥'),(23010211,'顾乡'),(23010212,'哈药路'),(23010213,'哈一百'),(23010214,'河松'),(23010215,'建国公园'),(23010216,'建国街'),(23010217,'机场路'),(23010218,'经纬街'),(23010219,'康安路'),(23010220,'民安街'),(23010221,'群力'),(23010222,'尚志大街'),(23010223,'田地街'),(23010224,'通江'),(23010225,'新阳路'),(23010226,'友谊路'),(23010227,'中央大街'),(23010301,'博物馆'),(23010302,'船舶'),(23010303,'大成'),(23010304,'儿童公园'),(23010305,'奋斗'),(23010306,'革新'),(23010307,'工人文化宫'),(23010308,'果戈里'),(23010309,'国展'),(23010310,'哈达'),(23010311,'哈西'),(23010312,'哈站'),(23010313,'和兴路'),(23010314,'红旗大街'),(23010315,'黄河路'),(23010316,'花园'),(23010317,'教化'),(23010318,'宽城街'),(23010319,'芦家街'),(23010320,'南岗周边'),(23010321,'秋林'),(23010322,'省人才'),(23010323,'省政府'),(23010324,'十字街'),(23010325,'通达街'),(23010326,'文昌街'),(23010327,'先锋路'),(23010328,'西大桥'),(23010329,'西大直街'),(23010330,'宣化'),(23010331,'宣庆'),(23010332,'学府'),(23010333,'一曼街'),(23010401,'北环商城'),(23010402,'滨江'),(23010403,'长春街'),(23010404,'承德广场'),(23010405,'大方里'),(23010406,'道外周边'),(23010407,'大新'),(23010408,'港务局'),(23010409,'红旗大街'),(23010410,'红旗小区'),(23010411,'宏伟路'),(23010412,'靖宇'),(23010413,'黎华小区'),(23010414,'玛克威'),(23010415,'南极市场'),(23010416,'南马路'),(23010417,'南直路'),(23010418,'三棵树'),(23010419,'太古'),(23010420,'太平桥'),(23010421,'先锋路'),(23011001,'安埠'),(23011002,'菜艺街'),(23011003,'公滨路'),(23011004,'工电路'),(23011005,'果园'),(23011006,'哈量'),(23011007,'哈平路'),(23011008,'建北'),(23011009,'进乡街'),(23011010,'乐松'),(23011011,'立汇美罗湾'),(23011012,'六顺街'),(23011013,'民生路'),(23011014,'木材'),(23011015,'母亲广场'),(23011016,'农大'),(23011017,'三大动力'),(23011018,'三合路'),(23011019,'省医院'),(23011020,'省政府'),(23011021,'天鹅饭店'),(23011022,'通天'),(23011023,'通乡商店'),(23011024,'万达商城'),(23011025,'香坊大街'),(23011026,'香坊周边'),(23011027,'幸福'),(23011028,'西香坊'),(23011029,'珠江路'),(23018501,'松北'),(23018502,'利民开发区'),(23018503,'学院路'),(23018504,'世贸大道'),(23018505,'志华商城'),(23018506,'北京路'),(23018507,'南京路'),(23018508,'柏林四季'),(23018509,'滨才城'),(23018601,'长江路'),(23018602,'昆仑商城'),(23018603,'鸿翔路'),(23018604,'会展中心'),(23018605,'赣水路'),(23018606,'汉水路'),(23018607,'闽江'),(23018608,'开发区周边'),(31010101,'人民广场'),(31010102,'南京东路'),(31010103,'外滩'),(31010104,'豫园'),(31010105,'老西门'),(31010107,'蓬莱公园'),(31010301,'淮海中路'),(31010302,'新天地'),(31010304,'打浦桥'),(31010305,'鲁班路'),(31010306,'其他'),(31010401,'徐家汇'),(31010409,'万体馆'),(31010410,'龙华'),(31010412,'漕河泾'),(31010413,'田林'),(31010414,'梅陇'),(31010415,'康健'),(31010417,'植物园'),(31010503,'中山公园'),(31010506,'北新泾'),(31010509,'虹桥'),(31010510,'古北'),(31010511,'天山仙霞'),(31010512,'动物园'),(31010601,'南京西路'),(31010602,'静安寺'),(31010603,'曹家渡'),(31010604,'西康路'),(31010605,'江宁路'),(31010606,'其他'),(31010607,'北京西路'),(31010701,'武宁长寿'),(31010702,'曹杨长风'),(31010703,'大宁'),(31010709,'真北真南真'),(31010713,'石泉宜川'),(31010715,'其他'),(31010801,'新客站不夜'),(31010802,'原平路'),(31010806,'其他'),(31010813,'彭浦'),(31010901,'虹口公园'),(31010902,'凉城'),(31010905,'曲阳'),(31010906,'其他'),(31010907,'四川北路'),(31010913,'提蓝桥'),(31011002,'中原'),(31011003,'五角场'),(31011007,'鞍山'),(31011009,'控江'),(31011010,'其他'),(31011201,'莘庄'),(31011202,'七宝'),(31011204,'龙泊金汇'),(31011208,'漕宝路'),(31011209,'古美路'),(31011212,'颛桥'),(31011213,'其他'),(31011216,'吴京'),(31011217,'浦江镇'),(31011301,'大华'),(31011302,'新城'),(31011303,'上海大学'),(31011304,'沪太路'),(31011306,'其他'),(31011401,'嘉定老城'),(31011402,'其他'),(31011501,'陆家嘴'),(31011503,'八佰伴'),(31011508,'塘桥'),(31011515,'三林'),(31011519,'世纪公园'),(31011525,'张江'),(31011526,'金桥'),(31011528,'其他'),(31011529,'南汇区'),(31011530,'康桥'),(31011531,'新场'),(31011532,'惠南'),(31011533,'祝桥'),(31011534,'临港新城'),(31011535,'泥城'),(31011601,'金山新城'),(31011602,'石化'),(31011603,'金山卫'),(31011604,'漕泾'),(31011605,'亭林'),(31011606,'朱泾'),(31011607,'枫泾'),(31011608,'金山中部'),(31011701,'九亭'),(31011702,'莘闵'),(31011703,'新桥'),(31011704,'泗泾'),(31011705,'佘山'),(31011706,'洞泾'),(31011707,'松江大学城'),(31011708,'松江新城'),(31011709,'松江老城'),(31011710,'松江工业区'),(31011711,'松江科技园'),(31011712,'中山'),(31011713,'方松'),(31011714,'岳阳'),(31011715,'永丰'),(31011716,'车墩'),(31011801,'徐泾'),(31011802,'赵巷'),(31011803,'青浦新城'),(31011804,'朱家角'),(31011805,'重固'),(31011806,'白鹤'),(31011807,'青浦北部'),(31012001,'南桥'),(31012002,'西渡'),(31012003,'庄行'),(31012004,'柘林'),(31012005,'金汇'),(31012006,'奉城'),(31012007,'海湾'),(31012008,'海湾旅游区'),(31012009,'邬桥'),(31013001,'城桥'),(31013002,'堡镇'),(31013003,'崇明'),(31013004,'崇明新城'),(31013005,'陈家镇'),(31013006,'长兴岛'),(31013007,'横沙岛'),(32010201,'街口'),(32010202,'丹凤街'),(32010203,'兰园'),(32010204,'梅园'),(32010205,'玄武门'),(32010206,'后宰门'),(32010207,'锁金村'),(32010208,'孝陵卫'),(32010209,'玄武湖'),(32010210,'红山'),(32010211,'卫岗'),(32010212,'长江路'),(32010213,'珠江路'),(32010214,'月苑'),(32010215,'北京东路'),(32010216,'樱驼花园'),(32010217,'板仓'),(32010218,'中山陵'),(32010219,'新庄'),(32010220,'太平门'),(32010301,'淮海路'),(32010302,'洪武路'),(32010303,'建康路'),(32010304,'五老村'),(32010305,'大光路'),(32010306,'瑞金路'),(32010307,'苜蓿园'),(32010308,'光华路'),(32010309,'朝天宫'),(32010310,'止马营'),(32010311,'常府街'),(32010312,'升州路'),(32010313,'大行宫'),(32010314,'中山门'),(32010315,'月牙湖'),(32010316,'太平南路'),(32010317,'御道街'),(32010318,'中山南路'),(32010319,'新街口'),(32010320,'王府大街'),(32010321,'石鼓路'),(32010322,'石门坎'),(32010323,'三山街'),(32010324,'张府园'),(32010325,'海福巷'),(32010326,'解放路'),(32010327,'李府街'),(32010328,'其他'),(32010401,'夫子庙'),(32010402,'红花'),(32010403,'秦虹路'),(32010404,'双塘'),(32010405,'中华门'),(32010406,'长乐路'),(32010407,'洪家园'),(32010408,'集庆门'),(32010409,'来凤'),(32010410,'大明路'),(32010411,'健康路'),(32010412,'升州路'),(32010413,'中华路'),(32010414,'金陵路'),(32010415,'四福巷'),(32010416,'莲子营'),(32010417,'乌衣巷'),(32010418,'文德桥'),(32010419,'大石坝街'),(32010420,'东关头'),(32010421,'七里街'),(32010422,'新民坊'),(32010423,'三条营'),(32010424,'中营'),(32010425,'转龙巷'),(32010426,'马道街'),(32010427,'饮虹园'),(32010428,'小西湖'),(32010429,'白酒坊'),(32010430,'江宁路'),(32010431,'胭脂巷'),(32010432,'五福街'),(32010433,'玉带园'),(32010434,'弓箭坊'),(32010435,'太平苑'),(32010436,'磨盘街'),(32010437,'高岗里'),(32010438,'凤游寺'),(32010439,'实辉巷'),(32010440,'扫帚巷'),(32010441,'正学路'),(32010442,'雨花路'),(32010443,'西街'),(32010444,'珍巷里'),(32010445,'下码头'),(32010446,'路字铺'),(32010447,'雨花路'),(32010448,'金工里'),(32010449,'开源'),(32010450,'双桥门'),(32010451,'乔虹苑'),(32010452,'集虹苑'),(32010453,'旭光里'),(32010454,'武定新村'),(32010455,'文安里'),(32010456,'康居里'),(32010457,'岗虹苑'),(32010458,'中牌楼'),(32010459,'扇骨里'),(32010460,'七里村'),(32010461,'怡馨'),(32010462,'响水桥'),(32010463,'双桥新村'),(32010464,'龙苑'),(32010465,'九龙新寓'),(32010466,'阳光里'),(32010467,'风光里'),(32010468,'龙翔雅苑'),(32010469,'曙光里'),(32010470,'春天家园'),(32010501,'南湖'),(32010502,'滨湖'),(32010503,'兴隆'),(32010504,'南苑'),(32010505,'沙洲'),(32010506,'双闸'),(32010507,'江心洲'),(32010508,'奥体'),(32010509,'茶南'),(32010510,'水西门'),(32010511,'应天西路'),(32010512,'湖西街'),(32010513,'白鹭花园'),(32010514,'长虹路'),(32010515,'江东门'),(32010516,'河西'),(32010517,'云锦路'),(32010518,'应天大街'),(32010601,'华侨路'),(32010602,'宁海路'),(32010603,'湖南路'),(32010604,'中央门'),(32010605,'挹江门'),(32010606,'江东'),(32010607,'莫愁'),(32010608,'山西路'),(32010609,'许府巷'),(32010610,'凤凰西街'),(32010611,'福建路'),(32010612,'龙江'),(32010613,'水佐岗'),(32010614,'北京西路'),(32010615,'定淮门'),(32010616,'广州路'),(32010617,'汉中路'),(32010618,'马台街'),(32010619,'上海路'),(32010620,'云南路'),(32010621,'草场门'),(32010622,'北京西路'),(32010623,'汉口路'),(32010624,'中央路'),(32010625,'中山北路'),(32010701,'热河南路'),(32010702,'阅江楼'),(32010703,'建宁路'),(32010704,'宝塔桥'),(32010705,'小市'),(32010706,'幕府山'),(32010707,'其他'),(32010708,'五塘村'),(32010709,'大桥南路'),(32010710,'三汊河'),(32010711,'姜圩路'),(32010712,'小桃园'),(32010713,'晏公庙'),(32010714,'白云亭'),(32010715,'二板桥'),(32010716,'大街'),(32010717,'新河村'),(32010718,'清江花苑'),(32010719,'新和园'),(32010720,'唐山路'),(32010721,'南通路'),(32010722,'宝善街'),(32010723,'热河路'),(32010724,'商埠街'),(32010725,'东炮台'),(32010726,'多伦路'),(32010727,'盐大街'),(32010728,'新民门'),(32010729,'新民村'),(32010730,'城河村'),(32010731,'五所村'),(32010732,'工农新村'),(32010733,'四平路'),(32010734,'安乐村'),(32010735,'滨江花园'),(32010736,'金川花苑'),(32010737,'方家营'),(32010738,'宝塔桥东街'),(32010739,'燕江路'),(32010740,'燕江园'),(32010741,'金陵新二村'),(32010742,'金陵新四村'),(32010743,'金陵新六村'),(32010744,'水关桥'),(32010745,'象山'),(32010746,'幕府西路'),(32010747,'恒盛嘉园'),(32010748,'依山郡'),(32010749,'小市街'),(32010750,'东门街'),(32010751,'黄家圩'),(32010752,'东井亭'),(32010753,'线路新村'),(32010754,'河路道'),(32010755,'安怀村'),(32010756,'安怀新村'),(32010757,'小市新村'),(32010758,'东井新村'),(32010759,'五塘新村一段'),(32010760,'五塘新村二段'),(32010761,'盛世花园'),(32010762,'北崮山'),(32010763,'五佰村'),(32010764,'云谷山庄'),(32010765,'白云'),(32010766,'西厂门街道2'),(32010767,'山潘街道3'),(32010768,'卸甲甸街道4'),(32010769,'葛唐街道5'),(32010770,'长芦街道'),(32011101,'泰山'),(32011102,'顶山'),(32011103,'沿江'),(32011104,'江浦'),(32011105,'桥北'),(32011106,'盘城'),(32011107,'其他'),(32011301,'尧化'),(32011302,'迈皋桥'),(32011303,'燕子矶'),(32011304,'龙潭'),(32011305,'栖霞'),(32011306,'马群'),(32011307,'靖安'),(32011308,'八卦洲'),(32011309,'仙林'),(32011310,'晓庄'),(32011311,'万寿'),(32011401,'宁南'),(32011402,'铁心桥'),(32011403,'板桥'),(32011404,'西善桥'),(32011405,'赛虹桥'),(32011406,'雨花新村'),(32011407,'梅山'),(32011408,'安德门'),(32011409,'小行'),(32011410,'能仁里'),(32011411,'雨花新村一三村'),(32011412,'雨花新村二村'),(32011413,'凤凰山'),(32011414,'云台山'),(32011415,'雨花台'),(32011416,'普德村'),(32011417,'康盛花园'),(32011418,'丁墙'),(32011419,'花神庙'),(32011420,'雨花'),(32011421,'建龙'),(32011422,'油坊桥'),(32011423,'古遗井'),(32011424,'四圩'),(32011425,'吴村'),(32011426,'板桥'),(32011427,'绿洲'),(32011428,'近华'),(32011429,'落星'),(32011430,'景明佳园第一社区'),(32011431,'景明佳园第二社区'),(32011432,'春江新区第一社区'),(32011433,'春江新区第二社区'),(32011434,'建通'),(32011435,'铁心村'),(32011436,'尹西'),(32011437,'长虹路'),(32011438,'玻纤院'),(32011439,'菊花里'),(32011440,'安德门'),(32011441,'龙福'),(32011442,'梅怡新村'),(32011443,'中兴路'),(32011444,'上怡新村'),(32011445,'上怡二村'),(32011446,'梅清苑'),(32011447,'梅岭'),(32011448,'中学新村'),(32011449,'梅欣'),(32011450,'梅苑'),(32011451,'邓府山'),(32011452,'吉山'),(32011453,'邓府山'),(32011454,'雨花新村四五村'),(32011501,'东山街道'),(32011502,'方山'),(32011503,'百家湖'),(32011504,'东善桥'),(32011505,'上坊'),(32011506,'淳化街道'),(32011507,'秣陵街道'),(32011508,'科学园'),(32011509,'岔路口'),(32011510,'将军大道'),(32011511,'开发区'),(32011512,'汤山街道'),(32011513,'禄口街道'),(32011514,'金箔路'),(32011515,'麒麟街道'),(32011516,'上元大街'),(32011517,'胜太路'),(32011518,'双龙大道'),(32011519,'天元东路'),(32011520,'文靖路'),(32011521,'竹山路'),(32011522,'谷里街道'),(32011523,'江宁街道'),(32011524,'湖熟街道'),(32011525,'横溪街道'),(32011601,'山潘'),(32011602,'西厂门'),(32011603,'卸甲甸'),(32011604,'葛塘'),(32011605,'长芦'),(32011606,'雄州'),(32011607,'龙池'),(32012401,'永阳'),(32012402,'洪蓝'),(32012403,'柘塘'),(32012404,'白马'),(32012405,'东屏'),(32012406,'石湫'),(32012407,'晶桥'),(32012408,'和凤'),(32012409,'溧水开发区'),(32012410,'溧水县农场'),(32012501,'淳城'),(32012502,'淳溪'),(32012503,'阳江'),(32012504,'砖墙'),(32012505,'古柏'),(32012506,'漆桥'),(32012507,'东坝'),(32012508,'固城'),(32012509,'桠溪'),(32012510,'定埠'),(32013201,'十村'),(32013202,'南钢'),(32013203,'扬子'),(32013204,'葛唐'),(32013205,'新华路'),(32013206,'杨庄'),(32020201,'崇安寺街道'),(32020202,'通江'),(32020203,'广瑞路街道'),(32020204,'上马墩街道'),(32020205,'江海街道'),(32020206,'广益街道'),(32020207,'其他'),(32020301,'南禅寺'),(32020302,'清名桥'),(32020303,'金星'),(32020304,'迎龙桥'),(32020305,'五爱路'),(32020306,'曹张新村'),(32020307,'金匮街道'),(32020308,'沁园'),(32020309,'扬名街道'),(32020310,'马上镇'),(32020311,'南泉镇'),(32020312,'其他'),(32020401,'北大街街道'),(32020402,'惠山'),(32020403,'黄巷'),(32020404,'民丰里'),(32020405,'凤宾路'),(32020406,'山北'),(32020407,'盛岸路'),(32020408,'五爱路'),(32020409,'其他'),(32020501,'东亭'),(32020502,'鸿山'),(32020505,'安镇'),(32020506,'羊尖'),(32020507,'鹅湖'),(32020508,'东北塘'),(32020509,'锡北'),(32020510,'东港'),(32020511,'其他'),(32020601,'堰桥街道'),(32020602,'长安街道'),(32020603,'钱桥街道'),(32020604,'前洲镇'),(32020605,'玉祁镇'),(32020606,'洛社镇'),(32020607,'阳山镇'),(32020608,'惠山古镇'),(32021101,'河埒'),(32021102,'荣巷'),(32021103,'蠡园'),(32021104,'体育中心'),(32021105,'蠡湖街道'),(32021106,'太湖'),(32021107,'滨湖街道'),(32021108,'华庄'),(32021109,'雪浪街道'),(32021110,'胡埭镇'),(32021111,'其他'),(32021201,'旺庄街道'),(32021202,'江溪街道'),(32021203,'梅村镇'),(32021204,'坊前'),(32021205,'硕放'),(32021206,'叙康里'),(32021207,'金海里'),(32021208,'太湖花园'),(32021209,'长江路'),(32021210,'新安街道'),(32021211,'鸿山镇'),(32028101,'澄江街道'),(32028102,'璜土镇'),(32028103,'利港镇'),(32028104,'月城镇'),(32028105,'青阳镇'),(32028106,'徐霞客镇'),(32028107,'南闸镇'),(32028108,'云亭镇'),(32028109,'华士镇'),(32028110,'周庄镇'),(32028111,'新桥镇'),(32028112,'长泾镇'),(32028113,'顾山镇'),(32028114,'祝塘镇'),(32028115,'夏港街道'),(32028116,'申港街道'),(32028201,'宜城街道'),(32028202,'城北街道'),(32028203,'新街街道'),(32028204,'新庄街道'),(32028205,'张渚镇'),(32028206,'西渚镇'),(32028207,'太华镇'),(32028208,'徐舍镇'),(32028209,'官林镇'),(32028210,'杨巷镇'),(32028211,'新建镇'),(32028212,'和桥镇'),(32028213,'高塍镇'),(32028214,'万石镇'),(32028215,'周铁镇'),(32028216,'芳桥镇'),(32028217,'丁蜀镇'),(32028218,'湖父镇'),(32030201,'大马路'),(32030202,'东站'),(32030203,'富国街'),(32030204,'富源国际'),(32030205,'鼓楼广场'),(32030206,'鼓楼花园'),(32030207,'古彭广场'),(32030208,'华联商厦'),(32030209,'金山桥'),(32030210,'九里'),(32030211,'煤港路'),(32030212,'民主北路'),(32030213,'彭城广场'),(32030214,'庆云桥西'),(32030215,'四道街'),(32030216,'下淀路'),(32030217,'祥和路'),(32030218,'响山路'),(32030219,'中枢街'),(32030220,'1818美食'),(32030221,'其他'),(32030301,'楚王陵'),(32030302,'丰储街'),(32030303,'黄山新村'),(32030304,'户部山'),(32030305,'九七医院'),(32030306,'绿地世纪城'),(32030307,'民营工业园'),(32030308,'彭城路'),(32030309,'汽车客运总站'),(32030310,'师大北门'),(32030311,'世茂广场'),(32030312,'食品城'),(32030313,'天桥东'),(32030314,'沃尔玛'),(32030315,'戏马台'),(32030316,'宣武市场'),(32030317,'御景湾'),(32030318,'其他'),(32030401,'古战场遗址'),(32030402,'汉城'),(32030403,'九里峰景'),(32030404,'其他'),(32030501,'人民公园'),(32030502,'步行街'),(32030503,'世纪西路'),(32030504,'青山泉镇'),(32030505,'新夏路口'),(32030506,'其他'),(32031101,'滨湖新天地少华街'),(32031102,'大润发'),(32031103,'段庄广场'),(32031104,'风化街'),(32031105,'风华园'),(32031106,'凤鸣路'),(32031107,'贵邦财富大厦'),(32031108,'猴山窝'),(32031109,'淮海西路'),(32031110,'淮西客运站'),(32031111,'淮西新一街'),(32031112,'黄河南路'),(32031113,'夹河街东'),(32031114,'建国西路'),(32031115,'交通银行'),(32031116,'快哉亭公园'),(32031117,'矿业大学'),(32031118,'奎园西门'),(32031119,'民主南路'),(32031120,'南段风景区'),(32031121,'欧洲商城'),(32031122,'青年路东'),(32031123,'泉山森林公园'),(32031124,'四院'),(32031125,'香港名店街'),(32031126,'小康人家'),(32031127,'西苑'),(32031128,'易初爱莲'),(32031129,'永安广场财经学校'),(32031130,'云龙公园西'),(32031131,'云龙湖风景区'),(32031132,'中山南路'),(32031133,'其他'),(32032301,'铜山新区'),(32032302,'其他'),(32038401,'春光路'),(32038402,'凤凰路'),(32038403,'火车站'),(32038404,'临春'),(32038405,'临春河'),(32038406,'绿地商务城'),(32038407,'人才家园'),(32038408,'商品街'),(32038409,'祥瑞路'),(32038410,'下洋田'),(32038411,'月川路'),(32038412,'月川中路'),(32038413,'其他'),(32040201,'北环路'),(32040202,'朝阳'),(32040203,'翠竹'),(32040204,'红梅'),(32040205,'兰陵'),(32040206,'丽华'),(32040207,'清凉'),(32040208,'青龙'),(32040209,'青山湾'),(32040210,'文化宫'),(32040211,'中凉'),(32040212,'其他'),(32040401,'怀德路'),(32040402,'花园'),(32040403,'荆川公园'),(32040404,'莱蒙都会'),(32040405,'清枫公园'),(32040407,'西林'),(32040408,'新闸'),(32040409,'西新桥'),(32040410,'其他'),(32040411,'南大街'),(32040412,'北大街'),(32040413,'广化桥'),(32040414,'勤业'),(32040501,'剑湖'),(32040502,'潞城'),(32040503,'河苑'),(32040504,'戚大街'),(32040505,'圩墩'),(32040506,'区政府'),(32040507,'东方大道'),(32040508,'其他'),(32041101,'飞龙路'),(32041102,'恐龙园'),(32041103,'龙虎塘'),(32041104,'市政府'),(32041105,'万达'),(32041106,'新龙'),(32041107,'新桥'),(32041108,'新区公园'),(32041109,'薛家'),(32041110,'其他'),(32041111,'百丈'),(32041112,'小河'),(32041201,'大学城'),(32041202,'高新区'),(32041203,'横林镇'),(32041204,'横山桥'),(32041205,'滆湖'),(32041206,'花园街'),(32041207,'湖塘'),(32041208,'湖塘乐购'),(32041209,'马杭'),(32041210,'马杭里'),(32041211,'西太湖'),(32041212,'遥观'),(32041213,'邹区'),(32041214,'其他'),(32041215,'淹城'),(32050201,'双塔'),(32050202,'南门'),(32050203,'胥江'),(32050204,'吴门桥'),(32050205,'葑门'),(32050206,'友新'),(32050207,'沧浪周边'),(32050301,'平江'),(32050302,'桃花坞'),(32050303,'城北'),(32050304,'娄门'),(32050305,'观前'),(32050306,'苏锦'),(32050307,'平江周边'),(32050401,'石路'),(32050402,'虎丘'),(32050403,'彩香'),(32050404,'留园'),(32050405,'白洋湾'),(32050406,'金阊'),(32050601,'苏苑'),(32050602,'长桥'),(32050603,'龙西'),(32050604,'城南'),(32050605,'越溪'),(32050606,'横泾'),(32050607,'郭巷'),(32050608,'香山'),(32050609,'木渎'),(32050610,'开发区'),(32050611,'甪直'),(32050612,'胥口'),(32050613,'临湖'),(32050614,'东山'),(32050615,'西山'),(32050616,'光福'),(32050701,'元和'),(32050702,'太平'),(32050703,'黄桥'),(32050704,'北桥'),(32050705,'陆慕'),(32050706,'开发区'),(32050707,'渭塘'),(32050708,'阳澄湖'),(32050709,'黄埭'),(32050710,'望亭'),(32050711,'相城周边'),(32050801,'横塘'),(32050802,'狮山'),(32050803,'枫桥镇'),(32050804,'镇湖'),(32050805,'湖浒墅关'),(32050806,'通安'),(32050807,'东渚'),(32050808,'阳山'),(32050809,'科技城'),(32050810,'虎丘周边'),(32050901,'娄葑'),(32050902,'唯亭'),(32050903,'胜浦'),(32050904,'东环路'),(32050905,'湖东'),(32050906,'湖西'),(32050907,'独墅湖'),(32050908,'青剑湖'),(32050909,'斜塘'),(32058301,'玉山'),(32058302,'巴城'),(32058303,'周市'),(32058304,'陆家'),(32058305,'花桥'),(32058306,'淀山湖'),(32058307,'张浦'),(32058308,'周庄'),(32058309,'千灯'),(32058310,'锦溪'),(32058401,'松陵'),(32058402,'盛泽'),(32058403,'同里'),(32058404,'汾湖'),(32058405,'平望'),(32058406,'横扇'),(32058407,'七都'),(32058408,'震泽'),(32058409,'桃源'),(32060201,'城东板块'),(32060202,'城南板块'),(32060203,'城西板块'),(32060204,'城北板块'),(32060205,'观音山板块'),(32060206,'狼山版块'),(32060207,'市中心'),(32060208,'其他'),(32061101,'唐闸版块'),(32061102,'永兴版块'),(32061103,'其他'),(32068501,'小海版块'),(32068502,'乡镇版块'),(32083301,'海口路'),(32083302,'深圳路'),(32100201,'东关街'),(32100202,'个园'),(32100203,'荷花池'),(32100204,'何园'),(32100205,'江阳东路'),(32100206,'汽车东站'),(32100207,'时代广场'),(32100208,'文昌阁'),(32100209,'文昌广场'),(32100210,'文昌中路'),(32100211,'毓贤街'),(32100212,'竹西公园'),(32100213,'茱萸湾'),(32100214,'1912酒吧街'),(32100215,'其他'),(32100301,'汊河镇'),(32100302,'邗江中路'),(32100303,'槐泗镇'),(32100304,'汇金谷'),(32100305,'江阳中路'),(32100306,'来鹤台广场'),(32100307,'六圩乡'),(32100308,'明月湖'),(32100309,'汽车西站'),(32100310,'润扬广场'),(32100311,'润扬湿地'),(32100312,'蜀岗西峰'),(32100313,'宋夹城'),(32100314,'兴城西路'),(32101101,'市政府'),(32101102,'友谊广场'),(32101103,'四望亭路'),(32101104,'瘦西湖'),(32101105,'扬州大学'),(32101106,'其他'),(32108801,'江都汽车站'),(32108802,'江都商城'),(32108803,'金三元广场'),(32108804,'龙城路'),(32108805,'龙川广场'),(32108806,'龙川街'),(32108807,'泰山路'),(32108808,'仙城北路'),(32108809,'仙女镇'),(32108810,'其他'),(33010201,'湖滨街道'),(33010202,'小营街道'),(33010203,'清波街道'),(33010204,'紫阳街道'),(33010205,'望江街道'),(33010206,'南星街道'),(33010207,'复兴'),(33010208,'吴山'),(33010209,'其他'),(33010301,'长庆街道'),(33010302,'武林街道'),(33010303,'天水街道'),(33010304,'艮山'),(33010305,'潮鸣街道'),(33010306,'朝晖街道'),(33010307,'石桥街道'),(33010308,'东新街道'),(33010309,'三塘'),(33010310,'宝善'),(33010311,'庆春'),(33010401,'凯旋'),(33010402,'采荷'),(33010403,'闸弄口'),(33010404,'四季青'),(33010405,'白杨'),(33010406,'笕桥'),(33010407,'景芳'),(33010408,'钱江新城'),(33010409,'三里亭'),(33010410,'三堡'),(33010411,'五堡'),(33010412,'彭埠'),(33010413,'下沙'),(33010414,'九堡'),(33010415,'丁桥'),(33010416,'金沙湖'),(33010417,'下沙沿江'),(33010418,'其他'),(33010501,'米市巷'),(33010502,'湖墅'),(33010503,'小河'),(33010504,'和睦'),(33010505,'拱宸桥'),(33010506,'大关'),(33010507,'德胜'),(33010508,'半山'),(33010509,'余杭塘上'),(33010510,'香积寺路'),(33010511,'密渡桥路'),(33010512,'石祥路'),(33010513,'莫干山路'),(33010514,'其他'),(33010601,'北山'),(33010602,'灵隐'),(33010603,'西湖'),(33010604,'西溪'),(33010605,'翠苑'),(33010606,'文新'),(33010607,'古荡'),(33010608,'文一路'),(33010609,'文二路'),(33010610,'文三路'),(33010611,'申花'),(33010612,'蒋村'),(33010613,'留下'),(33010614,'三墩'),(33010615,'转塘'),(33010616,'古墩'),(33010617,'其他'),(33010801,'西兴'),(33010802,'长河'),(33010803,'浦沿'),(33010901,'城厢'),(33010902,'北干'),(33010903,'蜀山'),(33010904,'新塘'),(33010905,'闻堰'),(33010906,'湘湖'),(33010907,'钱江世纪城'),(33010908,'其他'),(33011001,'临平'),(33011002,'乔司'),(33011003,'南苑'),(33011004,'星桥'),(33011005,'老余杭'),(33011006,'良渚'),(33011007,'闲林'),(33011008,'瓶窑'),(33011009,'仁和'),(33011010,'塘栖'),(33011011,'其他'),(33012201,'桐君街道'),(33012202,'旧县街道'),(33012203,'富春江镇'),(33012204,'横村镇'),(33012205,'分水镇'),(33012206,'江南镇'),(33012207,'瑶琳镇'),(33012208,'凤川街道'),(33012209,'百江镇'),(33012210,'城南街道'),(33012211,'钟山乡'),(33012212,'新合乡'),(33012213,'合村乡'),(33012214,'莪山畲族乡'),(33012701,'千岛湖'),(33012702,'临岐'),(33012703,'威坪'),(33012704,'姜家'),(33012705,'汾口'),(33012706,'石林'),(33012707,'大墅'),(33012708,'唐村'),(33012709,'梓桐'),(33012710,'中洲'),(33012711,'文昌'),(33012712,'枫树岭'),(33018201,'新安江'),(33018202,'更楼'),(33018203,'洋溪'),(33018301,'富春'),(33018302,'春江'),(33018303,'东洲'),(33018304,'鹿山'),(33018501,'锦城街道'),(33018502,'青山湖街道'),(33018503,'玲珑街道'),(33018504,'锦南街道'),(33018505,'锦北街道'),(33018506,'板桥镇'),(33018507,'高虹镇'),(33018508,'太湖源镇'),(33018509,'於潜镇'),(33018510,'天目山镇'),(33018511,'太阳镇'),(33018512,'潜川镇'),(33018513,'昌化镇'),(33018514,'龙岗镇'),(33018515,'河桥镇'),(33018516,'湍口镇'),(33018517,'清凉峰镇'),(33018518,'岛石镇'),(33018519,'其他'),(33018601,'舟山'),(33018602,'金华'),(33018603,'东阳'),(33018604,'横店'),(33018605,'海宁'),(33018607,'嘉兴'),(33018608,'嘉善'),(33018609,'义乌'),(33020301,'灵塔'),(33020302,'月湖'),(33020303,'鼓楼'),(33020304,'南门'),(33020305,'西门'),(33020306,'白云'),(33020307,'段塘'),(33020308,'望春'),(33020309,'灵桥'),(33020310,'马园'),(33020311,'翠柏路'),(33020312,'江厦'),(33020313,'高塘'),(33020314,'联丰路'),(33020315,'南苑街'),(33020316,'青林湾'),(33020317,'天一广场'),(33020318,'中山广场'),(33020319,'中山西路'),(33020320,'文教'),(33020321,'柳汀桥'),(33020322,'翠柏'),(33020323,'联丰'),(33020324,'火车南站'),(33020325,'其他'),(33020401,'百丈'),(33020402,'福明'),(33020403,'东柳'),(33020404,'东胜'),(33020405,'明楼'),(33020406,'东郊'),(33020407,'白鹤'),(33020408,'彩虹路'),(33020409,'宁波东站'),(33020410,'贺丞路'),(33020411,'江东科技园区'),(33020412,'曙光路'),(33020413,'天伦广场'),(33020414,'体育馆'),(33020415,'东部新城'),(33020416,'其他'),(33020501,'中马'),(33020502,'白沙'),(33020503,'孔浦'),(33020504,'文教'),(33020505,'甬江'),(33020506,'庄桥'),(33020507,'洪塘'),(33020508,'大庆南路'),(33020509,'大庆北路'),(33020510,'慈城'),(33020511,'日湖公园'),(33020512,'双东坊'),(33020513,'万达广场'),(33020514,'宁波大学'),(33020515,'其他'),(33020601,'新碶'),(33020602,'大碶'),(33020603,'小港'),(33020604,'霞浦'),(33020605,'柴桥'),(33020606,'大榭'),(33020607,'新矸'),(33020608,'白峰镇'),(33020609,'春晓镇'),(33020610,'梅山乡'),(33020611,'其他'),(33021101,'招宝山'),(33021102,'蛟川'),(33021103,'庄市'),(33021104,'骆驼'),(33021105,'澥浦'),(33021106,'九龙湖'),(33021107,'其他'),(33021201,'钟公庙'),(33021202,'下应'),(33021203,'石碶'),(33021204,'梅墟'),(33021205,'东钱湖'),(33021206,'首南'),(33021207,'中河'),(33021208,'宋诏桥'),(33021209,'南部商务区'),(33021210,'轻纺城'),(33021211,'潘火'),(33021212,'咸祥镇'),(33021213,'邱隘镇'),(33021214,'五乡镇'),(33021215,'云龙镇'),(33021216,'横溪镇'),(33021217,'姜山镇'),(33021218,'古林镇'),(33021219,'横街镇'),(33021220,'鄞江镇'),(33021221,'章水镇'),(33021222,'瞻岐镇'),(33021223,'东吴镇'),(33021224,'高桥镇'),(33021225,'塘溪镇'),(33021226,'洞桥镇'),(33021227,'集市港镇'),(33021228,'龙观乡'),(33021229,'其他'),(33021230,'万达广场'),(33022501,'丹东'),(33022502,'丹西'),(33022503,'爵溪'),(33022504,'其他'),(33022601,'跃龙'),(33022602,'桃源'),(33022603,'梅林'),(33022604,'桥头胡'),(33022605,'其他'),(33028101,'东北'),(33028102,'西北'),(33028103,'东南'),(33028104,'西南'),(33028105,'朗霞'),(33028106,'低塘'),(33028107,'其他'),(33028201,'浒山'),(33028202,'宗汉'),(33028203,'坎墩'),(33028204,'观城'),(33028205,'其他'),(33028301,'锦屏'),(33028302,'岳林'),(33028303,'江口'),(33028304,'西坞'),(33028305,'萧王庙'),(33028306,'其他'),(33028401,'其他'),(33030201,'火车站'),(33030202,'第一桥'),(33030203,'上陡门'),(33030204,'广化'),(33030205,'信河街'),(33030206,'洪殿'),(33030207,'黄龙'),(33030208,'江滨'),(33030209,'灰桥'),(33030210,'矮凳桥'),(33030211,'黎明'),(33030212,'临江'),(33030213,'鹿城周边'),(33030214,'欧洲城'),(33030215,'南门'),(33030216,'南浦'),(33030217,'葡萄鹏'),(33030218,'蒲鞋市'),(33030219,'七都'),(33030220,'灰桥'),(33030221,'双屿'),(33030222,'水心'),(33030223,'府前街'),(33030224,'藤桥'),(33030225,'五马街'),(33030226,'下吕浦'),(33030228,'交行广场'),(33030229,'绣山'),(33030230,'其他'),(33030231,'新城'),(33030232,'上吕浦'),(33030301,'滨海'),(33030302,'海城（梅头）'),(33030303,'灵昆'),(33030304,'龙湾周边'),(33030305,'蒲州'),(33030306,'沙城'),(33030307,'天河'),(33030308,'瑶溪'),(33030309,'永兴'),(33030310,'永中'),(33030311,'状元'),(33030312,'永强'),(33030313,'汤家桥'),(33030401,'茶山'),(33030402,'郭溪'),(33030403,'景山'),(33030404,'娄桥'),(33030405,'南白象'),(33030406,'瓯海周边'),(33030407,'潘桥'),(33030408,'瞿溪'),(33030409,'三垟'),(33030410,'梧田'),(33030411,'仙岩'),(33030412,'泽雅'),(33030413,'丽岙'),(33030414,'新桥'),(33030415,'将军桥'),(33030416,'蟠凤'),(33030417,'葡萄棚'),(33032201,'北岙'),(33032202,'大门'),(33032203,'东屏'),(33032204,'元觉'),(33032205,'霓屿'),(33032206,'鹿西'),(33032207,'洞头周边'),(33032401,'碧莲镇'),(33032402,'大箬岩镇'),(33032403,'枫林'),(33032404,'瓯北镇'),(33032405,'桥头镇'),(33032406,'桥下镇'),(33032407,'上塘镇'),(33032408,'沙头镇'),(33032409,'乌牛镇'),(33032410,'巽宅镇'),(33032411,'岩坦镇'),(33032412,'岩头镇'),(33032413,'永嘉周边'),(33032415,'徐岙乡'),(33032416,'西溪乡'),(33032417,'下寮乡'),(33032418,'陡门乡'),(33032419,'花坦乡'),(33032420,'渠口乡'),(33032421,'茗岙乡'),(33032422,'昆阳乡'),(33032423,'石染乡'),(33032424,'界坑乡'),(33032425,'溪下乡'),(33032426,'西岙乡'),(33032427,'大岙乡'),(33032428,'山坑乡'),(33032429,'应坑乡'),(33032430,'五乡'),(33032431,'表山乡'),(33032432,'东皋乡'),(33032433,'鹤盛乡'),(33032434,'西源乡'),(33032435,'岭头乡'),(33032436,'溪口乡'),(33032437,'鲤溪乡'),(33032438,'张溪乡'),(33032439,'黄南乡'),(33032440,'潘坑乡'),(33032601,'鳌江'),(33032602,'凤卧'),(33032603,'鹤溪'),(33032604,'昆阳'),(33032605,'麻步'),(33032606,'南麂'),(33032607,'南雁'),(33032608,'平阳周边'),(33032609,'钱仓'),(33032610,'山门'),(33032611,'水头'),(33032612,'顺溪'),(33032613,'宋埠'),(33032614,'宋桥'),(33032615,'腾蛟'),(33032616,'萧江'),(33032617,'榆垟'),(33032618,'郑楼'),(33032619,'西湾'),(33032620,'梅溪'),(33032621,'梅源'),(33032622,'凤巢'),(33032623,'龙尾'),(33032624,'南湖'),(33032625,'朝阳'),(33032626,'闹村'),(33032627,'晓坑'),(33032628,'怀溪'),(33032629,'青街'),(33032630,'维新'),(33032631,'吴垟'),(33032701,'苍南周边'),(33032702,'舥艚镇'),(33032703,'赤溪镇'),(33032704,'大渔镇'),(33032705,'矾山镇'),(33032706,'观美镇'),(33032707,'金乡镇'),(33032708,'莒溪镇'),(33032709,'灵溪镇'),(33032710,'龙港镇'),(33032711,'芦浦镇'),(33032712,'马站镇'),(33032713,'南宋镇'),(33032714,'钱库镇'),(33032715,'桥墩镇'),(33032716,'望里镇'),(33032717,'霞关镇'),(33032718,'沿浦镇'),(33032719,'炎亭镇'),(33032720,'宜山镇'),(33032721,'藻溪镇'),(33032722,'凤池乡'),(33032723,'浦亭乡'),(33032724,'腾垟乡'),(33032725,'云岩乡'),(33032726,'仙居乡'),(33032727,'新安乡'),(33032728,'括山乡'),(33032729,'五凤乡'),(33032730,'石坪乡'),(33032731,'龙沙乡'),(33032732,'昌禅乡'),(33032733,'中墩乡'),(33032734,'渔寮乡'),(33032735,'蒲城乡'),(33032736,'凤阳畲族乡'),(33032737,'岱岭畲族乡'),(33032801,'大峃'),(33032802,'珊溪'),(33032803,'玉壶'),(33032804,'南田'),(33032805,'黄坦'),(33032806,'巨屿'),(33032807,'百丈漈'),(33032808,'西坑畲族'),(33032809,'文成周边'),(33032901,'百丈'),(33032902,'龟湖'),(33032903,'罗阳'),(33032904,'彭溪'),(33032905,'三魁'),(33032906,'仕阳'),(33032907,'司前畲族'),(33032908,'泗溪'),(33032909,'泰顺周边'),(33032910,'西旸'),(33032911,'筱村'),(33032912,'雅阳'),(33038101,'安阳'),(33038102,'碧山'),(33038103,'曹村'),(33038104,'东山'),(33038105,'飞云'),(33038106,'湖岭'),(33038107,'锦湖'),(33038108,'龙湖'),(33038109,'马屿'),(33038110,'潘岱'),(33038111,'平阳坑'),(33038112,'瑞安周边'),(33038113,'上望'),(33038114,'莘塍'),(33038115,'塘下'),(33038116,'陶山'),(33038117,'汀田'),(33038118,'仙降'),(33038119,'玉海'),(33038201,'白石'),(33038202,'北白象'),(33038203,'大荆'),(33038204,'淡溪'),(33038205,'虹桥'),(33038206,'黄华'),(33038207,'乐成'),(33038208,'乐清周边'),(33038209,'柳市'),(33038210,'南塘'),(33038211,'南岳'),(33038212,'磐石'),(33038213,'蒲岐'),(33038214,'七里港'),(33038215,'清江'),(33038216,'石帆'),(33038217,'翁垟'),(33038218,'象阳'),(33038219,'仙溪'),(33038220,'雁荡'),(33038221,'芙蓉'),(33038222,'湖雾'),(33040201,'城南'),(33040202,'东栅'),(33040203,'府南花园'),(33040204,'建设'),(33040205,'嘉兴火车站'),(33040206,'嘉兴一中'),(33040207,'解放'),(33040208,'梅湾老街'),(33040209,'南湖'),(33040210,'南湖风景区'),(33040211,'南湖区政府'),(33040212,'人民公园'),(33040213,'新嘉'),(33040214,'新兴'),(33040215,'植物园'),(33040216,'其他'),(33041101,'长虹桥'),(33041102,'高照'),(33041103,'嘉北'),(33041104,'江南摩尔'),(33041105,'能仁寺'),(33041106,'塘汇'),(33041107,'新城'),(33041108,'新塍镇'),(33041109,'秀洲公园'),(33041110,'其他'),(33048101,'海宁潮'),(33048102,'钱塘江北岸'),(33048103,'盐官古城'),(33048104,'西山公园'),(33048105,'其他'),(33048201,'九龙山海滨浴场'),(33048202,'东湖景区'),(33048203,'莫氏庄园'),(33048204,'其他'),(33048301,'乌镇'),(33048302,'博物馆'),(33048303,'东栅'),(33048304,'西栅'),(33048305,'桐乡市区'),(33048306,'濮院'),(33048307,'其他'),(33120901,'上溪'),(33120902,'义亭'),(33120903,'佛堂'),(33120904,'赤岸'),(33120905,'苏溪'),(33120906,'大陈'),(34010201,'七里站'),(34010202,'铜陵路'),(34010203,'三里街'),(34010204,'车站'),(34010205,'明光路'),(34010206,'胜利路'),(34010207,'大通路'),(34010208,'和平路'),(34010209,'红光'),(34010210,'合家福购物街'),(34010211,'城东'),(34010212,'七里塘'),(34010213,'长淮'),(34010214,'方庙'),(34010215,'长江批发市场'),(34010216,'和平广场'),(34010217,'花冲公园'),(34010218,'临泉东路'),(34010301,'海棠'),(34010302,'寿春'),(34010303,'逍遥津'),(34010304,'杏林'),(34010305,'光明'),(34010306,'白水坝'),(34010307,'安庆路'),(34010308,'百花井'),(34010309,'双岗'),(34010310,'市府广场'),(34010311,'城隍庙'),(34010312,'财富广场'),(34010313,'益民'),(34010314,'和煦园'),(34010315,'亳州路'),(34010316,'三牌楼'),(34010317,'鼓楼'),(34010318,'杏花村'),(34010319,'三孝口'),(34010320,'四牌楼'),(34010401,'琥珀山庄'),(34010402,'三里庵'),(34010403,'五里墩'),(34010404,'西园新村'),(34010405,'南七里站'),(34010406,'稻香村'),(34010407,'井岗'),(34010408,'荷叶地'),(34010409,'笔架山'),(34010410,'西站'),(34010411,'安徽大学'),(34010412,'安徽农业大学'),(34010413,'安医附院'),(34010414,'二里街'),(34010415,'黄岳路口'),(34010416,'机研所'),(34010417,'科大西区'),(34010418,'清溪路'),(34010419,'青阳路'),(34010420,'肉联厂'),(34010421,'省农机校'),(34010422,'牙膏厂'),(34010423,'自行车厂'),(34010424,'轴承厂'),(34011101,'常青'),(34011102,'宁国路'),(34011103,'芜湖路'),(34011104,'巢湖路'),(34011105,'骆岗'),(34011106,'义兴'),(34011107,'大圩'),(34011108,'义城'),(34011109,'东陈岗'),(34011110,'葛大店'),(34011111,'合工大'),(34011112,'中铁四局'),(34011113,'南园新村'),(34011114,'省人大'),(34011115,'太宁路口'),(34011116,'望湖城'),(34011117,'卫岗'),(34011118,'五里庙'),(34011119,'周谷堆'),(34012101,'水湖'),(34012102,'杨公'),(34012103,'杨庙'),(34012104,'吴山'),(34012105,'下塘'),(34012106,'双墩'),(34012107,'朱巷'),(34012108,'曹庵'),(34012109,'庄墓'),(34012110,'岗集'),(34012201,'店埠'),(34012202,'龙岗'),(34012203,'撮镇'),(34012204,'龙塘'),(34012205,'桥头集'),(34012206,'古城'),(34012207,'元疃'),(34012208,'六家畈'),(34012209,'西山驿'),(34012210,'长临河'),(34012211,'八斗'),(34012212,'梁园'),(34012213,'白龙'),(34012214,'石塘'),(34012301,'上派'),(34012302,'三河'),(34012303,'花岗'),(34012304,'高刘'),(34012305,'官亭'),(34012306,'小庙'),(34012307,'山南'),(34012308,'丰乐'),(34012309,'桃花'),(34012310,'农兴'),(34012311,'新仓'),(34012901,'巢湖市'),(34012902,'淮南'),(34022501,'宣城'),(35010201,'华大'),(35010202,'鼓东'),(35010203,'鼓西'),(35010204,'南街'),(35010205,'安泰'),(35010206,'东街'),(35010207,'水都'),(35010208,'温泉'),(35010209,'五凤'),(35010210,'洪山'),(35010226,'湖前'),(35010227,'铜盘'),(35010228,'梅峰'),(35010301,'茶亭'),(35010302,'洋中'),(35010303,'苍霞'),(35010306,'义洲'),(35010307,'上海'),(35010308,'瀛洲'),(35010309,'新港'),(35010310,'后洲'),(35010311,'鳌峰'),(35010312,'宁化'),(35010313,'中州岛'),(35010315,'江滨中路'),(35010316,'工业路'),(35010322,'亚峰'),(35010323,'宝龙城市广场'),(35010401,'仓前'),(35010402,'下渡'),(35010403,'临江'),(35010404,'三叉街'),(35010405,'上渡'),(35010406,'对湖'),(35010407,'东升'),(35010408,'金山'),(35010409,'城门'),(35010410,'螺州'),(35010411,'盖山'),(35010412,'建新'),(35010413,'仓山'),(35011101,'茶园'),(35011102,'王庄'),(35011103,'岳峰象园'),(35011105,'鼓山'),(35011106,'新店'),(35011116,'五四北'),(35011117,'五里亭'),(35012101,'上街'),(35012102,'大学城'),(35012103,'博士后购物广场'),(35012104,'甘蔗'),(35012105,'南屿'),(35018101,'街心公园'),(35018102,'好又多'),(35018103,'宏路'),(35018104,'水南'),(35018105,'龙田'),(35018106,'高山'),(35018107,'三山'),(35018108,'江阴'),(35018109,'渔溪'),(35018110,'海口'),(35018201,'金峰'),(35018202,'河下街'),(35018203,'步行街'),(35018204,'郑和路'),(35018205,'人民会堂'),(35018206,'冰心公园'),(35020301,'厦港'),(35020302,'中华'),(35020303,'滨海'),(35020304,'开元'),(35020305,'鹭江'),(35020306,'梧村'),(35020307,'禾祥东'),(35020308,'瑞景'),(35020309,'莲前东'),(35020310,'鼓浪屿'),(35020311,'中山路'),(35020312,'东浦路'),(35020313,'松柏'),(35020314,'湖滨南'),(35020315,'莲坂路'),(35020316,'湖滨东路'),(35020317,'金榜路'),(35020318,'厦禾路'),(35020319,'禾祥西'),(35020320,'滨北'),(35020321,'前埔'),(35020501,'海沧'),(35020502,'霞阳'),(35020503,'沧林路'),(35020504,'新垵'),(35020505,'嵩屿码头'),(35020506,'海富路'),(35020507,'新阳工业区'),(35020508,'钟林路'),(35020509,'沧湖北路'),(35020510,'海浴路'),(35020511,'角美'),(35020512,'西部工业区'),(35020601,'湖里'),(35020602,'殿前'),(35020603,'禾山'),(35020604,'江头'),(35020605,'金尚'),(35020606,'南山路'),(35020607,'乌石浦五路'),(35020608,'康乐'),(35020609,'SM附近'),(35020610,'台湾街'),(35020611,'兴隆路'),(35020612,'东渡'),(35020613,'吕岭路'),(35020614,'金山'),(35020615,'寨上'),(35020616,'林后'),(35020617,'马垅后浦'),(35021101,'集美'),(35021102,'侨英'),(35021103,'杏林'),(35021104,'灌口'),(35021105,'后溪'),(35021106,'杏滨'),(35021107,'浒井'),(35021112,'石鼓路'),(35021114,'孙厝'),(35021115,'嘉庚路'),(35021201,'大同'),(35021202,'祥平'),(35021203,'莲花'),(35021204,'新民镇'),(35021205,'洪塘镇'),(35021206,'西柯'),(35021207,'汀溪'),(35021208,'五显镇'),(35021209,'工业集中区'),(35021210,'城南'),(35021211,'乌涂'),(35021215,'中山路'),(35021218,'小西门'),(35021301,'新店镇'),(35021302,'火炬园'),(35021303,'马巷镇'),(35021304,'内厝镇'),(35021305,'大嶝'),(35050201,'花巷'),(35050202,'南环路'),(35050203,'涂门街'),(35050204,'新门街'),(35050205,'西街'),(35050206,'新华南路'),(35050207,'百源路后城街'),(35050208,'南俊路'),(35050209,'南俊北路'),(35050210,'九一街'),(35050211,'中山路'),(35050212,'江滨路'),(35050213,'凯德广场'),(35050214,'城西路'),(35050215,'百源路'),(35050216,'美食街'),(35050217,'东街口'),(35050218,'打锡街'),(35050219,'东街'),(35050220,'城北路'),(35050221,'泉山路'),(35050222,'西湖街'),(35050223,'北清东路'),(35050224,'爱国路'),(35050225,'崇福路'),(35050226,'学府路'),(35050227,'府学路'),(35050228,'状元街'),(35050229,'北门街'),(35050230,'中山中路'),(35050231,'浮桥街'),(35050232,'义全街'),(35050233,'新府口'),(35050234,'普明街'),(35050235,'天后路'),(35050236,'北门路'),(35050237,'兴贤路'),(35050238,'庄府巷'),(35050239,'海星路'),(35050240,'县后街'),(35050241,'南俊巷'),(35050242,'广灵路'),(35050243,'新华北路'),(35050244,'堤后路'),(35050245,'温陵南路'),(35050246,'温陵北路'),(35050301,'田安北路'),(35050302,'湖心街'),(35050303,'云鹿路'),(35050304,'刺桐西路'),(35050305,'丰泽街'),(35050306,'泉秀街'),(35050307,'温陵北路'),(35050308,'田安中路'),(35050309,'东涂街'),(35050310,'津淮街'),(35050311,'霞淮街'),(35050312,'美食街'),(35050313,'东湖街'),(35050314,'丰迎路'),(35050315,'六灌路'),(35050316,'宝洲路'),(35050317,'东美路'),(35050318,'田安南路'),(35050319,'福田路'),(35050320,'沉州路'),(35050321,'津坂路'),(35050322,'淮秀路'),(35050323,'泉秀路'),(35050324,'前坂街'),(35050325,'圣湖路'),(35050326,'刺桐路'),(35050327,'西湖街'),(35050328,'温陵路'),(35050329,'北清东路'),(35050330,'广电路'),(35050331,'东霞街'),(35050332,'美桐街'),(35050333,'东云路'),(35050334,'宝洲街'),(35050335,'南淮路'),(35050336,'城西路'),(35050337,'祥远路'),(35050338,'通港路'),(35050339,'九一路'),(35050340,'泉山路'),(35050341,'丰海大街'),(35050342,'兰台路'),(35050343,'涂门街'),(35050344,'浔美工业区'),(35050345,'文化宫'),(35050346,'新华北路'),(35050347,'前板路'),(35050348,'堤后路'),(35050349,'后坂街'),(35050350,'刺痛明珠7#店'),(35050351,'刺桐东路'),(35050352,'刺桐北路'),(35050353,'温陵南路'),(35050354,'东海大街'),(35050355,'安吉路'),(35052101,'大红埔'),(35052102,'东南大街'),(35058101,'八七路'),(35058102,'回兴路'),(35058103,'九二路'),(35058104,'子芳路'),(35058105,'长福路'),(35058106,'德辉广场'),(35058201,'阳光路'),(35058202,'和平中路'),(35058203,'帝豪广场'),(35058204,'池店镇'),(35058205,'鞋都路'),(35058206,'和平路'),(35058207,'湖光路'),(35058208,'泉安中路'),(35058209,'江声路'),(35058210,'江滨路'),(35058211,'西江路'),(35058212,'梅岭世纪大道'),(35058213,'沟西'),(35058214,'世纪大道'),(35058215,'青阳阳光时代广场'),(35058216,'永和镇'),(35058217,'东石镇'),(35058218,'陈埭镇'),(35058219,'西滨'),(35058220,'洋埭'),(35058221,'星光路'),(35058222,'新华街'),(35058223,'紫帽镇'),(35058224,'内坑镇'),(35058225,'磁灶镇'),(35058226,'金井镇'),(35058227,'英林镇'),(35058228,'安海镇'),(35058301,'溪美环西路'),(35058302,'长安街'),(35058303,'新华街'),(35058304,'金庄街'),(35058305,'光前路'),(35058306,'中山街'),(35058307,'成功街'),(35058308,'水头'),(35058309,'官桥'),(36010201,'董家窑'),(36010202,'大院'),(36010203,'公园'),(36010204,'百花洲'),(36010205,'墩子塘'),(36010206,'豫章'),(36010207,'八一桥'),(36010208,'滕王阁'),(36010209,'沙井'),(36010210,'彭家桥'),(36010211,'青山南路'),(36010212,'叠山路'),(36010213,'二七路'),(36010214,'民德路'),(36010215,'南京西路'),(36010216,'三经路'),(36010217,'苏圃路'),(36010218,'象山路'),(36010220,'阳明路'),(36010223,'建德观'),(36010224,'福州路'),(36010227,'胜利路'),(36010228,'洪都北大道'),(36010229,'子固路'),(36010232,'其他'),(36010233,'渊明北路'),(36010301,'绳金塔'),(36010302,'桃源'),(36010303,'朝阳洲'),(36010304,'广润门'),(36010305,'船山路'),(36010306,'西湖'),(36010307,'系马桩'),(36010308,'十字街'),(36010309,'丁公路'),(36010310,'火车站'),(36010311,'孺子路'),(36010312,'老福山'),(36010313,'北京西路'),(36010315,'抚河北路'),(36010316,'广场南路'),(36010317,'洪城路'),(36010318,'建设路'),(36010320,'永叔路'),(36010322,'站前路'),(36010324,'八一大道'),(36010328,'珠宝街'),(36010335,'井冈山大道'),(36010336,'南浦路'),(36010338,'其他'),(36010401,'三家店'),(36010402,'洪都'),(36010403,'京山'),(36010404,'岱山'),(36010405,'迎宾大道'),(36010406,'广州路'),(36010407,'徐家坊'),(36010408,'解放西路'),(36010409,'麻坊'),(36010410,'象湖'),(36010411,'将军渡'),(36010412,'包家花园'),(36010413,'洪都南大道'),(36010414,'解放东路'),(36010416,'其他'),(36010501,'站前'),(36010502,'幸福'),(36010503,'其他'),(36010504,'梅岭'),(36011101,'青山路'),(36011102,'上海路'),(36011103,'京东'),(36011104,'顺外路'),(36011105,'青山湖大道'),(36011106,'罗家'),(36011107,'蛟桥'),(36011108,'扬子洲'),(36011109,'北京东路'),(36011110,'湖坊'),(36011111,'洪都中大道'),(36011112,'塘山'),(36011113,'江大南路'),(36011114,'洪都大道'),(36011115,'南京东路'),(36011117,'文教路'),(36011119,'高新大道'),(36011121,'师大南路'),(36011123,'其他'),(36011201,'怡园路'),(36011202,'翠苑路'),(36011203,'丰和中大道'),(36011204,'凤凰中大道'),(36011207,'赣江北大道'),(36011208,'前湖南昌大学'),(36011213,'绿茵路'),(36011215,'红谷中大道'),(36011216,'会展路'),(36011218,'学府大道'),(36011219,'红角洲'),(36011220,'赣江南大道'),(36011301,'上罗'),(36011302,'榴云路'),(36011303,'玉屏东大街'),(36011304,'下罗'),(36011305,'丰林东大道'),(36011306,'紫荆路'),(36011307,'枫林大道'),(36011501,'创新一路'),(36011502,'艾溪湖'),(36011503,'瑶湖商业街'),(36011504,'紫阳大道'),(36012101,'莲塘'),(36012102,'向塘'),(36012103,'三江'),(36012104,'广福'),(36012105,'冈上'),(36012106,'武阳'),(36012107,'幽兰'),(36012108,'塘南'),(36012109,'麻丘'),(36012110,'昌东'),(36012111,'蒋巷'),(36012201,'长凌'),(36012202,'望城'),(36012203,'西山'),(36012204,'生米'),(36012205,'石岗'),(36012206,'乐化'),(36012207,'七里岗'),(36012208,'樵舍'),(36012209,'溪霞'),(36012210,'象山'),(36012211,'解放路'),(36012212,'长征西路'),(36012213,'兴华路'),(36012214,'长堎'),(36012215,'石埠镇'),(36012216,'广兰大道'),(36012301,'松湖'),(36012302,'龙津'),(36012303,'鼎湖'),(36012304,'黄洲'),(36012305,'长埠'),(36012306,'石鼻'),(36012307,'东阳'),(36012308,'万埠'),(36012401,'民和'),(36012402,'梅庄'),(36012403,'李渡'),(36012404,'文港'),(36012405,'温圳'),(36012406,'张公'),(36012407,'罗溪'),(36012408,'架桥'),(36012409,'前坊'),(36070201,'八一四大道'),(36070202,'长征大道'),(36070203,'东郊路'),(36070204,'东桥路'),(36070205,'赣江路'),(36070206,'赣江源大道'),(36070207,'红旗大道'),(36070208,'厚德路'),(36070209,'华坚路'),(36070210,'黄屋坪路'),(36070211,'金丰路'),(36070212,'金星路'),(36070213,'南河路'),(36070214,'青年路'),(36070215,'三康庙'),(36070216,'文明大道'),(36070217,'文清路'),(36070218,'西津路'),(36070219,'杨公路'),(36070220,'赞贤路'),(36070221,'章江北大道'),(36070222,'张家围'),(36070223,'中央公园'),(36078301,'长征大道'),(36078302,'兴国路'),(36078303,'赞贤路'),(36078304,'章江南大道'),(36078401,'金东路'),(36078402,'迎宾大道'),(36078403,'客家大道'),(36078501,'五洲大道'),(36078502,'站前路'),(37010201,'解放路'),(37010202,'大明湖'),(37010203,'趵突泉'),(37010204,'泉城路'),(37010205,'老东门'),(37010206,'东关'),(37010207,'朝山街'),(37010208,'文化东路'),(37010209,'和平路'),(37010210,'环山路'),(37010211,'佛山街'),(37010212,'解放东路'),(37010213,'经十路'),(37010214,'浆水泉路'),(37010215,'泺源大街'),(37010216,'历山路'),(37010217,'旅游路'),(37010218,'山师'),(37010219,'千佛山'),(37010220,'山大南路'),(37010221,'文化西路'),(37010222,'燕子山路'),(37010223,'甸柳'),(37010224,'趵突泉北路'),(37010225,'东关大街'),(37010226,'姚家'),(37010227,'燕山立交'),(37010228,'花园庄'),(37010229,'山师东路'),(37010230,'解放桥'),(37010231,'泉城公园'),(37010232,'泉城广场'),(37010233,'芙蓉街'),(37010234,'恒隆广场'),(37010235,'其他'),(37010301,'阳光舜城'),(37010302,'杆石桥'),(37010303,'经二路'),(37010304,'馆驿街'),(37010305,'伟东新都'),(37010306,'大观园'),(37010307,'经七路'),(37010308,'岔路街'),(37010309,'林祥南街'),(37010310,'铁路玉函'),(37010311,'王官庄'),(37010312,'建设路'),(37010313,'郎茂山'),(37010314,'二七新村'),(37010315,'英雄山路'),(37010316,'六里山'),(37010317,'七里山'),(37010318,'玉函路'),(37010319,'舜玉路'),(37010320,'舜耕路'),(37010321,'鲁能领秀城'),(37010322,'二环南路'),(37010323,'人民商场'),(37010324,'经一路'),(37010325,'济微路'),(37010326,'十六里河'),(37010327,'万达广场'),(37010328,'市政府'),(37010329,'省体中心'),(37010330,'济南大学'),(37010331,'八一立交桥'),(37010332,'共青团路'),(37010333,'七贤'),(37010334,'八里洼'),(37010335,'其他'),(37010401,'腊山立交桥'),(37010402,'西市场'),(37010404,'振兴街'),(37010405,'营市街'),(37010406,'辛西路北口'),(37010407,'青年公园'),(37010408,'南辛庄'),(37010409,'匡山片区'),(37010410,'张庄路'),(37010412,'美里湖街'),(37010413,'八里桥'),(37010414,'段店'),(37010415,'阳光100'),(37010416,'和谐广场'),(37010417,'高铁西客站'),(37010418,'经十西路'),(37010421,'其他'),(37010422,'刘长山路'),(37010424,'幸福街'),(37010425,'阳光新路'),(37010426,'北小辛庄'),(37010427,'五院'),(37010501,'堤口路'),(37010502,'制锦市'),(37010503,'济洛路'),(37010504,'工人新村'),(37010505,'汽车厂东路'),(37010507,'北坦'),(37010508,'火车站'),(37010509,'汽车总站'),(37010510,'无影山'),(37010511,'缤纷五洲'),(37010512,'北园'),(37010513,'泺口'),(37010514,'北园立交'),(37010515,'标山路'),(37010516,'成丰桥'),(37010517,'无影山北路'),(37010518,'东工商河路'),(37010519,'其他'),(37010521,'济齐路'),(37010523,'水屯路'),(37010524,'历山北路'),(37010525,'明湖北路'),(37010526,'明湖西路'),(37010527,'师范路'),(37010528,'三孔桥'),(37010529,'无影山路'),(37010531,'无影山西路'),(37010534,'生产路'),(37010536,'黄岗路'),(37011201,'山大路'),(37011202,'洪家楼'),(37011203,'东风'),(37011204,'全福'),(37011205,'华龙路'),(37011206,'二环东路'),(37011207,'工业北路'),(37011208,'盖家沟'),(37011209,'花园路'),(37011210,'化纤厂路'),(37011211,'黄台南路'),(37011212,'将军路'),(37011213,'经十东路'),(37011214,'闵子骞路'),(37011215,'华信路'),(37011216,'华山'),(37011217,'七里堡'),(37011218,'七里河'),(37011219,'清河北'),(37011220,'工业南路历城段'),(37011221,'祝甸'),(37011222,'仲宫镇'),(37011223,'王舍人'),(37011224,'小清河'),(37011225,'还乡店'),(37011226,'其他'),(37011227,'荷花路'),(37011228,'十里河'),(37011301,'文昌'),(37011302,'平安'),(37011303,'崮云湖'),(37011304,'五峰山'),(37018201,'奥体中路  '),(37018202,'奥体中心'),(37018203,'大学科技园'),(37018204,'工业北路'),(37018205,'工业南路'),(37018206,'工业南路高新段 '),(37018207,'国际会展中心'),(37018208,'康虹路 '),(37018209,'莱茵小镇'),(37018210,'留学人员创业园'),(37018211,'齐鲁软件园'),(37018212,' 舜华路'),(37018213,'新生活家园'),(37018214,'其他'),(37020201,'八大峡'),(37020202,'台西'),(37020203,'云南路'),(37020204,'中山路'),(37020205,'观海路'),(37020206,'江苏路'),(37020207,'金口路'),(37020208,'八大关'),(37020209,'湛山'),(37020210,'浮山'),(37020211,'珠海路'),(37020212,'南京路'),(37020213,'八大湖'),(37020214,'金门路'),(37020215,'团岛'),(37020216,'香港中路'),(37020217,'辛家庄'),(37020218,'燕儿岛路'),(37020219,'福州南路'),(37020220,'宁夏路'),(37020221,'奥帆基地'),(37020222,'青岛大学'),(37020223,'广电大厦'),(37020224,'东部市立医院'),(37020225,'延安三路'),(37020226,'西镇'),(37020227,'大学路'),(37020228,'大福源'),(37020229,'大尧'),(37020230,'五四广场'),(37020231,'江西路'),(37020232,'东海西路'),(37020233,'澳门路'),(37020234,'银川西路'),(37020235,'绍兴路'),(37020236,'善化路'),(37020237,'闽江路'),(37020238,'海口路'),(37020239,'徐州路'),(37020240,'火车站'),(37020241,'巴黎春天'),(37020301,'冠县路'),(37020302,'胶州路'),(37020303,'热河路'),(37020304,'辽宁路'),(37020305,'黄台路'),(37020306,'华阳路'),(37020307,'登州路'),(37020308,'利津路'),(37020309,'延安路'),(37020310,'威海路'),(37020311,'泰山路'),(37020312,'北仲路'),(37020313,'宁夏路'),(37020314,'敦化路'),(37020315,'辽源路'),(37020316,'合肥路'),(37020317,'大港'),(37020318,'大连路'),(37020319,'四方'),(37020320,'浮山新区'),(37020321,'同安路'),(37020322,'洪山坡'),(37020323,'中央商务区'),(37020324,'山东路家乐福'),(37020325,'延吉路'),(37020326,'镇江路'),(37020327,'错埠岭'),(37020328,'杨家群'),(37020329,'啤酒街'),(37020330,'信息城'),(37020331,'儿童医院'),(37020332,'河马石'),(37020333,'南京路'),(37020334,'福州北路'),(37020335,'台东'),(37020501,'湖岛'),(37020502,'兴隆路'),(37020503,'平安路'),(37020504,'杭州路'),(37020505,'人民路'),(37020506,'瑞昌路'),(37020507,'山东路'),(37020508,'嘉兴路'),(37020509,'阜新路'),(37020510,'海伦路'),(37020511,'鞍山路'),(37020512,'双山'),(37020513,'河西'),(37020514,'水清沟'),(37020515,'开平路'),(37020516,'郑州路'),(37020517,'洛阳路'),(37020518,'嘉定山'),(37020519,'四方长途站'),(37020520,'保儿'),(37020521,'理工大学'),(37020522,'海云庵'),(37020523,'重庆南路'),(37020524,'北岭'),(37020525,'方中圆商业街'),(37020526,'海琴广场'),(37020527,'雁山立交桥'),(37021101,'黄岛'),(37021102,'辛安'),(37021103,'薛家岛'),(37021104,'柳花泊'),(37021105,'长江路'),(37021106,'红石崖'),(37021201,'中韩'),(37021202,'沙子口'),(37021203,'北宅'),(37021204,'王哥庄'),(37021205,'北村'),(37021206,'啤酒城'),(37021207,'山东头'),(37021208,'崂山区政府'),(37021209,'汽车东站'),(37021210,'李山东路'),(37021211,'石老人'),(37021212,'姜戈庄'),(37021213,'麦岛'),(37021214,'海尔路'),(37021215,'松岭路'),(37021216,'颐中体育场'),(37021217,'高科园'),(37021218,'西姜'),(37021219,'香港东路'),(37021220,'仙霞岭路'),(37021221,'深圳路'),(37021222,'云岭路'),(37021301,'李村'),(37021302,'虎山路'),(37021303,'浮山路'),(37021304,'永清路'),(37021305,'振华路'),(37021306,'永安路'),(37021307,'兴华路'),(37021308,'兴城路'),(37021309,'湘潭路楼山'),(37021310,'九水路'),(37021311,'书院路'),(37021312,'金水路'),(37021313,'京口路'),(37021314,'邢台路'),(37021315,'沧口体育场'),(37021316,'青山路'),(37021317,'河南庄'),(37021318,'李村公园'),(37021319,'永平路'),(37021320,'重庆路'),(37021401,'城阳'),(37021402,'惜福'),(37021403,'夏庄'),(37021404,'流亭'),(37021405,'棘洪滩'),(37021406,'上马'),(37021407,'红岛'),(37021408,'河套'),(37021409,'宝龙城市广场'),(37021410,'家佳源'),(37021411,'华城路'),(37021412,'正阳路'),(37021413,'长城路'),(37021414,'杨埠寨'),(37021415,'太阳城'),(37021416,'世纪公园'),(37021417,'国货'),(37021418,'明阳路'),(37021419,'希尔景园'),(37021420,'华仙路'),(37028101,'阜安'),(37028102,'中云'),(37028103,'北关'),(37028104,'南关'),(37028105,'云溪'),(37028201,'环秀'),(37028202,'北安'),(37028203,'通济'),(37028204,'龙山'),(37028205,'潮海'),(37028301,'城关'),(37028302,'同和'),(37028303,'香店'),(37028304,'李园'),(37028401,'珠山'),(37028402,'珠海'),(37028501,'水集'),(37028502,'望城'),(37028503,'周格庄'),(37028504,'韶存庄'),(37060201,'百盛'),(37060202,'白石路文化路'),(37060203,'滨海广场'),(37060204,'大东夼'),(37060205,'大海阳'),(37060206,'东山'),(37060207,'二马路'),(37060208,'凤凰台'),(37060209,'黄务'),(37060210,'环山路'),(37060211,'解放路'),(37060212,'金沟寨'),(37060213,'南大街'),(37060214,'南洪街'),(37060215,'奇山'),(37060216,'上夼'),(37060217,'世回尧'),(37060218,'塔山'),(37060219,'通伸'),(37060220,'向阳'),(37060221,'西海岸'),(37060222,'幸福'),(37060223,'新桥'),(37060224,'毓璜顶'),(37060225,'只楚'),(37060226,'芝罘岛'),(37060227,'其他'),(37061101,'北二路'),(37061102,'北三路'),(37061103,'北四路'),(37061104,'北一路'),(37061105,'福海路'),(37061106,'福山德胜'),(37061107,'福新'),(37061108,'高疃'),(37061109,'古现'),(37061110,'门楼'),(37061111,'清洋'),(37061112,'实验中学'),(37061113,'松霞路'),(37061114,'其他'),(37061201,'照格庄'),(37061202,'邵家'),(37061203,'金龙庄'),(37061204,'七里街'),(37061205,'姜村'),(37061206,'文化路'),(37061207,'其它'),(37061301,'曹家'),(37061302,'迟家'),(37061303,'初家'),(37061304,'二中学区'),(37061305,'黄海城市花园'),(37061306,'南港'),(37061307,'前七夼'),(37061308,'清泉寨'),(37061309,'石沟屯'),(37061310,'午台'),(37061311,'迎春大街商贸城'),(37061312,'其他'),(37068101,'南山'),(37068102,'东海'),(37068103,'新区'),(37068104,'西城区'),(37068105,'东城区'),(37068106,'其他'),(37068801,'德胜'),(37068802,'天地广场'),(37068803,'汽车西站'),(37068804,'昆仑国际大酒店'),(37068805,'其他'),(37069001,'马山寨'),(37070201,'奥体中心'),(37070202,'八九医院'),(37070203,'北宫'),(37070204,'春鸢路'),(37070205,'豪德'),(37070206,'和平路'),(37070207,'火车站'),(37070208,'苗圃'),(37070209,'青年路'),(37070210,'鸢都湖'),(37070211,'于河街办'),(37070212,'中百'),(37070213,'其它'),(37070301,'丰华路'),(37070302,'其它'),(37070401,'穆村'),(37070402,'眉村'),(37070403,'恒安'),(37070404,'坊子新区'),(37070405,'坊子老区'),(37070406,'其它'),(37070501,'白浪河'),(37070502,'东苑'),(37070503,'金融街'),(37070504,'泰华'),(37070505,'潍柴'),(37070506,'苇湾'),(37070507,'潍州路'),(37070508,'新华路'),(37070509,'鸢飞路'),(37070510,'虞河'),(37070511,'早春园'),(37070512,'中上虞'),(37070513,'其他'),(37078301,'文家'),(37078302,'留吕'),(37078303,'台头'),(37078304,'其它'),(37078701,'高新服务广场'),(37078702,'东明中学'),(37078703,'富华'),(37078704,'新市府'),(37078705,'其他'),(37078901,'锦绣小学'),(37078902,'管委会'),(37100201,'大福源'),(37100202,'大世界'),(37100203,'合庆'),(37100204,'环翠楼'),(37100205,'江家寨'),(37100206,'老车站'),(37100207,'南大桥'),(37100208,'南竹岛'),(37100209,'青岛路'),(37100210,'世昌大道'),(37100211,'市中心'),(37100212,'孙家疃'),(37100213,'塔山'),(37100214,'温泉'),(37100215,'小商品市场'),(37100216,'西门'),(37100217,'羊亭'),(37100218,'寨子'),(37100219,'张村'),(37100220,'其他'),(37108101,'南海金滩'),(37108102,'苘山'),(37108103,'市区'),(37108104,'其他'),(37108201,'港西'),(37108202,'石岛'),(37108203,'市区'),(37108204,'虎山镇'),(37108205,'人和镇'),(37108206,'大疃镇'),(37108301,'银滩'),(37108302,'其他'),(37108401,'初村'),(37108402,'帝王宫'),(37108403,'东涝台'),(37108404,'国际海水浴场'),(37108405,'哈工大'),(37108406,'后峰西'),(37108407,'火炬大厦'),(37108408,'金海湾'),(37108409,'利群'),(37108410,'钦村'),(37108411,'山大'),(37108412,'田村'),(37108413,'西涝台'),(37108414,'新闻大厦'),(37108415,'其他'),(37108501,'长峰'),(37108502,'凤林'),(37108503,'蒿泊'),(37108504,'皇冠'),(37108505,'南曲阜'),(37108506,'汽车站'),(37108507,'宋家洼'),(37108508,'天冬'),(37108509,'威海公园'),(37108510,'新港'),(37108511,'杨家滩'),(37108512,'其他'),(37130201,'奥尔诺财富中心'),(37130202,'北园路'),(37130203,'滨河路'),(37130204,'成才路'),(37130205,'凤凰广场'),(37130206,'工业大道'),(37130207,'和谐广场'),(37130208,'红旗路'),(37130209,'火车站'),(37130210,'解放路'),(37130211,'金雀山路'),(37130212,'开元上城'),(37130213,'琅琊王路'),(37130214,'兰山'),(37130215,'兰山小区'),(37130216,'兰田步行街'),(37130217,'老市委'),(37130218,'临沂大学'),(37130219,'临沂九中'),(37130220,'美多现代城'),(37130221,'蒙山大道'),(37130222,'苗庄小区'),(37130223,'前十街'),(37130224,'人民公园'),(37130225,'人民广场'),(37130226,'人民医院'),(37130227,'书法广场'),(37130228,'涑河街'),(37130229,'陶然路'),(37130230,'通达路'),(37130231,'王羲之故居'),(37130232,'小埠东'),(37130233,'新汽车站'),(37130234,'新闻大厦'),(37130235,'怡景丽家'),(37130236,'沂蒙路'),(37130237,'银雀山路'),(37130238,'沂州路'),(37130239,'医专附属医院'),(37130240,'其他'),(41010201,'建设路'),(41010202,'汝河路'),(41010203,'棉纺路'),(41010204,'绿东村'),(41010205,'秦岭路'),(41010206,'林山寨'),(41010207,'三官庙'),(41010208,'桐柏路'),(41010209,'华山路'),(41010210,'冯庄'),(41010212,'西站'),(41010213,'齐礼阎'),(41010215,'碧沙岗'),(41010216,'帝湖'),(41010217,'淮河西路'),(41010218,'凯旋门'),(41010219,'陇海西路'),(41010220,'石佛镇'),(41010221,'柿园'),(41010222,'嵩山北路'),(41010223,'文化宫路'),(41010224,'五龙口'),(41010225,'伊河路'),(41010226,'中原西路'),(41010227,'航海西路'),(41010229,'淮河路'),(41010230,'嵩山路'),(41010231,'其他'),(41010301,'大学路'),(41010302,'五里堡'),(41010303,'一马路'),(41010304,'解放路'),(41010305,'德化街'),(41010306,'铭功路'),(41010307,'建中街'),(41010308,'福华街'),(41010309,'蜜蜂张'),(41010310,'汝河西路'),(41010311,'长江路'),(41010312,'二七广场'),(41010313,'淮河路'),(41010314,'火车站'),(41010315,'老代庄'),(41010316,'庆丰街'),(41010317,'冉屯路'),(41010318,'嵩山路'),(41010319,'京广路'),(41010320,'金水路'),(41010321,'其他'),(41010322,'二七路'),(41010401,'经八路'),(41010402,'北下街'),(41010403,'南关'),(41010404,'花园路'),(41010405,'陇海马路'),(41010406,'城东路'),(41010407,'二里岗'),(41010408,'东开发区'),(41010409,'东大街'),(41010410,'东明路南段'),(41010411,'东太康路'),(41010412,'东站片'),(41010413,'管城区委'),(41010414,'商城路'),(41010415,'西大街'),(41010416,'郑汴路'),(41010417,'紫荆山路'),(41010418,'陇海东路'),(41010419,'航海东路'),(41010420,'管南片'),(41010421,'商代遗址'),(41010422,'中州大道'),(41010424,'其他'),(41010501,'花园路'),(41010502,'南阳路'),(41010503,'纬二路'),(41010504,'文化路'),(41010505,'未来路'),(41010506,'红专路'),(41010507,'国基路'),(41010508,'柳林'),(41010509,'英协路'),(41010510,'优胜路'),(41010511,'顺河路'),(41010512,'大石桥'),(41010513,'燕庄'),(41010514,'其他'),(41010515,'北环'),(41010516,'光明路'),(41010517,'陈寨'),(41010518,'东风路'),(41010519,'东紫东路'),(41010521,'丰产路'),(41010522,'丰庆路'),(41010526,'经五路'),(41010528,'农业路'),(41010529,'沙口路'),(41010530,'沙门'),(41010533,'徐寨'),(41010534,'姚寨'),(41010537,'红旗路'),(41010538,'中州大道'),(41010539,'林科路'),(41010542,'纬五路'),(41010546,'政七街'),(41010547,'纬一路'),(41010550,'经八路'),(41010558,'农科路'),(41010559,'丰乐路'),(41010601,'济源路'),(41010602,'矿山'),(41010603,'新安西路'),(41010604,'聂寨'),(41010605,'其他'),(41010801,'老鸦陈'),(41010802,'长兴路'),(41010803,'迎宾路'),(41010804,'新城'),(41010805,'岳寨'),(41010806,'北大学城'),(41010807,'大河路'),(41010808,'江山路'),(41010809,'开元路'),(41010810,'刘寨'),(41010811,'天河路'),(41010812,'英才街'),(41010816,'其他'),(41010901,'黄河东路'),(41010902,'金水东路'),(41010903,'绿地老街'),(41010904,'商都路'),(41010905,'农业东路'),(41010906,'东风东路'),(41010907,'七里河'),(41010908,'商鼎路'),(41010909,'商务内环'),(41010910,'通泰路'),(41010911,'其他'),(41011001,'石楠路'),(41011002,'莲花街'),(41011003,'银屏路'),(41011004,'合欢街'),(41011005,'瑞达路'),(41018601,'第三大街'),(41018602,'第八大街'),(41018603,'远大理想城'),(41018604,'其他'),(41030201,'新街'),(41030202,'丽京门'),(41030203,'北大街'),(41030204,'南关公园'),(41030205,'八角楼金街'),(41030206,'西关九龙鼎'),(41030207,'青年宫广场'),(41030208,'老城周边'),(41030301,'新都汇'),(41030302,'王府井'),(41030303,'中央百货'),(41030304,'洛浦路'),(41030305,'王城公园'),(41030306,'洛阳火车站'),(41030307,'周王城广场'),(41030308,'西工周边'),(41030401,'东花坛'),(41030402,'洛阳东站'),(41030403,'正骨医院'),(41030404,'瀍河周边'),(41030501,'广州市场'),(41030502,'涧西周边'),(41030503,'联盟路'),(41030504,'洛浦公园'),(41030505,'牡丹公园'),(41030506,'牡丹广场'),(41030507,'南昌路'),(41030508,'上海市场'),(41030509,'天津路'),(41030510,'万达广场'),(41030511,'西苑公园'),(41031101,'安乐师范学院'),(41031102,'白马寺周边'),(41031103,'宝龙城市广场'),(41031104,'大学城'),(41031105,'关林商贸城'),(41031106,'古城路'),(41031107,'开元湖'),(41031108,'李楼'),(41031109,'龙门石窟'),(41031110,'洛龙周边'),(41031111,'泉舜财富中心'),(41031112,'森林半岛'),(41031113,'隋唐遗址'),(41031114,'新区体育场'),(41031115,'政和路'),(42010201,'永清街'),(42010202,'循礼门'),(42010203,'球场街'),(42010204,'香港路'),(42010205,'台北路'),(42010206,'西马'),(42010207,'车站'),(42010208,'一元路'),(42010209,'三阳路'),(42010210,'二七路'),(42010211,'百步亭'),(42010212,'后湖'),(42010213,'竹叶山'),(42010214,'丹水池'),(42010215,'谌家矶'),(42010216,'大智路'),(42010217,'江滩'),(42010218,'三眼桥'),(42010219,'沿江大道'),(42010220,'花桥'),(42010221,'其他'),(42010301,'常青'),(42010302,'杨汊湖'),(42010303,'红旗渠'),(42010304,'唐家墩'),(42010305,'新华路'),(42010306,'万松园'),(42010307,'北湖'),(42010308,'西北湖'),(42010309,'青年路'),(42010310,'前进'),(42010311,'汉口火车站'),(42010312,'发展大道'),(42010313,'建设大道'),(42010317,'江汉路'),(42010318,'其他'),(42010401,'古田'),(42010402,'宝丰'),(42010403,'崇仁'),(42010404,'宗关'),(42010405,'武胜路'),(42010406,'汉正'),(42010407,'利济路'),(42010408,'汉中'),(42010409,'汉水桥'),(42010410,'汉西'),(42010411,'易家墩'),(42010412,'解放大道'),(42010413,'集贤街'),(42010414,'舵落口'),(42010415,'双墩'),(42010416,'简易路'),(42010417,'长丰大道'),(42010418,'其他'),(42010501,'王家湾'),(42010502,'郭茨口'),(42010503,'琴断口'),(42010504,'钟家村'),(42010505,'鹦鹉'),(42010506,'洲头'),(42010507,'七里庙'),(42010508,'翠微'),(42010509,'其他'),(42010510,'沌口经济开发区'),(42010511,'五里墩'),(42010512,'月湖'),(42010513,'晴川'),(42010514,'建桥'),(42010515,'江汉二桥'),(42010516,'汉阳大道'),(42010517,'龙阳大道'),(42010518,'十里铺'),(42010519,'琴台大道'),(42010520,'东风大道'),(42010601,'杨园'),(42010602,'徐家棚'),(42010603,'徐东'),(42010604,'东亭'),(42010605,'中北路'),(42010606,'水果湖'),(42010607,'中南路'),(42010608,'丁字桥'),(42010609,'南湖花园'),(42010610,'南湖'),(42010611,'珞珈山'),(42010612,'傅家坡'),(42010613,'小东门'),(42010614,'司门口'),(42010615,'粮道街'),(42010616,'积玉桥'),(42010617,'中华路'),(42010618,'黄鹤楼'),(42010619,'首义路'),(42010620,'紫阳'),(42010621,'武昌火车站'),(42010622,'武泰闸'),(42010623,'白沙洲'),(42010624,'八一路'),(42010625,'螃蟹甲'),(42010626,'其他'),(42010627,'月湖'),(42010628,'大东门'),(42010701,'红钢城'),(42010702,'冶金'),(42010703,'建设二路'),(42010704,'建设七路'),(42010705,'钢花村'),(42010706,'钢都'),(42010707,'青山'),(42010708,'友谊大道'),(42010709,'和平大道'),(42010710,'工业路'),(42010711,'大洲村'),(42010712,'武东'),(42010713,'白玉山'),(42010714,'新沟桥'),(42010715,'八大家'),(42010716,'鄂洲街'),(42010717,'黄家大湾'),(42011101,'关山'),(42011102,'光谷'),(42011103,'鲁巷'),(42011104,'卓刀泉'),(42011105,'街道口'),(42011106,'广埠屯'),(42011107,'珞南'),(42011108,'珞狮南路'),(42011109,'陈家湾'),(42011110,'张家湾'),(42011111,'光谷软件园'),(42011112,'关山大道'),(42011113,'民族大道'),(42011114,'杨家湾'),(42011115,'虎泉'),(42011116,'小河西村'),(42011117,'雄楚大道'),(42011118,'其他'),(42011201,'吴家山'),(42011202,'金银湖'),(42011203,'柏泉'),(42011204,'三店'),(42011206,'慈惠墩'),(42011207,'走马岭'),(42011208,'径河'),(42011209,'其他'),(42011210,'荷包湖'),(42011211,'新沟'),(42011212,'辛安渡'),(42011213,'东山'),(42011301,'纱帽'),(42011302,'邓南'),(42011401,'蔡甸'),(42011402,'张湾'),(42011403,'侏儒'),(42011404,'奓山'),(42011405,'大集'),(42011501,'纸坊'),(42011502,'流芳'),(42011503,'大花岭'),(42011504,'乌龙泉'),(42011505,'藏龙岛'),(42011506,'五里界'),(42011507,'舒安'),(42011508,'其他'),(42011601,'盘龙城'),(42011602,'前川'),(42011603,'武湖'),(42011604,'横店'),(42011605,'木兰乡'),(42011606,'滠口'),(42011607,'六指店'),(42011608,'天河'),(42011609,'其他'),(42011701,'邾城'),(42011702,'旧街'),(42011703,'三店'),(42011704,'李集'),(42011705,'仓埠'),(42011706,'阳逻'),(42011707,'双柳'),(42011708,'汪集'),(42011709,'潘塘'),(42011801,'襄樊区域'),(43010201,'文艺路'),(43010202,'湘湖'),(43010203,'韭菜园'),(43010204,'浏正街'),(43010205,'解放路'),(43010206,'府后街'),(43010207,'都正街'),(43010208,'五里牌'),(43010209,'火星'),(43010210,'马王堆'),(43010211,'东屯渡'),(43010212,'解放东路'),(43010213,'中山路'),(43010214,'芙蓉广场'),(43010215,'解放中路'),(43010216,'张公岭'),(43010217,'万家丽'),(43010218,'火炬路'),(43010219,'荷花园'),(43010220,'袁家岭'),(43010221,'陈家湖'),(43010222,'小林子冲'),(43010223,'赤岭路'),(43010224,'芙蓉苑'),(43010225,'芙蓉北路'),(43010226,'八一路'),(43010227,'火炬村'),(43010228,'湘湖路'),(43010229,'荷花路'),(43010230,'芙蓉区政府'),(43010231,'杨家山'),(43010232,'省政府'),(43010233,'曙光路口'),(43010234,'车站北路'),(43010235,'农科院'),(43010236,'窑岭'),(43010237,'地质中学'),(43010238,'凌霄路'),(43010241,'人民中路'),(43010242,'五一大道'),(43010243,'省军区'),(43010244,'三湘大市场'),(43010246,'芙蓉中路'),(43010247,'锦泰广场'),(43010248,'朝阳路'),(43010249,'人民路立交桥'),(43010250,'德政园'),(43010251,'浏城桥'),(43010252,'定王台'),(43010253,'五一广场'),(43010254,'蔡锷南路口'),(43010255,'汽车东站'),(43010256,'黄兴路'),(43010257,'蔡锷南路'),(43010258,'火车站'),(43010260,'梦泽园'),(43010261,'人民东路'),(43010262,'韶山北路'),(43010263,'芙蓉周边'),(43010301,'书院路'),(43010302,'坡子街'),(43010303,'学院街'),(43010304,'城南路'),(43010305,'广济桥'),(43010306,'金盆岭'),(43010307,'新开铺'),(43010308,'青园'),(43010309,'桂花坪'),(43010310,'东瓜山/赤岭路'),(43010311,'高升小区'),(43010312,'白沙街'),(43010313,'桂花村'),(43010314,'雅礼中学'),(43010315,'仰天湖'),(43010316,'碧湘街'),(43010317,'白沙路'),(43010318,'涂家冲'),(43010319,'五凌电力'),(43010320,'广厦新村'),(43010321,'松桂园'),(43010322,'南湖路'),(43010323,'南郊公园'),(43010324,'第一师范'),(43010325,'天心阁'),(43010326,'柑子园'),(43010327,'黄土岭'),(43010328,'长沙理工大学'),(43010329,'解放西路'),(43010330,'石子冲'),(43010331,'天心区政府'),(43010332,'大椿桥'),(43010333,'劳动广场'),(43010334,'南门口'),(43010335,'友谊路'),(43010336,'解放四村'),(43010337,'猴子石'),(43010338,'省政府'),(43010339,'侯家塘'),(43010340,'浦沅'),(43010341,'其他'),(43010342,'司门口'),(43010343,'识字岭'),(43010401,'望月湖'),(43010402,'岳麓'),(43010403,'桔子洲'),(43010404,'银盆岭'),(43010405,'观沙岭'),(43010406,'望城坡'),(43010407,'西湖'),(43010408,'咸嘉湖'),(43010409,'望岳'),(43010410,'天马山'),(43010411,'牌楼路'),(43010412,'六沟垅'),(43010413,'湖南商学院'),(43010414,'大学城'),(43010415,'新民路'),(43010416,'魏家坡'),(43010417,'科教新村'),(43010418,'高叶塘'),(43010419,'咸嘉新村'),(43010420,'湖南财专'),(43010421,'岳麓山'),(43010422,'汽车西站'),(43010423,'溁湾镇'),(43010424,'省人防办'),(43010425,'雷锋大道'),(43010426,'麓山名园'),(43010427,'湘雅三医院'),(43010428,'枫林路'),(43010429,'麓谷'),(43010430,'桐梓坡'),(43010431,'金星大道'),(43010432,'市政府'),(43010433,'桐梓坡路'),(43010434,'左家垅'),(43010435,'岳麓周边'),(43010436,'商学院'),(43010501,'金霞路'),(43010502,'上大垅'),(43010503,'清水塘'),(43010504,'望麓园'),(43010505,'北站路'),(43010506,'伍家岭'),(43010507,'民主东街'),(43010508,'黑石渡'),(43010509,'新河路'),(43010510,'通泰街'),(43010511,'西长街'),(43010512,'四方坪'),(43010513,'大王家巷'),(43010514,'浏阳河'),(43010515,'营盘路'),(43010516,'洪山桥'),(43010517,'广电中心'),(43010518,'开福寺'),(43010519,'三一大道'),(43010520,'动物园'),(43010521,'兴汉门'),(43010522,'中山亭'),(43010523,'砚瓦池'),(43010524,'丝茅冲'),(43010525,'东风路'),(43010526,'华夏路'),(43010527,'德雅路口'),(43010528,'丽臣路'),(43010529,'蔡锷北路'),(43010530,'湘雅医院'),(43010531,'德雅路'),(43010532,'北正街'),(43010533,'蒋家垅'),(43010534,'潘家坪'),(43010535,'王家垅'),(43010536,'湘雅路'),(43010537,'烈士公园'),(43010538,'德雅村'),(43010539,'浏阳河路'),(43010540,'王家巷'),(43010541,'下大垅'),(43010542,'东风村'),(43010543,'八一桥'),(43010544,'培元桥'),(43010545,'省博物馆'),(43010546,'竹山园'),(43010547,'湘江中路'),(43010548,'国防科大'),(43010549,'省展览馆'),(43010550,'松桂园'),(43010551,'湘江世纪城'),(43010552,'开福周边'),(43010553,'蒋家垄'),(43010554,'湘雅路口'),(43011101,'侯家塘'),(43011102,'左家塘'),(43011103,'圭塘'),(43011104,'砂子塘'),(43011105,'东塘'),(43011106,'雨花亭'),(43011107,'高桥'),(43011108,'井湾子'),(43011109,'荷叶塘'),(43011110,'梓园路口'),(43011111,'桂花路口'),(43011112,'劳动中路'),(43011113,'新中路立交桥'),(43011114,'茶园坡'),(43011115,'曙光路'),(43011116,'桂花公园'),(43011117,'公交新村'),(43011118,'汽车南站'),(43011119,'韶山中路'),(43011120,'赤岗冲'),(43011121,'雨花区政府'),(43011122,'新星小区'),(43011123,'长岭'),(43011124,'韶山南路'),(43011125,'麻园塘'),(43011126,'梓园路'),(43011127,'铁道学院'),(43011128,'红星村'),(43011129,'七里庙'),(43011130,'水风井'),(43011131,'红旗药号'),(43011132,'劳动西路'),(43011133,'香樟路'),(43011134,'雅塘村'),(43011135,'赤岗岭'),(43011136,'王家冲'),(43011137,'桔园小区'),(43011138,'洞井铺'),(43011139,'长沙卷烟厂'),(43011140,'曙光中路'),(43011141,'阿弥岭'),(43011142,'树木岭'),(43011143,'狮子山'),(43011144,'体育新城'),(43011145,'雨花周边'),(43011146,'沙子塘'),(43011147,'芙蓉南路'),(44010301,'芳村'),(44010302,'站前'),(44010303,'西村'),(44010304,'环市西'),(44010305,'南岸'),(44010306,'中山八路'),(44010307,'流花湖'),(44010308,'人民北路'),(44010309,'荔湾路'),(44010310,'陈家祠'),(44010311,'东风西'),(44010312,'西华路'),(44010313,'泮塘'),(44010314,'康王路'),(44010315,'龙津'),(44010316,'上下九'),(44010317,'如意坊'),(44010318,'黄沙'),(44010319,'花地湾'),(44010320,'西搓路'),(44010322,'龙溪'),(44010324,'窖口'),(44010325,'桥中'),(44010326,'其他'),(44010401,'小北'),(44010402,'环市路'),(44010403,'建设'),(44010404,'淘金坑'),(44010405,'区庄'),(44010406,'水荫路'),(44010407,'恒福路'),(44010408,'烈士陵园'),(44010409,'杨箕'),(44010410,'五羊新城'),(44010411,'东山口'),(44010412,'越秀南'),(44010413,'越秀中'),(44010414,'东川路'),(44010415,'农讲所'),(44010416,'公园前'),(44010417,'北京路'),(44010418,'解放南'),(44010419,'解放北'),(44010420,'东山湖公园'),(44010421,'东风路'),(44010422,'中山纪念堂'),(44010424,'西门口'),(44010425,'大新'),(44010427,'其他'),(44010431,'二沙岛'),(44010434,'大东'),(44010501,'赤岗'),(44010502,'客村'),(44010503,'广州大道南'),(44010504,'新港'),(44010505,'赤岗塔'),(44010506,'中山大学'),(44010507,'鹭江'),(44010508,'大塘'),(44010509,'琶洲'),(44010510,'东晓路'),(44010511,'晓港'),(44010512,'昌岗'),(44010513,'江南大道南'),(44010514,'江南西'),(44010515,'磨碟沙'),(44010516,'新港东'),(44010517,'前进路'),(44010518,'万胜围'),(44010519,'滨江东'),(44010520,'滨江'),(44010521,'宝岗大道'),(44010522,'南华西'),(44010523,'工业大道北'),(44010524,'石榴岗'),(44010525,'敦和路'),(44010527,'江燕路'),(44010528,'市二宫'),(44010529,'工业大道南'),(44010530,'南洲'),(44010531,'沥滘'),(44010532,'官洲'),(44010534,'工业大道中'),(44010535,'瑞宝'),(44010538,'其他'),(44010601,'广州东站'),(44010602,'东圃'),(44010603,'奥林匹克中心'),(44010604,'体育东'),(44010605,'棠下'),(44010607,'华景新城'),(44010608,'天河公园'),(44010610,'岗顶'),(44010613,'五山'),(44010614,'天河北'),(44010615,'林和西'),(44010616,'天河体育中心'),(44010617,'体育西'),(44010619,'天河东'),(44010620,'黄埔大道'),(44010621,'猎德'),(44010623,'珠江新城'),(44010625,'沙河'),(44010626,'天平架'),(44010627,'燕塘'),(44010629,'天河客运站'),(44010633,'华南植物园'),(44010634,'龙洞'),(44010637,'其他'),(44010638,'车陂'),(44010639,'员村'),(44011101,'三元里'),(44011102,'新市'),(44011103,'黄石'),(44011104,'机场路'),(44011105,'同和（南湖板块）'),(44011106,'京溪'),(44011107,'梅花园'),(44011108,'大有围'),(44011109,'广园中路'),(44011110,'棠景'),(44011111,'同德围'),(44011112,'沙河'),(44011113,'罗冲围'),(44011114,'金沙洲'),(44011115,'石井'),(44011116,'景泰'),(44011117,'白云大道南'),(44011118,'白云大道北'),(44011119,'天平架'),(44011120,'嘉禾望岗'),(44011121,'桂花岗'),(44011122,'伍仙桥'),(44011124,'龙归'),(44011125,'人和'),(44011128,'太和'),(44011132,'钟落潭'),(44011133,'其他'),(44011134,'永泰'),(44011201,'大沙东'),(44011202,'双岗'),(44011203,'大沙地(区府所在地）'),(44011204,'庙头'),(44011205,'蟹山'),(44011206,'南岗'),(44011207,'红山（文冲）'),(44011208,'其他'),(44011209,'长洲'),(44011301,'市桥（市政府所在地）'),(44011302,'祈福新村'),(44011303,'钟村'),(44011304,'大石'),(44011305,'桥南'),(44011306,'洛溪新城'),(44011307,'南浦'),(44011308,'长隆'),(44011309,'石基'),(44011310,'星河湾'),(44011311,'大夫山森林公园'),(44011312,'南村'),(44011313,'大岗'),(44011314,'广州大学城'),(44011315,'厦滘'),(44011318,'黄阁'),(44011319,'其他'),(44011320,'沙湾'),(44011321,'石楼'),(44011402,'狮岭'),(44011403,'旧区'),(44011404,'新区'),(44011408,'花山'),(44011409,'芙蓉'),(44011410,'炭步'),(44011411,'赤坭'),(44011412,'其他'),(44011413,'梯面'),(44011601,'广州开发东区'),(44011602,'广州开发西区'),(44011603,'荔联'),(44011604,'萝岗'),(44011605,'南岗'),(44011606,'永和经济区'),(44011607,'其他'),(44018301,'增城区（市府所在地）'),(44018302,'新塘'),(44018303,'石滩'),(44018305,'其他'),(44018314,'派潭'),(44018401,'街口（市府所在地）'),(44018402,'太平'),(44018403,'江埔'),(44018404,'从化温泉'),(44018405,'良口'),(44018406,'吕田'),(44018407,'城郊'),(44018408,'鳌头'),(44030301,'蔡屋围'),(44030302,'国贸'),(44030303,'地王'),(44030304,'火车站'),(44030305,'东门'),(44030307,'文锦渡口岸'),(44030308,'黄贝岭'),(44030309,'莲塘'),(44030311,'布心'),(44030312,'翠竹'),(44030316,'笋岗'),(44030317,'泥岗'),(44030318,'清水河'),(44030319,'草埔'),(44030320,'银湖'),(44030327,'东湖'),(44030328,'其他'),(44030329,'水贝'),(44030330,'田贝'),(44030331,'罗湖区委'),(44030401,'上步'),(44030402,'上沙'),(44030403,'下沙'),(44030404,'八卦岭'),(44030406,'华强北'),(44030408,'梅林'),(44030410,'景田'),(44030411,'香密湖'),(44030412,'车公庙'),(44030413,'竹子林'),(44030416,'益田'),(44030417,'新洲'),(44030418,'石厦'),(44030420,'保税区'),(44030421,'皇岗'),(44030424,'岗厦'),(44030426,'福田中心区'),(44030430,'莲花北'),(44030432,'笔架山'),(44030433,'其他'),(44030434,'彩田村'),(44030435,'赤尾'),(44030436,'富民新村'),(44030437,'购物公园'),(44030438,'福田区委'),(44030439,'华强南'),(44030440,'园岭'),(44030501,'西丽'),(44030502,'华侨城'),(44030503,'白石洲'),(44030504,'科技园'),(44030506,'南头'),(44030509,'前海'),(44030511,'南油'),(44030513,'后海'),(44030514,'中心区'),(44030515,'蛇口'),(44030516,'其他'),(44030521,'深圳湾'),(44030522,'桂庙路口'),(44030523,'海岸城'),(44030524,'大冲'),(44030525,'海上世界'),(44030526,'南山医院'),(44030527,'深大'),(44030528,'桃源村'),(44030601,'西乡'),(44030602,'新安'),(44030603,'中心区'),(44030610,'福永'),(44030611,'沙井'),(44030612,'石岩'),(44030613,'松岗'),(44030621,'新城'),(44030622,'其他'),(44030701,'同乐'),(44030702,'布吉'),(44030703,'坂田'),(44030704,'龙岗中心'),(44030705,'横岗'),(44030710,'其他'),(44030711,'平湖'),(44030712,'坪地'),(44030801,'沙头角'),(44030802,'盐田'),(44030803,'大、小梅沙'),(44030804,'其他'),(44030901,'坑梓'),(44030902,'坪山'),(44030903,'其他'),(44031001,'公明'),(44031002,'其他'),(44031101,'葵涌'),(44031102,'南澳'),(44031103,'大鹏'),(44031104,'其他'),(44031201,'观澜'),(44031202,'大浪'),(44031203,'龙华中心区'),(44031204,'民治'),(44040201,'横琴'),(44040202,'北岭'),(44040203,'翠微'),(44040204,'拱北'),(44040205,'吉大'),(44040206,'老香洲'),(44040207,'兰埔'),(44040208,'柠溪'),(44040209,'上冲/前山'),(44040210,'唐家湾'),(44040211,'新香洲'),(44040212,'夏湾'),(44040213,'南屏'),(44040214,'其他'),(44040301,'白蕉'),(44040302,'井岸'),(44040303,'乾务'),(44040304,'斗门'),(44040305,'莲洲'),(44040306,'白藤头'),(44040307,'其他'),(44040401,'三灶'),(44040402,'红旗'),(44040403,'平沙'),(44040404,'南水'),(44040405,'其他'),(44060401,'汾江南路'),(44060402,'岭南大道'),(44060403,'季华路'),(44060404,'湖景'),(44060405,'福升'),(44060406,'绿景'),(44060407,'唐园'),(44060408,'亲仁'),(44060409,'弼塘'),(44060410,'普澜'),(44060411,'魁奇'),(44060412,'石湾'),(44060413,'祖庙'),(44060414,'张槎'),(44060415,'南庄'),(44060501,'城市广场'),(44060502,'南海大道北'),(44060503,'朝安'),(44060504,'天佑'),(44060505,'南海广场'),(44060506,'盐步'),(44060507,'平洲'),(44060508,'千灯湖'),(44060509,'黄岐'),(44060510,'狮山'),(44060511,'松岗'),(44060512,'罗村'),(44060513,'九江镇'),(44060514,'西樵'),(44060515,'丹灶'),(44060516,'大沥'),(44060517,'里水'),(44060601,'德民路'),(44060602,'大良'),(44060603,'容桂'),(44060604,'伦教'),(44060605,'勒流'),(44060606,'陈村'),(44060607,'北滘'),(44060608,'乐从'),(44060609,'龙江'),(44060610,'杏坛'),(44060611,'均安'),(44060612,'顺德碧桂园'),(44060701,'西南'),(44060702,'大塘'),(44060703,'乐平'),(44060704,'白坭'),(44060705,'芦苞'),(44060706,'南山镇'),(44060801,'荷城'),(44060802,'杨和'),(44060803,'明城'),(44060804,'富湾'),(44060805,'更合'),(44070301,'地王广场'),(44070302,'东湖公园'),(44070303,'购书中心'),(44070304,'江华小学'),(44070305,'金汇广场'),(44070306,'乐宜居'),(44070307,'良化新村'),(44070308,'汽车总站'),(44070309,'市第一幼园'),(44070310,'世纪花源'),(44070311,'双龙广场'),(44070312,'五邑大学'),(44070313,'五邑中医院'),(44070314,'中天国际'),(44070315,'其他'),(44070401,'河南'),(44070402,'礼乐'),(44070403,'外海'),(44070404,'高新区'),(44070405,'滘北'),(44070406,'滘头'),(44070407,'中环广场'),(44070408,'其他'),(44070501,'电大'),(44070502,'信合大厦'),(44070503,'人民会堂'),(44070504,'其他'),(44130201,'桥东街道'),(44130202,'桥西街道'),(44130203,'江南街道'),(44130204,'江北街道'),(44130205,'龙丰街道'),(44130206,'河南岸街道'),(44130207,'惠环街道'),(44130208,'陈江街道'),(44130209,'水口街道'),(44130210,'小金口街道'),(44130211,'汝湖镇'),(44130212,'三栋镇'),(44130213,'潼湖镇'),(44130214,'沥林镇'),(44130215,'马安镇'),(44130216,'横沥镇'),(44130217,'芦洲镇'),(44130218,'潼桥镇'),(44130219,'惠州市林场'),(44130220,'上排街道'),(44130221,'麦地街道'),(44130222,'下埔街道'),(44130223,'演达街道'),(44130224,'步行街'),(44130225,'东平街道'),(44130226,'下角街道'),(44130227,'南坛街道'),(44130228,'仲恺街道'),(44130301,'淡水街道'),(44130302,'秋长街道'),(44130303,'澳头街道'),(44130304,'霞涌街道'),(44130305,'沙田镇'),(44130306,'新圩镇'),(44130307,'镇隆镇'),(44130308,'永湖镇'),(44130309,'良井镇'),(44130310,'平潭镇'),(44130311,'三和开发区'),(44130312,'西区街道'),(44132201,'石坝镇'),(44132202,'麻陂镇'),(44132203,'观音阁镇'),(44132204,'公庄镇'),(44132205,'杨村镇'),(44132206,'柏塘镇'),(44132207,'泰美镇'),(44132208,'罗阳镇'),(44132209,'湖镇镇'),(44132210,'长宁镇'),(44132211,'福田镇'),(44132212,'龙华镇'),(44132213,'龙溪镇'),(44132214,'园洲镇'),(44132215,'石湾镇'),(44132216,'杨侨镇'),(44132217,'罗浮山管委会'),(44132301,'平山街道'),(44132302,'大岭镇'),(44132303,'白花镇'),(44132304,'梁化镇'),(44132305,'稔山镇'),(44132306,'铁涌镇'),(44132307,'平海镇'),(44132308,'吉隆镇'),(44132309,'多祝镇'),(44132310,'安墩镇'),(44132311,'高潭镇'),(44132312,'宝口镇'),(44132313,'白盆珠镇'),(44132314,'梁化林场'),(44132315,'九龙峰林场'),(44132316,'港口海龟湾自然保护区'),(44132317,'莲花山白盆珠省级自然保护区'),(44132318,'古田省级自然保护区'),(44132319,'巺寮滨海旅游渡假区管理委员会'),(44132401,'龙城街道'),(44132402,'麻榨镇'),(44132403,'永汉镇'),(44132404,'平陵镇'),(44132405,'龙田镇'),(44132406,'龙潭镇'),(44132407,'地派镇'),(44132408,'龙华镇'),(44132409,'龙江镇'),(44132410,'蓝田瑶族乡'),(44132411,'国营油田林场'),(44132412,'青年林场'),(44132413,'柑桔场'),(44132414,'密溪林场'),(44132415,'南昆山生态旅游区管理委员会'),(44190101,'罗沙城内'),(44190102,'莞城中心'),(44190103,'运河东'),(44190104,'其他'),(44190106,'东正'),(44190117,'八达路'),(44190201,'石竹新花园'),(44190202,'西平'),(44190210,'银丰路'),(44190212,'景湖湾畔'),(44190218,'江南世家'),(44190254,'体育路'),(44190261,'鸿福路'),(44190262,'篁村'),(44190267,'其他'),(44190268,'城市风景街'),(44190301,'世博广场'),(44190302,'主山'),(44190304,'东泰'),(44190305,'火炼树'),(44190308,'石井'),(44190309,'花园新村'),(44190310,'上下桥'),(44190311,'雍华庭'),(44190333,'立新'),(44190337,'景湖春天'),(44190351,'东城十三碗'),(44190354,'桑园'),(44190356,'光明'),(44190376,'樟村'),(44190399,'其他'),(44190401,'莫屋'),(44190402,'石美'),(44190406,'江滨花园'),(44190408,'简沙洲'),(44190427,'其他'),(44190504,'桥头'),(44190506,'白濠'),(44190510,'康乐南路'),(44190527,'三屯'),(44190533,'赤岭'),(44190546,'其他'),(44190605,'南栅'),(44190606,'北栅'),(44190611,'太平广场'),(44190613,'九门寨'),(44190615,'大宁'),(44190617,'新联'),(44190623,'黄河时装城'),(44190651,'其他'),(44190652,'龙眼'),(44190701,'厦边'),(44190702,'长青街'),(44190703,'厦岗'),(44190704,'咸西'),(44190706,'沙头'),(44190709,'新民'),(44190710,'霄边下洋路'),(44190712,'街口'),(44190713,'锦厦'),(44190714,'霄边'),(44190715,'上角'),(44190730,'霄边上洋路'),(44190731,'上沙'),(44190732,'乌沙'),(44190737,'其他'),(44190818,'天鹅湖路'),(44190833,'中元街'),(44190834,'其他'),(44200101,'大信'),(44200102,'百佳'),(44200103,'逢源商业街'),(44200104,'湖滨北路'),(44200105,'白水井'),(44200301,'万佳'),(44200302,'中山三路'),(44200303,'竹苑'),(44200304,'库充'),(44200305,'孙文东路'),(45010201,'民生'),(45010202,'朝阳路'),(45010203,'安宁'),(45010204,'东沟岭'),(45010205,'望州岭'),(45010206,'兴宁区政府'),(45010207,'三塘'),(45010208,'五塘'),(45010209,'昆仑'),(45010210,'人民中路'),(45010211,'人民东路'),(45010212,'华东路'),(45010213,'杭州路'),(45010214,'南京路'),(45010215,'济南路'),(45010216,'上海路'),(45010217,'华强路'),(45010218,'关东路'),(45010219,'长岗路'),(45010220,'新阳路'),(45010221,'中山路'),(45010222,'其他'),(45010223,'高峰路'),(45010224,'唐山路'),(45010225,'明德街'),(45010226,'解放路'),(45010227,'当阳街'),(45010228,'共和路'),(45010229,'七星路'),(45010230,'北宁街'),(45010231,'朝阳路'),(45010232,'中华路'),(45010233,'人民路'),(45010234,'民生路'),(45010235,'华西路'),(45010237,'民主路'),(45010238,'公园路'),(45010239,'新华步行街'),(45010240,'南湖大道'),(45010241,'长兴路'),(45010301,'长湖路'),(45010302,'东盟商务区'),(45010303,'凤岭北'),(45010304,'古城建政区'),(45010305,'会展中心'),(45010306,'柳沙片区'),(45010307,'民族广场'),(45010308,'南湖广场'),(45010309,'青秀山'),(45010310,'七星桃源区'),(45010311,'望园路'),(45010312,'五象广场'),(45010313,'仙葫经济开发区'),(45010314,'临江路'),(45010315,'中山'),(45010316,'康乐路'),(45010317,'南湖'),(45010318,'新竹'),(45010319,'双拥路'),(45010320,'长塘镇'),(45010321,'伶俐镇'),(45010322,'东葛路'),(45010323,'民族大道'),(45010324,'东宝路'),(45010325,'安湖路'),(45010326,'凤翔路'),(45010327,'桃村路'),(45010328,'鲤湾路'),(45010329,'北湖路'),(45010330,'竹园路'),(45010331,'厢竹大道'),(45010332,'江北大道'),(45010333,'長堽路'),(45010334,'竹溪大道'),(45010335,'平湖路'),(45010336,'保爱路'),(45010342,'星湖路'),(45010501,'白沙大道'),(45010502,'国家经济开发区'),(45010503,'沙井大道'),(45010504,'五一路'),(45010505,'星光大道'),(45010506,'壮锦大道'),(45010507,'友谊路'),(45010508,'福建路'),(45010509,'那洪'),(45010510,'体育路'),(45010511,'盘岭路'),(45010512,'吴圩'),(45010513,'苏圩'),(45010514,'其他'),(45010515,'南建路'),(45010516,'淡村路'),(45010517,'亭洪路'),(45010518,'金象大道'),(45010519,'10+1商业大道'),(45010520,'银海大道'),(45010521,'金凯路'),(45010522,'银凯路'),(45010523,'五象大道'),(45010524,'大沙田'),(45010701,'望州路'),(45010702,'中尧路'),(45010703,'北大路'),(45010704,'龙腾路'),(45010705,'高新开发区'),(45010706,'衡阳路'),(45010707,'邕武路'),(45010708,'鲁班路'),(45010709,'明秀路'),(45010710,'相思湖新区'),(45010711,'新阳路'),(45010712,'秀厢大道'),(45010713,'其他'),(45010714,'衡阳'),(45010715,'北湖'),(45010716,'安吉'),(45010717,'新阳'),(45010718,'华强'),(45010719,'上尧'),(45010720,'安宁'),(45010721,'心圩'),(45010722,'大岭路'),(45010723,'金陵镇'),(45010724,'双定镇'),(45010725,'坛洛镇'),(45010726,'大学路'),(45010727,'农院路'),(45010728,'火炬路'),(45010729,'秀灵路'),(45010732,'友爱路'),(45010801,'大沙田'),(45010802,'五象大道'),(45010803,'沿海经济开发区'),(45010804,'良庆'),(45010805,'那马'),(45010806,'大塘'),(45010807,'南晓'),(45010808,'那陈'),(45010809,'阳光新城'),(45010901,'彩虹路'),(45010902,'新兴广场'),(45010903,'银峰路'),(45010904,'蒲庙'),(45010905,'新江'),(45010906,'那楼'),(45010907,'百济'),(45010908,'中和'),(45010909,'良庆'),(45012801,'钦州'),(45012802,'北海'),(45020201,'高新区'),(45030201,'滨江路'),(45030202,'凤北路'),(45030203,'红岭路'),(45030204,'解放东路'),(45030205,'解放西路'),(45030206,'九岗岭'),(45030207,'乐群'),(45030208,'榕湖北路'),(45030209,'榕湖南路'),(45030210,'榕荫路'),(45030211,'三多路'),(45030212,'杉湖北路'),(45030213,'十字街'),(45030214,'五美路'),(45030215,'西风路'),(45030216,'信义路'),(45030217,'西山路'),(45030218,'翊武路'),(45030219,'置业广场'),(45030220,'中华路'),(45030221,'中山中路'),(45030222,'中心广场'),(45030223,'中隐路'),(45030224,'其他'),(45030301,'北极广场'),(45030302,'叠彩路'),(45030303,'叠彩阳光'),(45030304,'芳华路'),(45030305,'凤北路口'),(45030306,'芙蓉路'),(45030307,'观音阁'),(45030308,'环城北一路'),(45030309,'火车始发站'),(45030310,'九华山'),(45030311,'芦笛路'),(45030312,'螺丝山'),(45030313,'清风小区'),(45030314,'群众路'),(45030315,'区政府'),(45030316,'三皇路'),(45030317,'山水阳光城'),(45030318,'圣隆路'),(45030319,'沃尔玛'),(45030320,'乌石街'),(45030321,'新建路'),(45030322,'中山北路'),(45030323,'其他'),(45030401,'安厦世纪城'),(45030402,'安新洲'),(45030403,'北斗商行'),(45030404,'崇新路'),(45030405,'翠竹路'),(45030406,'德天广场'),(45030407,'东安街'),(45030408,'红街'),(45030409,'将军路'),(45030410,'净平山路'),(45030411,'凯风路'),(45030412,'联达广场'),(45030413,'龙船坪'),(45030414,'民族路'),(45030415,'上海路'),(45030416,'万寿巷'),(45030417,'瓦窑'),(45030418,'文明路'),(45030419,'下关'),(45030420,'西城步行街'),(45030421,'西环路'),(45030422,'雉山路'),(45030423,'中山南路'),(45030424,'其他'),(45030501,'澳洲假日'),(45030502,'穿山路'),(45030503,'东二环路'),(45030504,'辅星路'),(45030505,'环城北二路'),(45030506,'环城南一路'),(45030507,'建干路'),(45030508,'金鸡路'),(45030509,'空明路'),(45030510,'理工大学'),(45030511,'漓江路'),(45030512,'六合路'),(45030513,'龙隐路'),(45030514,'普驼路'),(45030515,'七里店'),(45030516,'栖霞路'),(45030517,'七星路'),(45030518,'三里店'),(45030519,'施家园'),(45030520,'五里店'),(45030521,'信息产业园'),(45030522,'毅峰路'),(45030523,'银海医院'),(45030524,'育才路'),(45030525,'自由路'),(45030526,'其他'),(45031101,'321国道'),(45031102,'大雁路'),(45031103,'姐妹桥'),(45031104,'愚自乐园'),(45031105,'其他'),(45032101,'阳朔西街'),(45032102,'碧莲巷'),(45032103,'阳朔县政府'),(45032104,'城镇中路'),(45032105,'城西路'),(45032106,'蟠桃路'),(45032107,'十里画廊'),(45032108,'其他'),(45032501,'迎宾路'),(45032502,'兴桂北路'),(45032503,'上水西'),(45032504,'其他'),(46010501,'秀英'),(46010502,'海秀'),(46010503,'其他'),(46010601,'中山'),(46010602,'滨海'),(46010603,'金贸'),(46010604,'大同'),(46010605,'海垦'),(46010606,'金宇'),(46010607,'其他'),(46010701,'国兴'),(46010702,'府城'),(46010703,'龙塘'),(46010704,'云龙'),(46010705,'红旗'),(46010706,'三门坡'),(46010707,'大坡'),(46010708,'甲子'),(46010709,'旧州'),(46010710,'其他'),(46010801,'海府'),(46010802,'蓝天'),(46010803,'博爱'),(46010804,'海甸'),(46010805,'人民路'),(46010806,'白龙'),(46010807,'和平南'),(46010808,'白沙'),(46010809,'其他'),(46010901,'文昌市'),(46010902,'五指山市'),(46010903,'琼海市'),(46010904,'儋州市'),(46010905,'东方市'),(46010906,'琼中县'),(46010907,'陵水县'),(46010908,'昌江县'),(46010909,'万宁市'),(46020101,'春园路'),(46020102,'第一市场'),(46020103,'光明路'),(46020104,'河西路'),(46020105,'建港路'),(46020106,'建设街'),(46020107,'解放路'),(46020108,'金鸡岭路'),(46020109,'三亚火车站'),(46020110,'新民街'),(46020111,'友谊路'),(46020112,'跃进路'),(46020201,'槟榔谷'),(46020202,'春光路'),(46020203,'凤凰岛'),(46020204,'凤凰路'),(46020205,'海坡'),(46020206,'海润路'),(46020207,'海月广场'),(46020208,'红旗街'),(46020209,'吉祥街'),(46020210,'老机场路'),(46020211,'三亚湾'),(46020212,'三亚湾路'),(46020213,'胜利路'),(46020214,'团结路'),(46020215,'外贸路'),(46020216,'新风街'),(46020217,'迎宾路'),(46020301,'海棠湾镇'),(46020302,'永宁'),(46020401,'大东海'),(46020402,'海东路'),(46020403,'海花路'),(46020404,'海榆路'),(46020405,'海韵路'),(46020406,'河东路'),(46020407,'红沙码头'),(46020408,'吉阳镇'),(46020409,'临春河路'),(46020410,'荔枝沟'),(46020411,'鹿回头'),(46020412,'鹿岭路'),(46020413,'南边海路'),(46020414,'森林公园'),(46020415,'商品街'),(46020416,'祥瑞路'),(46020417,'学园路'),(46020418,'亚龙湾'),(46020419,'月川'),(46020420,'月川路'),(46020421,'榆亚路'),(46020501,'凤凰机场'),(46020601,'崖城镇'),(46020602,'龙港'),(46020701,'白沙'),(46020702,'保亭'),(46020703,'博鳌论坛'),(46020704,'昌江'),(46020705,'东方'),(46020706,'乐东'),(46020707,'陵水'),(46020708,'琼中'),(46020709,'天涯镇'),(46020710,'万宁'),(46020711,'五指山市'),(46020712,'呀诺达'),(50010101,'柱山'),(50010102,'九池'),(50010103,'郭村'),(50010104,'铁峰'),(50010105,'黄柏'),(50010106,'溪口'),(50010107,'燕山'),(50010108,'长坪'),(50010109,'梨树'),(50010110,'凤仪'),(50010111,'普子'),(50010112,'地宝'),(50010113,'茨竹'),(50010114,'恒合土家族'),(50010115,'高峰'),(50010116,'龙沙'),(50010117,'响水'),(50010118,'武陵'),(50010119,'甘宁'),(50010120,'天城'),(50010121,'熊家'),(50010122,'大周'),(50010123,'小周'),(50010124,'孙家'),(50010125,'高梁'),(50010126,'李河'),(50010127,'分水'),(50010128,'余家'),(50010129,'后山'),(50010130,'弹子'),(50010131,'长岭'),(50010132,'新田'),(50010133,'走马'),(50010134,'白土'),(50010135,'长滩'),(50010136,'白羊'),(50010137,'太安'),(50010138,'龙驹'),(50010139,'太龙'),(50010140,'罗田'),(50010141,'新镇'),(50010142,'高笋塘'),(50010143,'太白'),(50010144,'牌楼'),(50010145,'双河口'),(50010146,'龙都'),(50010147,'周家坝'),(50010148,'沙河'),(50010149,'钟鼓楼'),(50010150,'百安坝'),(50010151,'五桥'),(50010152,'陈家坝'),(50010153,'瀼渡'),(50010154,'其他'),(50010201,'荔枝'),(50010202,'敦仁'),(50010203,'崇义'),(50010204,'江东'),(50010205,'江北'),(50010206,'珍溪'),(50010207,'百胜'),(50010208,'焦石'),(50010209,'清溪'),(50010210,'南沱'),(50010211,'李渡'),(50010212,'镇安'),(50010213,'致韩'),(50010214,'义和'),(50010215,'石沱'),(50010216,'新妙'),(50010217,'增福'),(50010218,'龙潭'),(50010219,'青羊'),(50010220,'堡子'),(50010221,'蔺市'),(50010222,'龙桥'),(50010223,'马武'),(50010224,'中峰'),(50010225,'仁义'),(50010226,'丛林'),(50010228,'山窝'),(50010229,'龙塘'),(50010230,'卷洞'),(50010231,'罗云'),(50010232,'石龙'),(50010233,'两汇'),(50010234,'明家'),(50010235,'同乐'),(50010236,'惠民'),(50010301,'朝天门'),(50010302,'望龙门'),(50010303,'解放碑'),(50010304,'较场口'),(50010305,'南纪门'),(50010306,'七星岗'),(50010307,'菜园坝'),(50010308,'两路口'),(50010309,'大溪沟'),(50010310,'上清寺'),(50010316,'王家坡'),(50010317,'大坪'),(50010318,'化龙桥'),(50010319,'其他'),(50010401,'新山村'),(50010402,'跃进村'),(50010403,'九宫庙'),(50010404,'茄子溪'),(50010405,'春晖路'),(50010406,'其他'),(50010407,'八桥'),(50010408,'建胜'),(50010409,'跳磴'),(50010501,'华新街'),(50010502,'石马河'),(50010503,'大石坝'),(50010504,'观音桥'),(50010505,'五里店'),(50010506,'寸滩'),(50010507,'江北城'),(50010512,'郭家沱'),(50010513,'铁山坪'),(50010514,'鱼嘴'),(50010515,'复盛'),(50010516,'五宝'),(50010517,'其他'),(50010518,'盘溪'),(50010519,'南桥寺'),(50010601,'小龙坎'),(50010602,'沙坪坝'),(50010603,'磁器口'),(50010604,'井口'),(50010605,'詹家溪'),(50010606,'石井坡'),(50010607,'童家桥'),(50010608,'渝碚路'),(50010609,'天星桥'),(50010610,'土湾'),(50010611,'新桥'),(50010612,'山洞'),(50010613,'歌乐山'),(50010614,'覃家岗'),(50010615,'陈家桥'),(50010616,'曾家'),(50010617,'虎溪'),(50010618,'西永'),(50010619,'土主'),(50010620,'青木关'),(50010621,'凤凰'),(50010622,'回龙坝'),(50010623,'中梁'),(50010624,'汉渝路'),(50010625,'其他'),(50010701,'杨家坪'),(50010702,'谢家湾'),(50010703,'石坪桥'),(50010704,'黄桷坪'),(50010705,'中梁山'),(50010706,'石桥铺'),(50010707,'渝州路'),(50010710,'九龙'),(50010711,'华岩'),(50010712,'西彭'),(50010713,'铜罐驿'),(50010714,'陶家'),(50010715,'白市驿'),(50010716,'巴福'),(50010717,'走马'),(50010718,'金凤'),(50010719,'含谷'),(50010720,'石板'),(50010721,'其他'),(50010722,'巴国城'),(50010723,'2郎'),(50010801,'南坪'),(50010802,'龙门浩'),(50010803,'海棠溪'),(50010804,'弹子石'),(50010805,'大佛段'),(50010806,'铜元局'),(50010807,'花园路'),(50010808,'南山'),(50010809,'峡口'),(50010810,'涂山'),(50010811,'鸡冠石'),(50010812,'黄桷桠'),(50010813,'长生桥'),(50010819,'迎龙'),(50010820,'广阳'),(50010821,'玄坛庙'),(50010822,'南滨路'),(50010823,'其他'),(50010824,'四公里'),(50010825,'五小区'),(50010826,'上新街'),(50010827,'洋人街'),(50010901,'万盛'),(50010902,'朝阳'),(50010903,'歇马'),(50010904,'龙凤桥'),(50010905,'天府'),(50010906,'童家溪'),(50010907,'澄江'),(50010908,'蔡家岗'),(50010909,'东阳'),(50010910,'北温泉'),(50010912,'其他'),(50010913,'施家梁'),(50010914,'水土'),(50010915,'复兴'),(50010916,'静观'),(50010917,'柳荫'),(50010918,'三圣'),(50010919,'偏岩'),(50010920,'石坝'),(50010921,'金刀峡'),(50011001,'东林'),(50011002,'万东'),(50011003,'南桐'),(50011004,'青年'),(50011005,'关坝'),(50011006,'丛林'),(50011007,'南天'),(50011008,'金桥'),(50011009,'景星'),(50011010,'其他'),(50011201,'两路'),(50011202,'冉家坝'),(50011203,'新牌坊'),(50011204,'龙湖'),(50011205,'气博中心'),(50011206,'一碗水'),(50011207,'双龙湖'),(50011208,'空港'),(50011209,'双湖路'),(50011210,'碧津'),(50011211,'金岛花园'),(50011212,'西政'),(50011213,'花卉园'),(50011214,'龙溪'),(50011215,'龙头寺'),(50011216,'大竹林'),(50011217,'加州'),(50011218,'龙滩子'),(50011219,'双路'),(50011220,'通桥'),(50011221,'双凤桥'),(50011222,'人和'),(50011223,'回兴'),(50011224,'加洲新牌坊'),(50011225,'石坪'),(50011226,'木耳'),(50011227,'礼嘉'),(50011228,'鸳鸯'),(50011229,'农业园区'),(50011230,'汽博中心'),(50011231,'新溉路'),(50011232,'王家'),(50011233,'兴隆'),(50011234,'茨竹'),(50011235,'华蓥山'),(50011236,'龙兴'),(50011237,'洛碛'),(50011238,'石船'),(50011239,'麻柳沱'),(50011240,'大盛'),(50011241,'御临'),(50011242,'明月'),(50011243,'悦来'),(50011244,'张关'),(50011245,'古路'),(50011246,'玉峰山'),(50011247,'高嘴'),(50011248,'沙坪'),(50011249,'中河'),(50011250,'渝北周边'),(50011251,'黄泥磅'),(50011301,'鱼洞'),(50011302,'李家沱'),(50011303,'花溪'),(50011304,'南泉'),(50011305,'界石'),(50011306,'南彭'),(50011307,'惠民'),(50011308,'一品'),(50011309,'安澜'),(50011310,'跳石'),(50011311,'木洞'),(50011312,'双河口'),(50011313,'麻柳嘴'),(50011314,'丰盛'),(50011315,'二圣'),(50011316,'东泉'),(50011317,'姜家'),(50011318,'天星寺'),(50011319,'接龙'),(50011320,'石滩'),(50011321,'石龙'),(50011322,'其他'),(50011401,'联合'),(50011402,'濯水'),(50011403,'马喇'),(50011404,'两河'),(50011405,'白合'),(50011406,'九龙'),(50011407,'黑溪'),(50011408,'西泡'),(50011409,'沙坝'),(50011410,'工农'),(50011411,'石会'),(50011412,'南海'),(50011413,'中塘'),(50011414,'栅山'),(50011415,'青冈'),(50011416,'舟白'),(50011417,'县坝'),(50011418,'濯西'),(50011419,'水市'),(50011420,'犁弯'),(50011421,'五里'),(50011422,'小庄'),(50011423,'鹅池'),(50011424,'学堂'),(50011425,'杨柳'),(50011426,'新安'),(50011427,'新华'),(50011428,'石家河'),(50011429,'蒲花'),(50011430,'金溪'),(50011431,'新花'),(50011432,'黎水'),(50011433,'杉岭'),(50011434,'新民'),(50011435,'白石'),(50011436,'黄溪'),(50011437,'金洞'),(50011438,'早化'),(50011439,'平溪'),(50011440,'石钟'),(50011441,'水田'),(50011442,'白土'),(50011443,'太极'),(50011444,'邻鄂'),(50011445,'蓬东'),(50011446,'寨子'),(50011447,'正阳'),(50011448,'渗坝'),(50011449,'其他'),(50011501,'后坝'),(50011502,'凤城'),(50011503,'晏家'),(50011504,'长寿湖'),(50011505,'葛兰'),(50011506,'江南'),(50011507,'邻封'),(50011508,'但渡'),(50011509,'云集'),(50011510,'双龙'),(50011511,'龙河'),(50011512,'石堰'),(50011513,'云台'),(50011514,'海棠'),(50011515,'新市'),(50011516,'渡舟'),(50011517,'八颗'),(50011518,'洪湖'),(50011519,'万顺'),(51010401,'督院街'),(51010402,'盐市口'),(51010403,'春熙路'),(51010404,'书院街'),(51010405,'合江亭'),(51010406,'水井坊'),(51010407,'龙舟路'),(51010408,'双桂路'),(51010409,'牛市口'),(51010410,'狮子山'),(51010411,'沙河堡'),(51010412,'东光小区'),(51010413,'成龙路'),(51010414,'柳江'),(51010415,'三圣乡'),(51010416,'九眼桥'),(51010417,'莲桂路'),(51010418,'海椒市'),(51010419,'牛王庙'),(51010420,'川师'),(51010421,'大观'),(51010422,'东大街'),(51010423,'东较场'),(51010424,'静居寺'),(51010425,'其他'),(51010501,'太升路'),(51010502,'草市街'),(51010503,'新华西路'),(51010504,'少城'),(51010505,'汪家拐'),(51010506,'西御河'),(51010507,'草堂'),(51010508,'光华'),(51010509,'金沙'),(51010510,'东坡'),(51010511,'苏坡'),(51010512,'文家'),(51010513,'黄田坝'),(51010514,'顺城街'),(51010515,'浣花小区'),(51010516,'贝森'),(51010517,'长顺街'),(51010518,'石人'),(51010519,'同仁路'),(51010520,'文殊坊'),(51010521,'西月城街'),(51010522,'其他'),(51010523,'八宝街'),(51010601,'西安路'),(51010602,'凤凰山'),(51010603,'茶店子'),(51010604,'抚琴'),(51010605,'天回镇'),(51010606,'营门口'),(51010607,'九里堤'),(51010608,'五块石'),(51010609,'黄忠'),(51010610,'欢乐谷'),(51010611,'荷花池'),(51010612,'金泉'),(51010613,'沙河源'),(51010614,'人民北路'),(51010615,'李家沱'),(51010616,'交大路'),(51010617,'蜀汉路'),(51010618,'土桥'),(51010619,'其他'),(51010620,'梁家巷'),(51010621,'沙湾'),(51010622,'花牌坊'),(51010623,'三洞桥'),(51010624,'永陵路'),(51010625,'西体路'),(51010701,'望江路'),(51010702,'致民路'),(51010703,'小天竺街'),(51010704,'跳伞塔'),(51010705,'玉林'),(51010706,'浆洗街'),(51010707,'簇桥'),(51010708,'双楠'),(51010709,'桂溪'),(51010710,'机投镇'),(51010711,'金花镇'),(51010712,'高攀路'),(51010713,'红牌楼'),(51010714,'肖家河'),(51010715,'石羊'),(51010716,'火车南站'),(51010717,'磨子桥'),(51010718,'桐梓林'),(51010719,'武侯祠大街'),(51010720,'高升桥'),(51010721,'广福桥'),(51010722,'科华路'),(51010723,'衣冠庙'),(51010724,'晋阳路'),(51010725,'芳草街'),(51010726,'其他'),(51010801,'保和'),(51010802,'双桥子'),(51010803,'猛追湾'),(51010804,'跳蹬河'),(51010805,'建设路'),(51010806,'府青路'),(51010807,'二仙桥'),(51010808,'桃蹊路'),(51010809,'龙潭寺'),(51010810,'青龙场'),(51010811,'新鸿路'),(51010812,'圣灯路'),(51010813,'万年场'),(51010814,'八里小区'),(51010815,'成渝立交'),(51010816,'新华公园'),(51010817,'崔家店'),(51010818,'东风路'),(51010819,'动物园'),(51010820,'槐树店'),(51010821,'火车东站'),(51010822,'十里店'),(51010823,'双林路'),(51010824,'杉板桥'),(51010825,'其他'),(51011201,'龙泉'),(51011202,'大面'),(51011203,'十陵镇'),(51011204,'同安'),(51011205,'阳光城'),(51011206,'洪河镇'),(51011207,'洛带古镇'),(51011301,'大弯'),(51011302,'红阳'),(51011401,'新都城区'),(51011406,'大丰'),(51011407,'三河'),(51011409,'新繁'),(51011412,'龙桥'),(51011413,'马家'),(51011416,'其他'),(51011417,'石板滩'),(51011418,'斑竹园'),(51011501,'柳城'),(51011502,'天府'),(51011503,'涌泉'),(51011504,'金马镇'),(51011505,'万春镇'),(51011506,'永宁镇'),(51011507,'寿安'),(51011508,'公平镇'),(51011509,'其他'),(51011601,'创业路'),(51011603,'芳草街'),(51011606,'南延线'),(51011608,'神仙树'),(51011609,'其他'),(51011613,'紫荆'),(51011614,'中和'),(51012201,'东升'),(51012202,'华阳'),(51012204,'籍田'),(51012205,'彭镇'),(51012206,'白家'),(51012207,'九江'),(51012208,'太平'),(51012209,'文星'),(51012210,'正兴'),(51012211,'大林'),(51012212,'煎茶'),(51012213,'永兴'),(51012214,'黄水'),(51012215,'金桥'),(51012216,'黄甲'),(51012217,'公兴'),(51012218,'胜利'),(51012219,'新兴'),(51012220,'兴隆'),(51012221,'万安'),(51012222,'白沙'),(51012223,'合江'),(51012224,'其他'),(51012225,'三星'),(51012226,'永安'),(51012227,'黄龙溪'),(51012228,'航空港'),(51012229,'蛟龙港'),(51012401,'唐昌'),(51012402,'犀浦'),(51012403,'安德'),(51012404,'安靖'),(51012405,'红光'),(51012406,'友爱'),(51012407,'唐元'),(51012408,'古城合作'),(51012409,'新民场'),(51012410,'德源'),(51012411,'团结'),(51012412,'花园'),(51012413,'三道堰'),(51012414,'郫筒'),(51012901,'晋原'),(51012902,'王泗'),(51012903,'出江'),(51012904,'西岭'),(51012905,'董场'),(51012906,'韩场'),(51012907,'三岔'),(51012908,'上安'),(51012909,'苏家'),(51012910,'新场'),(51012911,'安仁'),(51012912,'悦来'),(51012913,'青霞'),(51012914,'沙渠'),(51012915,'蔡场'),(51012916,'花水湾'),(51012917,'斜源'),(51013101,'鹤山'),(51013102,'大塘'),(51013103,'寿安'),(51013104,'西来'),(51013105,'大兴'),(51013106,'甘溪'),(51013107,'朝阳湖'),(51013108,'成佳'),(51013203,'金华'),(51013204,'兴义'),(51013210,'花源'),(51013211,'其他'),(51018101,'灌口'),(51018102,'幸福'),(51018103,'蒲阳'),(51018104,'中兴'),(51018105,'聚源'),(51018106,'天马'),(51018107,'崇义'),(51018108,'龙池'),(51018109,'柳街'),(51018110,'胥家'),(51018111,'安龙'),(51018112,'大观'),(51018113,'紫坪铺'),(51018114,'翠月湖'),(51018115,'石羊'),(51018116,'玉堂'),(51018117,'青城山'),(51018201,'天彭'),(51018202,'隆丰'),(51018203,'敖平'),(51018204,'九尺'),(51018205,'濛阳'),(51018206,'新兴'),(51018207,'通济'),(51018208,'丽春'),(51018209,'磁峰'),(51018210,'桂花'),(51018211,'军乐'),(51018212,'三界'),(51018213,'升平'),(51018214,'红岩'),(51018215,'致和'),(51018216,'白鹿'),(51018217,'龙门山'),(51018218,'小鱼洞'),(51018219,'葛仙山'),(51018220,'丹景山'),(51018301,'临邛'),(51018302,'固驿'),(51018303,'平乐'),(51018304,'羊安'),(51018305,'火井'),(51018306,'夹关'),(51018307,'水口'),(51018308,'桑园'),(51018309,'牟礼'),(51018310,'冉义'),(51018311,'回龙'),(51018312,'高埂'),(51018313,'前进'),(51018314,'高何'),(51018315,'临济'),(51018316,'卧龙'),(51018317,'天台山'),(51018318,'宝林'),(51018401,'崇阳'),(51018402,'怀远'),(51018403,'元通'),(51018404,'三江'),(51018405,'三郎'),(51018406,'廖家'),(51018407,'街子'),(51018408,'万家'),(51018409,'观胜'),(51018410,'羊马'),(51018411,'道明'),(51018412,'王场'),(51018413,'隆兴'),(51018414,'江源'),(51018415,'白头'),(51018416,'大划'),(51018417,'梓潼'),(51018418,'崇平'),(51018419,'桤泉'),(51018501,'土桥'),(51018502,'何家桥'),(51018503,'中海国际'),(51070301,'安昌桥'),(51070302,'东方红大桥'),(51070303,'涪城周边'),(51070304,'涪江二桥'),(51070305,'富乐大桥'),(51070306,'高水'),(51070307,'火车站'),(51070308,'警钟街'),(51070309,'金柱园'),(51070310,'临园口'),(51070311,'南河坝'),(51070312,'南河大桥'),(51070313,'七星楼'),(51070314,'三里村'),(51070315,'三鹏广场'),(51070316,'市中区'),(51070317,'五一广场'),(51070318,'小岛花园'),(51070319,'西南科技大学'),(51070320,'跃进路'),(51070321,'御营坝'),(51070401,'沈家坝'),(51070402,'五里堆'),(51070403,'六里村'),(51070404,'三医院'),(51070405,'开元场'),(51070406,'欧家坝'),(51070407,'科学城'),(51070408,'仙海镇'),(51070409,'游仙周边'),(51078201,'溏汛'),(51078202,'南湖汽车站'),(51078301,'九洲大道'),(51078302,'创业大道'),(52010201,'市府路'),(52010202,'中华南路'),(52010203,'油榨街'),(52010204,'新华路'),(52010205,'省军区'),(52010206,'市南路口'),(52010207,'龙洞堡'),(52010208,'河滨'),(52010209,'太慈桥'),(52010210,'西湖路'),(52010211,'花果园'),(52010212,'遵义路'),(52010213,'兴关'),(52010214,'沙冲路'),(52010215,'其他'),(52010220,'文昌南路'),(52010222,'蟠桃宫'),(52010223,'甘荫塘'),(52010301,'中华北路'),(52010302,'威清路'),(52010303,'中华中路'),(52010304,'中山西路'),(52010305,'中山东路'),(52010306,'宅吉'),(52010307,'市西路'),(52010308,'延安中路'),(52010309,'三桥'),(52010310,'头桥'),(52010311,'贵乌路'),(52010312,'普陀路'),(52010313,'环城北路'),(52010314,'黔灵东路'),(52010315,'北京路'),(52010316,'大十字'),(52010317,'枣山路'),(52010318,'东山'),(52010320,'未来方舟'),(52010321,'师大'),(52010324,'其他'),(52010326,'市西路'),(52010332,'瑞金北路'),(52010335,'八鸽岩'),(52010340,'大营坡'),(52011101,'清溪路'),(52011102,'青岩'),(52011103,'金竹'),(52011104,'其他'),(52011105,'花溪公园'),(52011108,'贵大'),(52011110,'花溪大学城'),(52011201,'新添寨'),(52011202,'东风镇'),(52011203,'保利公园'),(52011204,'501厂'),(52011205,'金华'),(52011206,'水景花都'),(52011207,'117地质队'),(52011208,'温泉路'),(52011213,'保利温泉'),(52011216,'振华广场'),(52011217,'其他'),(52011301,'大山洞'),(52011302,'南湖新区'),(52011303,'龚家寨'),(52011304,'艳山红'),(52011306,'白云公园'),(52011312,'其他'),(52011318,'同心路'),(52011402,'小河转盘'),(52011403,'黄河路'),(52011405,'小河'),(52011407,'兴隆花园'),(52011408,'贵航华阳'),(52011409,'小河平桥'),(52011410,'其他'),(52011413,'长江路'),(52012101,'城关'),(52012102,'金中'),(52012103,'双流'),(52012104,'冯三'),(52012105,'马场'),(52012106,'龙岗'),(52012107,'其他'),(52012201,'永靖'),(52012202,'小寨坝'),(52012203,'温泉'),(52012204,'九庄'),(52012301,'城关'),(52012302,'扎佐'),(52012303,'久长'),(52012304,'六广'),(52012305,'其他'),(52012401,'世纪城'),(52012404,'金阳客车站'),(52012406,'碧海花园'),(52012408,'其他'),(52018101,'青龙'),(52018102,'红枫湖'),(52018103,'站街'),(52018104,'卫城'),(52018105,'新店'),(52018106,'其他'),(52018201,'毕节'),(52030201,'海尔大道'),(52030202,'环城路'),(52030203,'中华路'),(52030204,'北京路'),(52030205,'遵义会址'),(52030206,'丁字口'),(52030207,'红花岗周边'),(52030301,'大连路'),(52030302,'南京路'),(52030303,'澳门路'),(52030304,'香港路'),(52030305,'深圳路'),(52030306,'人民路'),(52030307,'宁波路'),(52030308,'汇川周边'),(53010201,'南屏街片区'),(53010202,'大观'),(53010203,'华山'),(53010204,'龙翔'),(53010205,'丰宁片区'),(53010206,'莲花片区'),(53010207,'北市区'),(53010208,'黑林铺'),(53010209,'普吉'),(53010210,'翠湖'),(53010211,'高新区'),(53010212,'虹山片区'),(53010213,'黄土坡'),(53010214,'龙泉路'),(53010215,'小西门'),(53010216,'其他'),(53010301,'环城'),(53010302,'鼓楼片区'),(53010303,'东华'),(53010304,'董家湾'),(53010305,'拓东'),(53010306,'火车北站'),(53010307,'茨坝'),(53010308,'龙泉'),(53010309,'白塔路'),(53010310,'北辰财富中心'),(53010311,'江东花园'),(53010312,'金殿片区'),(53010313,'金星立交桥'),(53010314,'世博片区'),(53010315,'昙华寺片区'),(53010316,'新迎片区'),(53010317,'张官营'),(53010318,'白龙路片区'),(53010319,'其他'),(53011101,'关上'),(53011102,'金马'),(53011103,'东站'),(53011104,'和平村'),(53011105,'国贸中心'),(53011106,'南窑片区'),(53011107,'民航路'),(53011108,'经济开发区'),(53011109,'昆明机场'),(53011110,'新螺蛳湾'),(53011111,'世纪城'),(53011112,'官南大道'),(53011113,'其他'),(53011201,'棕树营'),(53011202,'马街'),(53011203,'金碧片区'),(53011204,'云纺片区'),(53011205,'永昌'),(53011206,'滇池路片区'),(53011207,'前卫'),(53011208,'碧鸡'),(53011209,'海口'),(53011210,'船房片区'),(53011211,'大商汇'),(53011212,'滇池度假区'),(53011213,'前卫营'),(53011214,'西山区政府'),(53011215,'其他'),(53011301,'新村'),(53011302,'因民'),(53011303,'汤丹'),(53011304,'碧谷'),(53012101,'龙城'),(53012102,'洛羊'),(53012103,'其他'),(53012201,'昆阳'),(53012202,'晋城'),(53012203,'古城'),(53012204,'其他'),(53012401,'永定'),(53012402,'大营'),(53012501,'匡远'),(53012502,'北古城'),(53012503,'南羊'),(53012504,'狗街'),(53012505,'汤池'),(53012506,'草甸'),(53012507,'其他'),(53012701,'嵩阳'),(53012702,'杨林'),(53012703,'小街'),(53012704,'其他'),(53018101,'连然'),(53018102,'八街'),(53018103,'温泉'),(53018104,'青龙'),(53018105,'草铺'),(53018106,'其他'),(61010201,'解放门'),(61010202,'东五路'),(61010203,'中山门'),(61010204,'西一路'),(61010205,'西五路'),(61010206,'韩森寨'),(61010207,'长乐中路'),(61010208,'胡家庙'),(61010209,'长乐西路'),(61010210,'太华路'),(61010211,'自强路'),(61010212,'中山东路'),(61010213,'新城街道'),(61010214,'人民路'),(61010215,'金花路'),(61010216,'文昌门'),(61010217,'长缨东路'),(61010218,'万寿路'),(61010219,'建政街道'),(61010220,'迎新路'),(61010221,'康复路'),(61010222,'西京医院'),(61010223,'互助路立交'),(61010224,'尚勤路'),(61010301,'和平路'),(61010302,'柏树林'),(61010303,'南大街'),(61010304,'南院门'),(61010305,'长乐坊'),(61010306,'东关南街'),(61010307,'太乙路'),(61010308,'长安路'),(61010309,'张家村'),(61010310,'文艺路'),(61010311,'东大街'),(61010312,'大差市'),(61010313,'安东街'),(61010314,'安西街'),(61010315,'东木头市'),(61010316,'广济街'),(61010317,'东门外'),(61010318,'何家村'),(61010319,'大学南路'),(61010320,'边家村'),(61010321,'朱雀大街'),(61010322,'小雁塔'),(61010323,'环城南路'),(61010324,'其他'),(61010401,'北院门'),(61010402,'青年路'),(61010403,'庙后街'),(61010404,'西大街'),(61010405,'西关'),(61010406,'土门'),(61010407,'桃园路'),(61010408,'枣园'),(61010409,'北关'),(61010410,'红庙坡'),(61010411,'环城西路'),(61010412,'西稍门'),(61010413,'丰庆路'),(61010414,'城西客运站'),(61010415,'甜水井'),(61010416,'锦园小区'),(61010417,'昆明路'),(61010418,'高科花园'),(61010419,'丰禾路'),(61010420,'北大街'),(61010421,'其他'),(61011101,'红旗'),(61011102,'席王'),(61011103,'纺织城'),(61011104,'洪庆'),(61011105,'十里铺'),(61011106,'其他'),(61011201,'二府庄'),(61011202,'徐家湾'),(61011203,'张家堡'),(61011204,'辛家庙'),(61011205,'草滩'),(61011206,'三桥'),(61011207,'凤城一路'),(61011208,'方新村'),(61011209,'经济技术开发区'),(61011210,'大观园'),(61011211,'雅荷花园'),(61011212,'二马路'),(61011213,'凤城四路'),(61011214,'文景路'),(61011215,'龙首村'),(61011216,'其他'),(61011301,'小寨路'),(61011302,'大雁塔'),(61011303,'长延堡'),(61011304,'电子城'),(61011305,'等驾坡'),(61011306,'鱼化寨'),(61011307,'明德门'),(61011308,'市政府小区'),(61011309,'翠华路'),(61011310,'国展中心'),(61011311,'电视塔'),(61011312,'西影路'),(61011313,'杨家村'),(61011314,'吉祥路'),(61011315,'太白小区'),(61011316,'永松路'),(61011317,'丁白路'),(61011318,'太白南路'),(61011319,'电子正街'),(61011320,'北山门'),(61011321,'曲江新区'),(61011322,'其他'),(61011401,'新华路'),(61011402,'凤凰路'),(61011403,'关山'),(61011404,'武屯'),(61011405,'其他'),(61011501,'骊山'),(61011502,'秦陵'),(61011503,'代王'),(61011504,'新丰'),(61011505,'斜口'),(61011506,'行者'),(61011507,'其他'),(61011601,'韦曲'),(61011602,'郭杜'),(61011603,'滦镇'),(61011604,'斗门'),(61011605,'引镇'),(61011606,'东大'),(61011607,'子午'),(61011608,'马王'),(61011609,'太乙宫'),(61011610,'王寺'),(61011611,'长安区政府'),(61011612,'西京大学'),(61011613,'长安周边'),(61011614,'其他'),(61012201,'城关'),(61012202,'安村'),(61012203,'孟村'),(61012204,'前卫'),(61012205,'汤峪'),(61012206,'焦岱'),(61012207,'大寨'),(61012208,'其他'),(61012701,'科技四路西段'),(61012702,'科技二路'),(61012703,'科技一路'),(61012704,'旺座现代城'),(61012705,'沣惠南路'),(61012706,'高新二路'),(61012707,'玫瑰大楼'),(61012708,'美亚大厦'),(61012709,'高新路'),(61012710,'科技路西口'),(61012711,'光华路'),(61012712,'高新四路'),(61012713,'西安培华学院'),(61012714,'其他'),(61030201,'马营镇'),(61030202,'石鼓镇'),(61030203,'神农镇'),(61030204,'高家镇'),(61030205,'八鱼镇'),(61030206,'金陵街道'),(61030207,'经二路街道'),(61030208,'清姜街道'),(61030209,'姜谭街道'),(61030210,'桥南街道'),(61030301,'中山东路街道'),(61030302,'西关街道'),(61030303,'中山西路街道'),(61030304,'群众路街道'),(61030305,'店子街街道'),(61030306,'东风路街道'),(61030307,'十里铺街道'),(61030308,'陈仓镇'),(61030309,'蟠龙镇'),(61030310,'金河镇'),(61030311,'硖石镇'),(61030312,'上马营'),(61030401,'虢镇街道办'),(61030402,'千河街道'),(61030403,'阳平街道'),(61030404,'阳平镇'),(61030405,'千河镇'),(61030406,'蟠溪镇'),(61030407,'天王镇'),(61030408,'慕仪镇'),(61030409,'周原镇'),(61030410,'贾村镇'),(61030411,'县功镇'),(61030412,'新街镇'),(61030413,'坪头镇'),(61030414,'香泉镇'),(61030415,'赤沙镇'),(61030416,'拓石镇'),(61030417,'凤阁岭镇'),(61030418,'钓渭镇'),(61032201,'城关镇'),(61032202,'虢王镇'),(61032203,'彪角镇'),(61032204,'横水镇'),(61032205,'田家庄镇'),(61032206,'糜杆桥镇'),(61032207,'南指挥镇'),(61032208,'陈村镇'),(61032209,'长青镇'),(61032210,'柳林镇'),(61032211,'姚家沟镇'),(61032212,'范家寨镇'),(61032301,'益店镇'),(61032302,'蒲村镇'),(61032303,'祝家庄镇'),(61032304,'青化镇'),(61032305,'枣林镇'),(61032306,'雍川镇'),(61032307,'凤鸣镇'),(61032308,'蔡家坡镇'),(61032309,'京当镇'),(61032310,'故郡镇'),(61032401,'城关镇'),(61032402,'天度镇'),(61032403,'午井镇'),(61032404,'绛帐镇'),(61032405,'段家镇'),(61032406,'杏林镇'),(61032407,'召公镇'),(61032408,'法门镇'),(61032601,'首善镇'),(61032602,'横渠镇'),(61032603,'槐芽镇'),(61032604,'汤浴镇'),(61032605,'常兴镇'),(61032606,'金渠镇'),(61032607,'营头镇'),(61032608,'齐镇'),(61032701,'城关镇'),(61032702,'东风镇'),(61032703,'八渡镇'),(61032704,'温水镇'),(61032705,'天成镇'),(61032706,'曹家湾镇'),(61032707,'固关镇'),(61032708,'火烧寨镇'),(61032709,'东南镇'),(61032710,'河北镇'),(61032711,'李家河镇'),(61032712,'新集川镇'),(61032801,'城关镇'),(61032802,'崔家头镇'),(61032803,'南寨镇'),(61032804,'张家原镇'),(61032805,'水沟镇'),(61032806,'草碧镇'),(61032807,'柿沟镇'),(61032808,'高崖镇'),(61032901,'九成宫镇'),(61032902,'崔木镇'),(61032903,'招贤镇'),(61032904,'两亭镇'),(61032905,'常丰镇'),(61032906,'丈八镇'),(61032907,'酒房镇'),(61033001,'双石埔镇'),(61033002,'凤州镇'),(61033003,'黄牛铺镇'),(61033004,'红花铺镇'),(61033005,'河口镇'),(61033006,'唐藏镇'),(61033007,'平木镇'),(61033008,'坪坎镇'),(61033009,'留凤关镇'),(61033101,'咀头镇'),(61033102,'桃川镇'),(61033103,'靖口镇'),(61033104,'太白河镇'),(61033105,'鹦鸽镇'),(61033106,'王家堎镇'),(61033107,'黄柏塬镇'),(61033201,'科技创业园'),(61033202,'新区'),(61033203,'高新四路'),(61033204,'高新文理学院'),(61033205,'高新六校'),(61033501,'经开区'),(61033502,'五丈原镇'),(61033503,'曹家镇'),(61033504,'安乐镇'),(61033505,'马家镇'),(61033506,'阳平镇');
/*!40000 ALTER TABLE `district` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `example`
--

DROP TABLE IF EXISTS `example`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `example` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键Id',
  `title` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '标题',
  `service_id` int(11) NOT NULL COMMENT '服务Id',
  `procedure` varchar(800) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '过程说明',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `creator` int(11) NOT NULL COMMENT '创建人',
  PRIMARY KEY (`id`),
  UNIQUE KEY `service_id` (`service_id`),
  CONSTRAINT `example_service_key` FOREIGN KEY (`service_id`) REFERENCES `service` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `example`
--

LOCK TABLES `example` WRITE;
/*!40000 ALTER TABLE `example` DISABLE KEYS */;
/*!40000 ALTER TABLE `example` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `example_photo`
--

DROP TABLE IF EXISTS `example_photo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `example_photo` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键Id',
  `example_id` int(11) NOT NULL COMMENT '案例Id （允许重复多张图）',
  `photo_id` int(11) NOT NULL COMMENT '图片Id',
  `url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '图片URL',
  `cover` int(11) NOT NULL DEFAULT '0' COMMENT '列表图片标志 1 是，0 否',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `example_photo`
--

LOCK TABLES `example_photo` WRITE;
/*!40000 ALTER TABLE `example_photo` DISABLE KEYS */;
/*!40000 ALTER TABLE `example_photo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `feedback`
--

DROP TABLE IF EXISTS `feedback`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `feedback` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `content` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '内容',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='反馈表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `feedback`
--

LOCK TABLES `feedback` WRITE;
/*!40000 ALTER TABLE `feedback` DISABLE KEYS */;
/*!40000 ALTER TABLE `feedback` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `file`
--

DROP TABLE IF EXISTS `file`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `file` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '图片ID',
  `uid` int(11) NOT NULL COMMENT '上传前台用户ID',
  `crc32` char(8) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'crc32校验和',
  `url` varchar(256) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '对外访问的URL',
  `path` varchar(256) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '存储的相对路径',
  `filename` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '文件名字',
  `size` int(11) NOT NULL COMMENT '图片大小单位byte',
  `ext` char(5) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '图片后缀',
  `is_image` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否是图片，0为不是，1为是',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `storage_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '图片存储介质，0为fileSystem，1阿里云',
  PRIMARY KEY (`id`),
  UNIQUE KEY `filename` (`filename`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='文件信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `file`
--

LOCK TABLES `file` WRITE;
/*!40000 ALTER TABLE `file` DISABLE KEYS */;
/*!40000 ALTER TABLE `file` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `group`
--

DROP TABLE IF EXISTS `group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `group` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '组名必须是唯一字符串',
  `remark` text COLLATE utf8mb4_unicode_ci COMMENT '备注',
  PRIMARY KEY (`id`),
  UNIQUE KEY `unique_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='组表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `group`
--

LOCK TABLES `group` WRITE;
/*!40000 ALTER TABLE `group` DISABLE KEYS */;
/*!40000 ALTER TABLE `group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `industry`
--

DROP TABLE IF EXISTS `industry`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `industry` (
  `code` int(11) NOT NULL DEFAULT '0' COMMENT '行业编码',
  `name` varchar(16) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '行业名称',
  UNIQUE KEY `code` (`code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='行业表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `industry`
--

LOCK TABLES `industry` WRITE;
/*!40000 ALTER TABLE `industry` DISABLE KEYS */;
INSERT INTO `industry` VALUES (11,'餐饮美食'),(12,'美容美发'),(13,'服饰鞋包'),(14,'休闲娱乐'),(15,'百货超市'),(16,'生活服务'),(17,'电子通讯'),(18,'汽车服务'),(19,'医疗保健'),(20,'家居建材'),(22,'教育培训'),(25,'酒店宾馆'),(1101,'餐馆'),(1102,'食堂'),(1103,'面包店'),(1104,'冷饮甜品店'),(1105,'咖啡馆'),(1106,'茶艺馆'),(1107,'小吃店'),(1110,'快餐店'),(1112,'西餐厅'),(1113,'火锅店'),(1114,'大排档'),(1115,'烧烤店'),(1117,'茶楼'),(1118,'面馆'),(1119,'酒楼'),(1120,'火锅干锅'),(1121,'早餐店'),(1122,'农家乐'),(1201,'美容院'),(1202,'美发店'),(1204,'美甲店'),(1205,'SPA馆'),(1206,'产后修复'),(1207,'养生馆'),(1208,'母婴养生会所'),(1301,'服装店'),(1302,'内衣店'),(1303,'童装店'),(1304,'鞋店'),(1305,'箱包店'),(1306,'饰品店'),(1310,'黄金珠宝'),(1311,'格子铺'),(1313,'婚纱礼服馆'),(1322,'皮具护理'),(1401,'网吧'),(1402,'酒吧'),(1403,'足浴'),(1404,'水疗'),(1405,'球馆'),(1406,'麻将馆'),(1407,'瑜伽馆'),(1408,'歌舞厅(ktv)'),(1410,'夜总会'),(1411,'桌球城'),(1412,'健身房'),(1413,'休闲中心'),(1414,'棋牌室'),(1415,'浴池浴场'),(1416,'桌游'),(1417,'溜冰场	'),(1418,'电玩城'),(1420,'电影院'),(1421,'古玩字画'),(1424,'游乐场'),(1425,'度假山庄'),(1501,'超市'),(1502,'便利店'),(1503,'小卖部'),(1504,'精品店'),(1505,'杂货店'),(1506,'烟酒茶叶店'),(1507,'母婴用品店'),(1508,'玩具店'),(1509,'文具店'),(1510,'书店'),(1512,'眼镜店'),(1513,'化妆品店'),(1514,'乐器店'),(1515,'工艺品店'),(1517,'休闲食品店'),(1518,'专柜'),(1520,'床上用品'),(1521,'水产肉类熟食'),(1522,'熟食'),(1523,'特产类'),(1525,'档口摊位'),(1527,'副食品店'),(1531,'水果店'),(1601,'干洗店'),(1602,'花店水族'),(1604,'彩票店'),(1605,'报刊亭'),(1606,'送水送气店'),(1607,'宠物店'),(1608,'照相馆'),(1609,'儿童婚纱摄影'),(1613,'打字复印'),(1614,'婴儿游泳馆'),(1617,'广告制作'),(1626,'体育用品'),(1629,'养老院'),(1633,'儿童乐园'),(1634,'月子会所'),(1635,'婚庆店'),(1701,'数码店'),(1702,'电脑店'),(1703,'电器店'),(1704,'维修店'),(1707,'通讯营业厅'),(1801,'汽修厂'),(1802,'汽配店'),(1803,'轮胎店'),(1804,'汽车美容店'),(1806,'维修点'),(1807,'汽车4S店'),(1808,'电瓶车店'),(1901,'医院'),(1902,'诊所'),(1903,'药店'),(1904,'保健品店'),(1905,'成人用品店'),(2001,'五金建材店'),(2002,'建材店'),(2003,'家具店'),(2004,'灯饰店'),(2005,'家居饰品店'),(2006,'装饰装修材料店 '),(2007,'布艺家纺'),(2010,'装潢店'),(2201,'学校'),(2202,'幼儿园'),(2203,'培训机构'),(2204,'家教中心'),(2205,'早教中心'),(2501,'旅馆'),(2502,'宾馆酒店'),(2503,'招待所'),(2504,'公寓房'),(2505,'出租房');
/*!40000 ALTER TABLE `industry` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `opportunity`
--

DROP TABLE IF EXISTS `opportunity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `opportunity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商机ID',
  `title` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '标题',
  `mobile` char(11) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '手机号',
  `contact` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '联系人',
  `plugin_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '插件ID',
  `city` int(11) NOT NULL COMMENT '商机所在城市',
  `remark` text COLLATE utf8mb4_unicode_ci COMMENT '商机备注',
  `validity` tinyint(4) NOT NULL DEFAULT '0' COMMENT '有效性，0为待确认，1为有效，2为无效',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0为默认，1为做业务，2为已收费,3为已过期',
  `owner` int(11) NOT NULL DEFAULT '0' COMMENT '发布者用户ID',
  `cover` int(11) NOT NULL DEFAULT '0' COMMENT '封面图',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `mobile` (`mobile`,`plugin_id`),
  KEY `owner` (`owner`),
  KEY `fk_opportunity_district` (`city`),
  CONSTRAINT `fk_opportunity_district` FOREIGN KEY (`city`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_opportunity_user` FOREIGN KEY (`owner`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商机表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `opportunity`
--

LOCK TABLES `opportunity` WRITE;
/*!40000 ALTER TABLE `opportunity` DISABLE KEYS */;
/*!40000 ALTER TABLE `opportunity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `opportunity_remark`
--

DROP TABLE IF EXISTS `opportunity_remark`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `opportunity_remark` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `opportunity_id` int(11) NOT NULL COMMENT '商机 id',
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '内容',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建于',
  `user_id` int(11) NOT NULL COMMENT '用户（备注者） id',
  `user_name` varchar(11) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '用户（备注者）昵称',
  `type` tinyint(4) NOT NULL COMMENT '类型（0: 普通备注, 1: 报价备注）',
  `deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标记',
  PRIMARY KEY (`id`) COMMENT '主键',
  KEY `fk_comment_opportunity_idx` (`opportunity_id`) COMMENT '外键索引',
  KEY `fk_comment_user_idx` (`user_id`) COMMENT '外键索引',
  CONSTRAINT `fk_comment_opportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `opportunity` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_comment_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `opportunity_remark`
--

LOCK TABLES `opportunity_remark` WRITE;
/*!40000 ALTER TABLE `opportunity_remark` DISABLE KEYS */;
/*!40000 ALTER TABLE `opportunity_remark` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `opportunity_validity`
--

DROP TABLE IF EXISTS `opportunity_validity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `opportunity_validity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '需求ID',
  `is_valid` tinyint(4) NOT NULL COMMENT '是否有效，1为有效，2为无效',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_opportunityValidity_user` (`user_id`),
  CONSTRAINT `fk_opportunityValidity_opportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `opportunity` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_opportunityValidity_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商机有效性评判记录表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `opportunity_validity`
--

LOCK TABLES `opportunity_validity` WRITE;
/*!40000 ALTER TABLE `opportunity_validity` DISABLE KEYS */;
/*!40000 ALTER TABLE `opportunity_validity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `position`
--

DROP TABLE IF EXISTS `position`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `position` (
  `code` int(11) NOT NULL DEFAULT '0' COMMENT '职位编码',
  `title` varchar(16) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '职位名称',
  PRIMARY KEY (`code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='职位表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `position`
--

LOCK TABLES `position` WRITE;
/*!40000 ALTER TABLE `position` DISABLE KEYS */;
INSERT INTO `position` VALUES (1101,'服务员'),(1102,'面点师'),(1103,'茶艺师'),(1104,'配菜/打荷'),(1105,'传菜员'),(1106,'洗碗工'),(1107,'后厨杂工'),(1108,'领班'),(1109,'迎宾/礼仪'),(1110,'预订员'),(1111,'调酒师/吧台员'),(1112,'送餐员'),(1113,'主持/司仪'),(1114,'预订部主管'),(1115,'大堂经理'),(1116,'前厅部经理/主管'),(1117,'楼面经理'),(1118,'粤菜厨师'),(1119,'鲁菜厨师'),(1120,'凉菜厨师'),(1121,'日韩料理厨师'),(1122,'川菜厨师'),(1123,'湘菜厨师'),(1124,'西餐厨师'),(1125,'拉面师'),(1126,'烧烤师'),(1127,'食堂厨师'),(1128,'咖啡师'),(1129,'餐饮店长/经理'),(1130,'奶茶/饮品店员'),(1201,'美容店长'),(1202,'美容顾问'),(1203,'美容助理'),(1204,'美容师'),(1205,'美容培训师/导师'),(1206,'美甲师'),(1207,'美体师'),(1208,'瘦身顾问'),(1209,'SPA 技师'),(1210,'化妆师'),(1211,'彩妆顾问'),(1212,'彩妆培训师'),(1213,'美发店长'),(1214,'发型师'),(1215,'造型师'),(1216,'发型助理/学徒'),(1217,'洗头工'),(1301,'店长/卖场经理'),(1302,'店员/营业员'),(1303,'导购'),(1304,'收银员'),(1401,'店长/卖场经理'),(1402,'店员/营业员'),(1403,'导购'),(1404,'收银员'),(1405,'健身顾问/教练'),(1406,'瑜伽老师'),(1407,'舞蹈老师'),(1408,'游泳教练'),(1409,'救生员'),(1410,'高尔夫教练'),(1411,'体育运动教练'),(1412,'按摩师'),(1413,'足疗师'),(1414,'针灸推拿'),(1415,'娱乐厅服务员'),(1416,'调酒师'),(1417,'酒吧服务员'),(1418,'影视/后期制作'),(1419,'主持人'),(1420,'摄影师/摄像师'),(1421,'音效师'),(1422,'礼仪/迎宾'),(1423,'配音员'),(1424,'放映员'),(1425,'灯光师'),(1501,'店长/卖场经理'),(1502,'店员/营业员'),(1503,'导购'),(1504,'收银员'),(1505,'理货员/陈列员'),(1506,'采购员/助理'),(1507,'食品加工/处理'),(1508,'防损员/内保'),(1509,'仓库管理员'),(1510,'技工/工人'),(1511,'保洁'),(1512,'保安'),(1513,'督导'),(1514,'停车管理员'),(1515,'消防中控员'),(1601,'店长/卖场经理'),(1602,'店员/营业员'),(1603,'导购'),(1604,'收银员'),(1605,'洗衣工'),(1606,'送水/送气工'),(1607,'宠物美容'),(1608,'保姆/护工'),(1609,'月嫂/育婴'),(1610,'保洁'),(1611,'物流专员/助理'),(1612,'物流经理/主管'),(1613,'物流总监'),(1614,'调度员'),(1615,'快递员'),(1616,'仓库管理员'),(1617,'仓库经理/主管'),(1618,'装卸/搬运工'),(1619,'供应链管理'),(1620,'单证员'),(1621,'国际货运'),(1622,'主持人'),(1623,'摄影师/摄像师'),(1624,'影视/后期制作'),(1625,'婚礼策划师'),(1626,'广告文案'),(1627,'广告设计/制作'),(1628,'广告创意'),(1701,'店长/卖场经理'),(1702,'店员/营业员'),(1703,'导购'),(1704,'收银员'),(1705,'排版设计/制作'),(1706,'电子/电器维修安装'),(1801,'4S店经理/维修站经理'),(1802,'售后服务/客户服务'),(1803,'汽车销售/经纪人'),(1804,'二手车评估师'),(1805,'汽车检验/检测'),(1806,'汽车装饰美容'),(1807,'汽车修理工'),(1808,'洗车工'),(1809,'加油站工作员'),(1810,'汽车电工'),(1811,'汽车钣金'),(1812,'汽车喷漆'),(1813,'理赔专员/顾问'),(1814,'轮胎工'),(1901,'店长/卖场经理'),(1902,'店员/营业员'),(1903,'导购'),(1904,'收银员'),(1905,'内科医生'),(1906,'医院管理人员'),(1907,'药库主任/药剂师'),(1908,'护士/护理人员'),(1909,'麻醉医生'),(1910,'心理医生'),(1911,'医药学检验'),(1912,'针灸、推拿'),(1913,'营养师'),(1914,'兽医'),(1915,'外科医生'),(1916,'专科医生'),(1917,'牙科医生'),(1918,'美容整形师'),(1919,'理疗师'),(1920,'中医科医生'),(1921,'公共卫生/疾病控制'),(1922,'护理主任/护士长'),(1923,'儿科医生'),(1924,'验光师'),(1925,'放射科医师'),(1926,'综合门诊/全科医生'),(1927,'保健医生'),(2001,'店长/卖场经理'),(2002,'店员/营业员'),(2003,'导购'),(2004,'收银员'),(2005,'普工'),(2201,'中学教师'),(2202,'院校教务管理人员'),(2203,'讲师/助教'),(2204,'家教'),(2205,'幼教'),(2206,'大学教授'),(2207,'小学教师'),(2208,'兼职教师'),(2209,'职业技术教师'),(2210,'校长'),(2211,'音乐/美术教师'),(2212,'外语培训师'),(2213,'体育教师'),(2214,'教学/教务管理人员'),(2215,'招生/课程顾问'),(2501,'酒店/宾馆经理'),(2502,'酒店/宾馆销售'),(2503,'大堂经理'),(2504,'楼面经理'),(2505,'酒店前台'),(2506,'客房服务员/楼面服务员'),(2507,'行李员'),(2508,'清洁服务人员'),(2509,'宴会管理'),(2510,'管家部经理/主管'),(2511,'宾客服务经理'),(2512,'预定部主管'),(2513,'预定员'),(2514,'健身房服务'),(2515,'救生员');
/*!40000 ALTER TABLE `position` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `preference`
--

DROP TABLE IF EXISTS `preference`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `preference` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '偏好ID',
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '偏好标题，系统生成',
  `plugin_id` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '插件ID',
  `resource_id` int(11) NOT NULL DEFAULT '0' COMMENT '资源ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0为正常，-1为删除',
  `city_id` int(11) NOT NULL DEFAULT '0' COMMENT '城市ID',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `resource_id` (`resource_id`,`plugin_id`),
  KEY `fk_preference_district` (`city_id`),
  CONSTRAINT `fk_preference_district` FOREIGN KEY (`city_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_preference_resource` FOREIGN KEY (`resource_id`) REFERENCES `resource` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=63 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='偏好表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `preference`
--

LOCK TABLES `preference` WRITE;
/*!40000 ALTER TABLE `preference` DISABLE KEYS */;
/*!40000 ALTER TABLE `preference` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `price`
--

DROP TABLE IF EXISTS `price`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `price` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `key` varchar(65) CHARACTER SET armscii8 NOT NULL COMMENT '键值，条件组合键（MD5算法）',
  `price` double NOT NULL DEFAULT '0' COMMENT '标准价格',
  `description` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `modifier` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `key` (`key`)
) ENGINE=InnoDB AUTO_INCREMENT=67 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `price`
--

LOCK TABLES `price` WRITE;
/*!40000 ALTER TABLE `price` DISABLE KEYS */;
INSERT INTO `price` VALUES (1,'xw:transfermode:1transferFee:4',2000,NULL,'2015-11-17 02:37:12',NULL,NULL),(2,'xw:transfermode:1transferFee:8',2500,NULL,'2015-11-17 02:37:37','2015-11-17 02:41:30',NULL),(3,'xw:transfermode:1transferFee:10',3000,NULL,'2015-11-17 02:37:47','2015-11-17 02:41:26',NULL),(4,'xw:transfermode:1transferFee:15',3500,NULL,'2015-11-17 02:37:59','2015-11-17 02:41:22',NULL),(5,'xw:transfermode:1transferFee:20',4000,NULL,'2015-11-17 02:38:11','2015-11-17 02:41:18',NULL),(6,'xw:transfermode:1transferFee:25',4500,NULL,'2015-11-17 02:38:23','2015-11-17 02:41:15',NULL),(7,'xw:transfermode:1transferFee:30',5000,NULL,'2015-11-17 02:38:38','2015-11-17 02:41:11',NULL),(8,'xw:transfermode:1transferFee:35',5800,NULL,'2015-11-17 02:38:50','2015-11-17 02:41:07',NULL),(9,'xw:transfermode:1transferFee:40',6800,NULL,'2015-11-17 02:39:03','2015-11-17 02:41:03',NULL),(10,'xw:transfermode:1transferFee:50',7800,NULL,'2015-11-17 02:39:16','2015-11-17 02:40:58',NULL),(11,'xw:transfermode:1transferFee:80',8800,NULL,'2015-11-17 02:39:30','2015-11-17 02:40:54',NULL),(12,'xw:transfermode:1transferFee:100',9800,NULL,'2015-11-17 02:39:54','2015-11-17 02:40:51',NULL),(13,'xw:transfermode:2advertising:1',10000,NULL,'2015-11-17 02:40:46','2015-11-17 02:41:52',NULL),(14,'xw:transfermode:2advertising:2',8000,NULL,'2015-11-17 02:42:02',NULL,NULL),(15,'xw:transfermode:2advertising:3',8000,NULL,'2015-11-17 02:42:13',NULL,NULL),(16,'xw:transfermode:2advertising:4',2000,NULL,'2015-11-17 02:42:24',NULL,NULL),(17,'xw:transfermode:2advertising:5',9000,NULL,'2015-11-17 02:42:33',NULL,NULL),(18,'xw:transfermode:2advertising:6',6000,NULL,'2015-11-17 02:42:45',NULL,NULL),(19,'xw:transfermode:2advertising:7',7000,NULL,'2015-11-17 02:45:47',NULL,NULL),(20,'xw:transfermode:2advertising:8',6500,NULL,'2015-11-17 02:45:59',NULL,NULL),(21,'xw:transfermode:2advertising:9',6000,NULL,'2015-11-17 02:46:13',NULL,NULL),(22,'xw:transfermode:2advertising:10',5000,NULL,'2015-11-17 02:46:31',NULL,NULL),(23,'xw:transfermode:2advertising:11',4000,NULL,'2015-11-17 02:46:42',NULL,NULL),(24,'xw:transfermode:2advertising:12',6000,NULL,'2015-11-17 02:46:56',NULL,NULL),(25,'xw:transfermode:2advertising:13',6000,NULL,'2015-11-17 02:47:08',NULL,NULL),(26,'xw:transfermode:2advertising:14',3000,NULL,'2015-11-17 02:47:19',NULL,NULL),(27,'xw:transfermode:2advertising:15',2000,NULL,'2015-11-17 02:47:32',NULL,NULL),(28,'xw:transfermode:2advertising:16',1500,NULL,'2015-11-17 02:47:42',NULL,NULL),(29,'xw:transfermode:2advertising:17',1500,NULL,'2015-11-17 02:47:51',NULL,NULL),(30,'xw:sitingmode:1area:20',2000,NULL,'2015-11-17 02:48:43',NULL,NULL),(31,'xw:sitingmode:1area:50',2500,NULL,'2015-11-17 02:49:02',NULL,NULL),(32,'xw:sitingmode:1area:100',3000,NULL,'2015-11-17 02:49:12',NULL,NULL),(33,'xw:sitingmode:1area:200',3500,NULL,'2015-11-17 02:49:23',NULL,NULL),(34,'xw:sitingmode:1area:300',4000,NULL,'2015-11-17 02:49:33',NULL,NULL),(35,'xw:sitingmode:1area:500',4500,NULL,'2015-11-17 02:49:44',NULL,NULL),(36,'xw:sitingmode:1area:800',5000,NULL,'2015-11-17 02:49:54',NULL,NULL),(37,'xw:sitingmode:1area:1200',6000,NULL,'2015-11-17 02:50:06',NULL,NULL),(38,'xw:sitingmode:1area:1500',7000,NULL,'2015-11-17 02:50:20',NULL,NULL),(39,'xw:sitingmode:1area:2000',8000,NULL,'2015-11-17 02:50:31',NULL,NULL),(40,'xw:sitingmode:1area:3000',9000,NULL,'2015-11-17 02:50:53',NULL,NULL),(41,'xw:sitingmode:1area:4000',10000,NULL,'2015-11-17 02:51:02',NULL,NULL),(42,'xw:sitingmode:1area:5000',11000,NULL,'2015-11-17 02:51:12',NULL,NULL),(43,'xw:sitingmode:1area:6000',12000,NULL,'2015-11-17 02:51:25',NULL,NULL),(44,'xw:sitingmode:1area:7000',13000,NULL,'2015-11-17 02:51:36',NULL,NULL),(45,'xw:sitingmode:1area:8000',14000,NULL,'2015-11-17 02:51:46',NULL,NULL),(46,'xw:sitingmode:1area:9000',15000,NULL,'2015-11-17 02:51:57',NULL,NULL),(47,'xw:sitingmode:1area:10000',16000,NULL,'2015-11-17 02:52:08',NULL,NULL),(48,'xw:sitingmode:2cycle:30',5000,NULL,'2015-11-17 02:53:36',NULL,NULL),(49,'xw:sitingmode:2cycle:60',10000,NULL,'2015-11-17 02:53:56',NULL,NULL),(50,'xw:sitingmode:2cycle:90',15000,NULL,'2015-11-17 02:54:34',NULL,NULL),(51,'xw:sitingmode:2cycle:180',30000,NULL,'2015-11-17 02:54:48',NULL,NULL),(52,'xw:sitingmode:2cycle:365',60000,NULL,'2015-11-17 02:55:04',NULL,NULL),(53,'xw:recruitmentcycle:90positionNumber:10',500,NULL,'2015-11-17 02:56:12',NULL,NULL),(54,'xw:recruitmentcycle:180positionNumber:10',1200,NULL,'2015-11-17 02:56:26',NULL,NULL),(55,'xw:recruitmentcycle:365positionNumber:10',2000,NULL,'2015-11-17 02:56:50',NULL,NULL),(56,'xw:reservation',10,NULL,'2015-11-17 02:58:14',NULL,NULL),(57,'xw:sitingmode:1industry:1903',4000,NULL,'2015-12-14 03:05:27',NULL,NULL),(58,'xw:sitingmode:1industry:2202',6000,NULL,'2015-12-14 03:05:27',NULL,NULL),(59,'xw:sitingmode:1industry:1401',6000,NULL,'2015-12-14 03:05:27',NULL,NULL),(60,'xw:sitingmode:1industry:1105',6000,NULL,'2015-12-14 03:05:27',NULL,NULL),(61,'xw:sitingmode:1industry:1902',8000,NULL,'2015-12-14 03:05:27',NULL,NULL),(62,'xw:sitingmode:1industry:1901',8000,NULL,'2015-12-14 03:05:27',NULL,NULL),(63,'xw:sitingmode:1industry:1525',3500,NULL,'2015-12-14 03:05:27',NULL,NULL),(64,'xw:sitingmode:1industry:1102',5000,NULL,'2015-12-14 03:05:27',NULL,NULL);
/*!40000 ALTER TABLE `price` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recommendation`
--

DROP TABLE IF EXISTS `recommendation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `recommendation` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '需求ID',
  `sales_id` int(11) NOT NULL DEFAULT '0' COMMENT '业务员Id',
  `plugin_id` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '插件ID',
  `resource_id` int(11) NOT NULL DEFAULT '0' COMMENT '资源ID',
  `resource_mobile` char(11) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '资源手机号',
  `preference_id` int(11) NOT NULL DEFAULT '0' COMMENT '偏好ID',
  `preference_title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '偏好标题',
  `remark` text COLLATE utf8mb4_unicode_ci COMMENT '备注',
  `middleman_id` int(11) NOT NULL DEFAULT '0' COMMENT '推荐人ID',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '不同的插件具有不同的含义，描述见description.txt',
  `handleResult` tinyint(4) NOT NULL DEFAULT '0' COMMENT '处理结果',
  `hasVisited` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否到过店，0否，1是',
  PRIMARY KEY (`id`),
  UNIQUE KEY `requirement_id` (`requirement_id`,`resource_mobile`,`middleman_id`),
  KEY `middleman_id` (`middleman_id`,`plugin_id`),
  KEY `resource_id` (`resource_id`,`plugin_id`),
  CONSTRAINT `fk_recommendation_requirement` FOREIGN KEY (`requirement_id`) REFERENCES `requirement` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_recommendation_resource` FOREIGN KEY (`resource_id`) REFERENCES `resource` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='推荐表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recommendation`
--

LOCK TABLES `recommendation` WRITE;
/*!40000 ALTER TABLE `recommendation` DISABLE KEYS */;
/*!40000 ALTER TABLE `recommendation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recruitment_opportunity`
--

DROP TABLE IF EXISTS `recruitment_opportunity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `recruitment_opportunity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `shop_name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '店铺名称',
  `address` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '地址',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  `longitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '经度',
  `latitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '纬度',
  `recruit_number` int(11) NOT NULL DEFAULT '0' COMMENT '招聘人数',
  PRIMARY KEY (`id`),
  UNIQUE KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_recruitmentOpportunity_industry` (`industry_id`),
  KEY `fk_recruitmentOpportunity_district` (`district_id`),
  CONSTRAINT `fk_recruitmentOpportunity_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_recruitmentOpportunity_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='招聘商机表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recruitment_opportunity`
--

LOCK TABLES `recruitment_opportunity` WRITE;
/*!40000 ALTER TABLE `recruitment_opportunity` DISABLE KEYS */;
/*!40000 ALTER TABLE `recruitment_opportunity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recruitment_opportunity_photo`
--

DROP TABLE IF EXISTS `recruitment_opportunity_photo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `recruitment_opportunity_photo` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `photo_id` int(11) NOT NULL DEFAULT '0' COMMENT '照片ID',
  PRIMARY KEY (`id`),
  KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_recruitmentOpportunity_file` (`photo_id`),
  CONSTRAINT `fk_recruitmentOpportunityPhoto_recruitmentOpportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `recruitment_opportunity` (`opportunity_id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_recruitmentOpportunity_file` FOREIGN KEY (`photo_id`) REFERENCES `file` (`id`) ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='招聘商机照片表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recruitment_opportunity_photo`
--

LOCK TABLES `recruitment_opportunity_photo` WRITE;
/*!40000 ALTER TABLE `recruitment_opportunity_photo` DISABLE KEYS */;
/*!40000 ALTER TABLE `recruitment_opportunity_photo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recruitment_opportunity_position`
--

DROP TABLE IF EXISTS `recruitment_opportunity_position`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `recruitment_opportunity_position` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `position_id` int(11) NOT NULL DEFAULT '0' COMMENT '职位ID',
  PRIMARY KEY (`id`),
  KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_recruitmentOpportunity_position` (`position_id`),
  CONSTRAINT `fk_recruitmentOpportunity_position` FOREIGN KEY (`position_id`) REFERENCES `position` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_recruitmentOpportunity_recruitmentOpportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `recruitment_opportunity` (`opportunity_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='招聘商机职位表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recruitment_opportunity_position`
--

LOCK TABLES `recruitment_opportunity_position` WRITE;
/*!40000 ALTER TABLE `recruitment_opportunity_position` DISABLE KEYS */;
/*!40000 ALTER TABLE `recruitment_opportunity_position` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recruitment_requirement`
--

DROP TABLE IF EXISTS `recruitment_requirement`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `recruitment_requirement` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '需求ID',
  `position_id` int(11) NOT NULL DEFAULT '0' COMMENT '职位ID',
  `recruit_number` int(11) NOT NULL DEFAULT '0' COMMENT '招聘人数',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  UNIQUE KEY `requirement_id` (`requirement_id`),
  KEY `fk_recruitmentRequirement_position` (`position_id`),
  CONSTRAINT `fk_recruitmentRequirement_position` FOREIGN KEY (`position_id`) REFERENCES `position` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='招聘需求表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recruitment_requirement`
--

LOCK TABLES `recruitment_requirement` WRITE;
/*!40000 ALTER TABLE `recruitment_requirement` DISABLE KEYS */;
/*!40000 ALTER TABLE `recruitment_requirement` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `requirement`
--

DROP TABLE IF EXISTS `requirement`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `requirement` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '需求ID',
  `service_id` int(11) NOT NULL DEFAULT '0' COMMENT '服务ID',
  `plugin_id` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '插件ID',
  `contact` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '联系人',
  `title` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '标题',
  `slogan` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '广告语或特殊要求',
  `remark` text COLLATE utf8mb4_unicode_ci COMMENT '需求备注',
  `status` tinyint(4) NOT NULL COMMENT '状态，0为未发布，1为已发布，2为下线',
  `city` int(11) NOT NULL COMMENT '需求所在城市',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `refresh_time` date NOT NULL DEFAULT '2000-01-01' COMMENT '记录上次刷新的时间',
  PRIMARY KEY (`id`),
  KEY `service_id` (`service_id`,`plugin_id`),
  KEY `fk_requirement_district` (`city`),
  CONSTRAINT `fk_requirement_district` FOREIGN KEY (`city`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_requirement_service` FOREIGN KEY (`service_id`) REFERENCES `service` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='需求表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `requirement`
--

LOCK TABLES `requirement` WRITE;
/*!40000 ALTER TABLE `requirement` DISABLE KEYS */;
/*!40000 ALTER TABLE `requirement` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reservation_opportunity`
--

DROP TABLE IF EXISTS `reservation_opportunity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `reservation_opportunity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `shop_name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '店铺名称',
  `address` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '地址',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  `longitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '经度',
  `latitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '纬度',
  PRIMARY KEY (`id`),
  UNIQUE KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_reservationOpportunity_industry` (`industry_id`),
  KEY `fk_reservationOpportunity_district` (`district_id`),
  CONSTRAINT `fk_reservationOpportunity_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_reservationOpportunity_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='预订商机表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reservation_opportunity`
--

LOCK TABLES `reservation_opportunity` WRITE;
/*!40000 ALTER TABLE `reservation_opportunity` DISABLE KEYS */;
/*!40000 ALTER TABLE `reservation_opportunity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reservation_opportunity_photo`
--

DROP TABLE IF EXISTS `reservation_opportunity_photo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `reservation_opportunity_photo` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `photo_id` int(11) NOT NULL DEFAULT '0' COMMENT '照片ID',
  PRIMARY KEY (`id`),
  KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_reservationOpportunityPhoto_file` (`photo_id`),
  CONSTRAINT `fk_reservationOpportunityPhoto_file` FOREIGN KEY (`photo_id`) REFERENCES `file` (`id`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_reservationOpportunityPhoto_reservationOpportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `reservation_opportunity` (`opportunity_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='预定商机照片表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reservation_opportunity_photo`
--

LOCK TABLES `reservation_opportunity_photo` WRITE;
/*!40000 ALTER TABLE `reservation_opportunity_photo` DISABLE KEYS */;
/*!40000 ALTER TABLE `reservation_opportunity_photo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `resource`
--

DROP TABLE IF EXISTS `resource`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `resource` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '资源对应的用户ID',
  `mobile` char(11) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '手机号',
  `name` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '联系人',
  `owner` int(11) NOT NULL DEFAULT '0' COMMENT '资源所属的用户ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0为正常，-1为删除',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `owner` (`owner`,`mobile`),
  CONSTRAINT `fk_resource_user` FOREIGN KEY (`owner`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='资源表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `resource`
--

LOCK TABLES `resource` WRITE;
/*!40000 ALTER TABLE `resource` DISABLE KEYS */;
INSERT INTO `resource` VALUES (140,114,'13554321888','1355432****',114,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(141,115,'13664321999','1366432****',115,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(142,116,'13664321000','1366432****',116,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(143,117,'13798765888','1379876****',117,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(144,118,'13898765999','1389876****',118,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(145,119,'13510101010','1351010****',119,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(146,120,'13510101011','1351010****',120,0,'2015-12-14 08:24:33','2015-12-14 08:24:33'),(147,121,'13510101012','1351010****',121,0,'2015-12-14 08:24:33','2015-12-14 08:24:33'),(148,122,'13510101013','1351010****',122,0,'2015-12-14 08:24:33','2015-12-14 08:24:33');
/*!40000 ALTER TABLE `resource` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `schema_version`
--

DROP TABLE IF EXISTS `schema_version`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `schema_version` (
  `version_rank` int(11) NOT NULL,
  `installed_rank` int(11) NOT NULL,
  `version` varchar(50) NOT NULL,
  `description` varchar(200) NOT NULL,
  `type` varchar(20) NOT NULL,
  `script` varchar(1000) NOT NULL,
  `checksum` int(11) DEFAULT NULL,
  `installed_by` varchar(100) NOT NULL,
  `installed_on` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `execution_time` int(11) NOT NULL,
  `success` tinyint(1) NOT NULL,
  PRIMARY KEY (`version`),
  KEY `schema_version_vr_idx` (`version_rank`),
  KEY `schema_version_ir_idx` (`installed_rank`),
  KEY `schema_version_s_idx` (`success`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `schema_version`
--

LOCK TABLES `schema_version` WRITE;
/*!40000 ALTER TABLE `schema_version` DISABLE KEYS */;
INSERT INTO `schema_version` VALUES (1,1,'1','init database','SQL','V1__init_database.sql',-1461187669,'root','2015-12-14 03:05:27',258,1),(2,2,'1.1.1','create preference tables','SQL','V1_1_1__create_preference_tables.sql',-2037882527,'root','2015-12-14 03:05:27',43,1),(3,3,'1.1.2','create requirement tables','SQL','V1_1_2__create_requirement_tables.sql',-1598752634,'root','2015-12-14 03:05:27',59,1),(4,4,'1.1.3','create opportunity tables','SQL','V1_1_3__create_opportunity_tables.sql',-1632308687,'root','2015-12-14 03:05:27',108,1),(5,5,'1.1.4','create recommendation tables','SQL','V1_1_4__create_recommendation_tables.sql',-38490727,'root','2015-12-14 03:05:27',19,1),(6,6,'1.1.5','create business tables','SQL','V1_1_5__create_business_tables.sql',181496144,'root','2015-12-14 03:05:27',10,1),(7,7,'1.2.1','insert industry data','SQL','V1_2_1__insert_industry_data.sql',1339156884,'root','2015-12-14 03:05:27',68,1),(8,8,'1.2.2','insert district data','SQL','V1_2_2__insert_district_data.sql',-450275587,'root','2015-12-14 03:05:27',130,1),(9,9,'1.2.3','insert position data','SQL','V1_2_3__insert_position_data.sql',-831898567,'root','2015-12-14 03:05:27',4,1),(10,10,'1.2.4','insert price data','SQL','V1_2_4__insert_price_data.sql',-1131988993,'root','2015-12-14 03:05:27',29,1),(11,11,'1.2.5','insert admin','SQL','V1_2_5__insert_admin.sql',2103860898,'root','2015-12-14 03:05:27',2,1),(12,12,'1.2.6','insert service phone','SQL','V1_2_6__insert_service_phone.sql',-1370998614,'root','2015-12-14 03:05:27',24,1),(13,13,'2','alter table user modify column nickname','SQL','V2__alter_table_user_modify_column_nickname.sql',-362296800,'root','2015-12-14 03:05:27',14,1);
/*!40000 ALTER TABLE `schema_version` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `service`
--

DROP TABLE IF EXISTS `service`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `service` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '服务ID',
  `shop_id` int(11) NOT NULL DEFAULT '0' COMMENT '店铺ID',
  `plugin_id` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '插件ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0为试用中，1为已收费，2为关闭,3为已过期',
  `operate_remark` text COLLATE utf8mb4_unicode_ci COMMENT '操作备注，如关闭备注',
  `business_id` int(11) NOT NULL DEFAULT '0' COMMENT '业务ID',
  `start_date` date NOT NULL COMMENT '服务开始时间',
  `end_date` date NOT NULL COMMENT '服务结束时间',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `opinion` int(11) DEFAULT NULL COMMENT '原因：0 非常满意，1 满意，2 一般，3 不满意，4 很不满意',
  PRIMARY KEY (`id`),
  KEY `shop_id` (`shop_id`,`plugin_id`),
  CONSTRAINT `fk_service_shop` FOREIGN KEY (`shop_id`) REFERENCES `shop` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=43 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='服务表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `service`
--

LOCK TABLES `service` WRITE;
/*!40000 ALTER TABLE `service` DISABLE KEYS */;
/*!40000 ALTER TABLE `service` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `service_phone`
--

DROP TABLE IF EXISTS `service_phone`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `service_phone` (
  `city_id` int(11) NOT NULL COMMENT '城市Id',
  `phone` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '连系电话',
  PRIMARY KEY (`city_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `service_phone`
--

LOCK TABLES `service_phone` WRITE;
/*!40000 ALTER TABLE `service_phone` DISABLE KEYS */;
INSERT INTO `service_phone` VALUES (22,'043268028857'),(1101,'01051229888'),(1201,'02287053506'),(1301,'031180696814'),(1401,'03515277272'),(2101,'02423911429'),(2102,'041184541521'),(2201,'043187068631'),(2202,'043268028857'),(2301,'045187539593'),(3101,'02160741110'),(3201,'02586963518'),(3202,'051085803535'),(3203,'051682330007'),(3204,'051969863258'),(3205,'051267011351'),(3206,'051368608026'),(3301,'057156289060'),(3302,'057455712428'),(3303,'057786059869'),(3401,'05515226020'),(3402,'05532206290'),(3501,'059163368980'),(3502,'05923855066'),(3505,'059568267233'),(3601,'079187507019'),(3607,'07978389693'),(3701,'053166715863'),(3702,'053255672003'),(3706,'05352123321'),(3707,'05368093998'),(3713,'05395329175'),(4101,'037155195858'),(4103,'037963637598'),(4201,'02750669793'),(4205,'07176332698'),(4206,'07102384188'),(4301,'073184167816'),(4302,'073122321870'),(4401,'02022381896'),(4403,'075586965550'),(4404,'07566880119'),(4406,'075783332178'),(4413,'043187068631'),(4419,'076989812028'),(4420,'076088622598'),(4501,'07715553588'),(4502,'07722497801'),(4503,'07732112137'),(4601,'0898-66501422'),(4602,'089888663315'),(5001,'02389319061'),(5101,'02887587907'),(5107,'08162250367'),(5201,'085185661071'),(5203,'085128957378'),(5301,'087168379638'),(6101,'02989293073'),(6103,'09172606999'),(6104,'02932988388'),(6201,'15294151613'),(13010425,'076088622598'),(31011712,'076088622598'),(35018110,'0898-66501422'),(37028402,'07566880119'),(45010315,'076088622598'),(46010601,'076088622598'),(53011209,'0898-66501422');
/*!40000 ALTER TABLE `service_phone` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `shop`
--

DROP TABLE IF EXISTS `shop`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `shop` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '店铺名称',
  `industry_id` int(11) NOT NULL COMMENT '行业 id',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域Id',
  `address` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '店铺地址',
  `latitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '纬度',
  `longitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '经度',
  `city_id` int(11) NOT NULL COMMENT '城市id',
  `license_field` int(10) unsigned zerofill DEFAULT NULL COMMENT '营业执照图片文件id',
  `remark` text COLLATE utf8mb4_unicode_ci COMMENT '申请营业执照认证时的备注信息',
  `status` int(11) NOT NULL COMMENT '营业执照认证状态',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `owner_id` int(11) NOT NULL COMMENT '(店主)用户id',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_owner_id` (`owner_id`),
  KEY `fk_shop_industry` (`industry_id`),
  CONSTRAINT `fk_shop_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_shop_user` FOREIGN KEY (`owner_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='店铺表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `shop`
--

LOCK TABLES `shop` WRITE;
/*!40000 ALTER TABLE `shop` DISABLE KEYS */;
/*!40000 ALTER TABLE `shop` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `siting_opportunity`
--

DROP TABLE IF EXISTS `siting_opportunity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `siting_opportunity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `min_area` int(11) NOT NULL DEFAULT '0' COMMENT '最小面积',
  `max_area` int(11) NOT NULL DEFAULT '0' COMMENT '最大面积',
  `min_rent` bigint(15) NOT NULL DEFAULT '0' COMMENT '最小租金',
  `max_rent` bigint(15) NOT NULL DEFAULT '0' COMMENT '最大租金',
  PRIMARY KEY (`id`),
  UNIQUE KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_sitingOpportunity_industry` (`industry_id`),
  CONSTRAINT `fk_sitingOpportunity_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='选址商机表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `siting_opportunity`
--

LOCK TABLES `siting_opportunity` WRITE;
/*!40000 ALTER TABLE `siting_opportunity` DISABLE KEYS */;
/*!40000 ALTER TABLE `siting_opportunity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `siting_opportunity_district`
--

DROP TABLE IF EXISTS `siting_opportunity_district`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `siting_opportunity_district` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  PRIMARY KEY (`id`),
  KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_sitingOpportunityDistrict_district` (`district_id`),
  CONSTRAINT `fk_sitingOpportunityDistrict_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_sitingOpportunityDistrict_sitingOpportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `siting_opportunity` (`opportunity_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='选址商机区域表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `siting_opportunity_district`
--

LOCK TABLES `siting_opportunity_district` WRITE;
/*!40000 ALTER TABLE `siting_opportunity_district` DISABLE KEYS */;
/*!40000 ALTER TABLE `siting_opportunity_district` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `siting_preference`
--

DROP TABLE IF EXISTS `siting_preference`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `siting_preference` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `preference_id` int(11) NOT NULL DEFAULT '0' COMMENT '偏好ID',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  `min_area` int(11) NOT NULL DEFAULT '0' COMMENT '最小面积',
  `max_area` int(11) NOT NULL DEFAULT '0' COMMENT '最大面积',
  `min_rent` bigint(20) NOT NULL DEFAULT '0' COMMENT '最小租金',
  `max_rent` bigint(20) NOT NULL DEFAULT '0' COMMENT '最大租金',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  UNIQUE KEY `preference_id` (`preference_id`),
  KEY `fk_sitingPreference_industry` (`industry_id`),
  KEY `fk_sitingPreference_district` (`district_id`),
  CONSTRAINT `fk_sitingPreference_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_sitingPreference_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='找店偏好表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `siting_preference`
--

LOCK TABLES `siting_preference` WRITE;
/*!40000 ALTER TABLE `siting_preference` DISABLE KEYS */;
INSERT INTO `siting_preference` VALUES (26,53,11,11,100,10000,10000,1000000,11001100500050),(27,54,11,12,100,10000,10000,1000000,11001200500050),(28,55,11,11,0,100,0,0,11001100000000),(29,57,11,4402,1000,2000,100000,300000,11440200150020),(30,58,11,4403,1000,2000,100000,300000,11440300150020),(31,62,1301,44030301,3000,4000,6000000,9999999900,1301030100350299);
/*!40000 ALTER TABLE `siting_preference` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `siting_requirement`
--

DROP TABLE IF EXISTS `siting_requirement`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `siting_requirement` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '需求ID',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `min_area` int(11) NOT NULL DEFAULT '0' COMMENT '最小面积',
  `max_area` int(11) NOT NULL DEFAULT '0' COMMENT '最大面积',
  `min_rent` bigint(15) NOT NULL DEFAULT '0' COMMENT '最小租金',
  `max_rent` bigint(15) NOT NULL DEFAULT '0' COMMENT '最大租金',
  PRIMARY KEY (`id`),
  UNIQUE KEY `requirement_id` (`requirement_id`),
  KEY `fk_sitingRequirement_industry` (`industry_id`),
  CONSTRAINT `fk_sitingRequirement_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='找店需求表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `siting_requirement`
--

LOCK TABLES `siting_requirement` WRITE;
/*!40000 ALTER TABLE `siting_requirement` DISABLE KEYS */;
INSERT INTO `siting_requirement` VALUES (7,24,11,100,10000,10000,1000000),(8,25,11,0,100,0,0),(9,27,11,1000,2000,100000,300000),(10,34,1301,3000,4000,6000000,9999999900);
/*!40000 ALTER TABLE `siting_requirement` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `siting_requirement_district`
--

DROP TABLE IF EXISTS `siting_requirement_district`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `siting_requirement_district` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  KEY `requirement_id` (`requirement_id`),
  KEY `fk_sitingRequirementDistrict_district` (`district_id`),
  CONSTRAINT `fk_sitingRequirementDistrict_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_sitingRequirementDistrict_sitingRequirement` FOREIGN KEY (`requirement_id`) REFERENCES `siting_requirement` (`requirement_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='找店区域表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `siting_requirement_district`
--

LOCK TABLES `siting_requirement_district` WRITE;
/*!40000 ALTER TABLE `siting_requirement_district` DISABLE KEYS */;
INSERT INTO `siting_requirement_district` VALUES (21,24,11,0),(22,24,13,0),(23,24,14,0),(24,25,11,0),(25,27,4402,0),(26,27,4403,0),(27,34,44030301,0);
/*!40000 ALTER TABLE `siting_requirement_district` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sys_message`
--

DROP TABLE IF EXISTS `sys_message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sys_message` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '消息ID',
  `content` varchar(1024) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '内容',
  `uri` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '消息跳转地址,如page://bizteam.list或http://www.xw.com,其中page协议表示跳转到站内，http协议表示跳转到一个URL',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `user_type` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1=普通用户, 2=商户',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='系统消息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sys_message`
--

LOCK TABLES `sys_message` WRITE;
/*!40000 ALTER TABLE `sys_message` DISABLE KEYS */;
/*!40000 ALTER TABLE `sys_message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `trade`
--

DROP TABLE IF EXISTS `trade`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `trade` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键Id',
  `tradeno` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '订单号',
  `paymenttype` smallint(6) NOT NULL DEFAULT '0' COMMENT '付款类型：1 支付宝，2 微信支付',
  `subject` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品（服务）',
  `amount` int(11) NOT NULL COMMENT '订单金额（单位：分钱）',
  `amountkey` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '订单号',
  `contractid` int(11) NOT NULL COMMENT '合同Id,必须关联一个合同',
  `status` smallint(6) NOT NULL COMMENT '订单状态：0 未验证，1 已验证，2 已作废',
  `creator` int(11) NOT NULL,
  `createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '订单创建时间',
  `checktime` timestamp NULL DEFAULT NULL COMMENT '回调确认时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `tradeno` (`tradeno`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `trade`
--

LOCK TABLES `trade` WRITE;
/*!40000 ALTER TABLE `trade` DISABLE KEYS */;
/*!40000 ALTER TABLE `trade` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transaction`
--

DROP TABLE IF EXISTS `transaction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transaction` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `amount` int(11) NOT NULL DEFAULT '0' COMMENT '交易金额',
  `type` tinyint(4) NOT NULL COMMENT '交易类型，1为收入，2为支出',
  `category` tinyint(4) NOT NULL DEFAULT '0' COMMENT '当交易类型为收入时类别为：1为小旺推广，2为发布信息，3为做业务，4为做推荐，5为团队管理',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `remark` text COLLATE utf8mb4_unicode_ci COMMENT '备注',
  `subject` int(11) NOT NULL DEFAULT '0' COMMENT '科目',
  `batchno` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '批号',
  `tid` int(11) NOT NULL DEFAULT '0' COMMENT 'Id记录',
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`,`create_time`),
  KEY `user_id_2` (`user_id`,`category`,`create_time`),
  CONSTRAINT `fk_transaction_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='交易表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transaction`
--

LOCK TABLES `transaction` WRITE;
/*!40000 ALTER TABLE `transaction` DISABLE KEYS */;
/*!40000 ALTER TABLE `transaction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transfer_opportunity`
--

DROP TABLE IF EXISTS `transfer_opportunity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transfer_opportunity` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `type` tinyint(4) NOT NULL COMMENT '类型，1为店铺转让，2为出租招商',
  `shop_name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '店铺名称或楼盘名称',
  `address` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '地址',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  `longitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '经度',
  `latitude` double(10,6) NOT NULL DEFAULT '0.000000' COMMENT '纬度',
  `transfer_fee` bigint(13) NOT NULL DEFAULT '0' COMMENT '转让费',
  `business_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '营业状态，1为营业中，2为未营业',
  `area` int(11) NOT NULL DEFAULT '0' COMMENT '面积',
  `rent` bigint(15) NOT NULL DEFAULT '0' COMMENT '租金',
  `empty_transfer` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否空转, 1为是, 2为否',
  PRIMARY KEY (`id`),
  UNIQUE KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_transferOpportunity_district` (`district_id`),
  CONSTRAINT `fk_transferOpportunity_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='转让商机表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transfer_opportunity`
--

LOCK TABLES `transfer_opportunity` WRITE;
/*!40000 ALTER TABLE `transfer_opportunity` DISABLE KEYS */;
/*!40000 ALTER TABLE `transfer_opportunity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transfer_opportunity_photo`
--

DROP TABLE IF EXISTS `transfer_opportunity_photo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transfer_opportunity_photo` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `opportunity_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `photo_id` int(11) NOT NULL DEFAULT '0' COMMENT '照片ID',
  PRIMARY KEY (`id`),
  KEY `opportunity_id` (`opportunity_id`),
  KEY `fk_transferOpportunityPhoto_file` (`photo_id`),
  CONSTRAINT `fk_transferOpportunityPhoto_file` FOREIGN KEY (`photo_id`) REFERENCES `file` (`id`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_transferOpportunityPhoto_transferOpportunity` FOREIGN KEY (`opportunity_id`) REFERENCES `transfer_opportunity` (`opportunity_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='转让商机照片表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transfer_opportunity_photo`
--

LOCK TABLES `transfer_opportunity_photo` WRITE;
/*!40000 ALTER TABLE `transfer_opportunity_photo` DISABLE KEYS */;
/*!40000 ALTER TABLE `transfer_opportunity_photo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transfer_preference`
--

DROP TABLE IF EXISTS `transfer_preference`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transfer_preference` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `preference_id` int(11) NOT NULL DEFAULT '0' COMMENT '偏好ID',
  `type` tinyint(4) NOT NULL COMMENT '类型，1为店铺转让，2为出租招商',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业id',
  `district_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域ID',
  `area` int(11) NOT NULL DEFAULT '0' COMMENT '面积',
  `rent` bigint(20) NOT NULL DEFAULT '0' COMMENT '租金',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  UNIQUE KEY `preference_id` (`preference_id`),
  KEY `fk_transferPreference_industry` (`industry_id`),
  KEY `fk_transferPreference_district` (`district_id`),
  CONSTRAINT `fk_transferPreference_district` FOREIGN KEY (`district_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_transferPreference_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='转店偏好表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transfer_preference`
--

LOCK TABLES `transfer_preference` WRITE;
/*!40000 ALTER TABLE `transfer_preference` DISABLE KEYS */;
INSERT INTO `transfer_preference` VALUES (15,52,2,11,440305,100,0,11030501000000),(16,56,2,11,440305,100,0,11030501000000),(17,59,2,11,440305,100,11,11030501000011),(18,60,2,11,440305,100,0,11030501000000),(19,61,2,11,440305,100,0,11030501000000);
/*!40000 ALTER TABLE `transfer_preference` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transfer_requirement`
--

DROP TABLE IF EXISTS `transfer_requirement`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transfer_requirement` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '需求ID',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '类型，1为店铺转让，2为出租招商',
  `area` int(11) NOT NULL DEFAULT '0' COMMENT '面积',
  `rent` bigint(13) NOT NULL DEFAULT '0' COMMENT '租金',
  `cost` bigint(13) NOT NULL DEFAULT '0' COMMENT '转让费',
  `business_status` tinyint(4) NOT NULL COMMENT '营业状态，1为营业中，2为未营业',
  `empty_transfer` tinyint(4) NOT NULL COMMENT '是否空转，1为是，2为否',
  `fingerprint` bigint(20) NOT NULL DEFAULT '0' COMMENT '指纹',
  PRIMARY KEY (`id`),
  UNIQUE KEY `requirement_id` (`requirement_id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='转店需求表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transfer_requirement`
--

LOCK TABLES `transfer_requirement` WRITE;
/*!40000 ALTER TABLE `transfer_requirement` DISABLE KEYS */;
/*!40000 ALTER TABLE `transfer_requirement` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transfer_requirement_industry`
--

DROP TABLE IF EXISTS `transfer_requirement_industry`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transfer_requirement_industry` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `industry_id` int(11) NOT NULL DEFAULT '0' COMMENT '行业ID',
  PRIMARY KEY (`id`),
  KEY `requirement_id` (`requirement_id`),
  KEY `fk_transferRequirementIndustry_industry` (`industry_id`),
  CONSTRAINT `fk_transferRequirementIndustry_industry` FOREIGN KEY (`industry_id`) REFERENCES `industry` (`code`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_transferRequirementIndustry_transferRequirement` FOREIGN KEY (`requirement_id`) REFERENCES `transfer_requirement` (`requirement_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='转让需求适合经营行业表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transfer_requirement_industry`
--

LOCK TABLES `transfer_requirement_industry` WRITE;
/*!40000 ALTER TABLE `transfer_requirement_industry` DISABLE KEYS */;
/*!40000 ALTER TABLE `transfer_requirement_industry` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `transfer_requirement_photo`
--

DROP TABLE IF EXISTS `transfer_requirement_photo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `transfer_requirement_photo` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '商机ID',
  `photo_id` int(11) NOT NULL DEFAULT '0' COMMENT '照片ID',
  PRIMARY KEY (`id`),
  KEY `requirement_id` (`requirement_id`),
  KEY `fk_transferRequirementPhoto_file` (`photo_id`),
  CONSTRAINT `fk_transferRequirementPhoto_file` FOREIGN KEY (`photo_id`) REFERENCES `file` (`id`) ON UPDATE NO ACTION,
  CONSTRAINT `fk_transferRequirementPhoto_transferRequirement` FOREIGN KEY (`requirement_id`) REFERENCES `transfer_requirement` (`requirement_id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='转让需求照片表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `transfer_requirement_photo`
--

LOCK TABLES `transfer_requirement_photo` WRITE;
/*!40000 ALTER TABLE `transfer_requirement_photo` DISABLE KEYS */;
/*!40000 ALTER TABLE `transfer_requirement_photo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `mobile` char(11) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '手机号',
  `password` char(24) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '密码',
  `salt` char(16) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '密码盐值',
  `avatar_id` int(11) NOT NULL DEFAULT '0' COMMENT '头像ID',
  `nickname` varchar(21) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '昵称',
  `promo_code` char(10) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '推广码',
  `referrer_id` int(11) NOT NULL DEFAULT '0' COMMENT '推荐人用户ID',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，-1为删除，0为正常，1为禁用',
  `city_id` int(11) NOT NULL COMMENT '城市ID',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `mobile` (`mobile`),
  UNIQUE KEY `promo_code` (`promo_code`),
  KEY `fk_user_district` (`city_id`),
  CONSTRAINT `fk_user_district` FOREIGN KEY (`city_id`) REFERENCES `district` (`code`) ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=123 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='用户表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (114,'13554321888','iUDtt/8SC9GUv+b05DE90g==','kPYeYSkYHUViynpv',0,'1355432****','r4ng',0,0,4403,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(115,'13664321999','CdwQdQqJqYut+uPf1wz1aw==','G6S14VtODzfsGf2m',0,'1366432****','0g92',0,0,4403,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(116,'13664321000','+y4GCvmV9qJzgFwZBGyR5A==','bAseJVrp4EsuInll',0,'1366432****','0o2m',0,0,4403,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(117,'13798765888','FPLzEIrD+DiLU41C23uMRA==','9jJDfjDV0Cz7k2tj',0,'1379876****','0qz6',0,0,4403,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(118,'13898765999','JyB/aT+QPdc54K9Fuw2UdQ==','sFJJztWSZamqvTXe',0,'1389876****','07xz',0,0,4403,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(119,'13510101010','DusE+gs5yVP5KzhiAfAdgA==','6MxNpo6kDoylWICD',0,'1351010****','em1y',0,0,4403,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(120,'13510101011','vwlpfO8WwikmTQpBYI+2/Q==','R12N7mg3dAgeoiPa',0,'1351010****','e3vx',0,0,4403,'2015-12-14 08:24:33','2015-12-14 08:24:33'),(121,'13510101012','WzapdoqwZZ0O25CjkWHUhA==','mtLNnqU0Qce4oaaZ',0,'1351010****','r9g8',0,0,4403,'2015-12-14 08:24:33','2015-12-14 08:24:33'),(122,'13510101013','VtipqCYLHGqbZhj8lyQnjw==','IttAO1NUK18isgb6',0,'1351010****','rn58',0,0,4403,'2015-12-14 08:24:33','2015-12-14 08:24:33');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_bizteam`
--

DROP TABLE IF EXISTS `user_bizteam`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_bizteam` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `bizteam_id` int(11) NOT NULL DEFAULT '0' COMMENT '业务团队ID',
  `bizteam_category` tinyint(4) NOT NULL DEFAULT '0' COMMENT '团队类别，1为转让，2为选址，3为招聘，4为预订',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0为待处理，1为同意，2为拒绝',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `remark` varchar(300) COLLATE utf8mb4_unicode_ci DEFAULT '' COMMENT '备注',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id` (`user_id`,`bizteam_id`,`bizteam_category`),
  KEY `bizteam_id` (`bizteam_id`,`create_time`),
  CONSTRAINT `fk_bizteam_userBizteam` FOREIGN KEY (`bizteam_id`) REFERENCES `bizteam` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_userBizteam_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='用户业务团队表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_bizteam`
--

LOCK TABLES `user_bizteam` WRITE;
/*!40000 ALTER TABLE `user_bizteam` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_bizteam` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_certification`
--

DROP TABLE IF EXISTS `user_certification`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_certification` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `application_remark` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '申请备注',
  `category` tinyint(4) NOT NULL DEFAULT '0' COMMENT '认证类别，1为转让认证，2为选址认证，3为招聘认证，4为消费预订认证',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '申请状态，0为申请中，1为申请成功，2为申请失败',
  `info` varchar(2048) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '证书信息，存储为json字符串',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `operator` int(11) NOT NULL DEFAULT '0' COMMENT '操作人',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id_2` (`user_id`,`category`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `fk_certification_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='认证申请表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_certification`
--

LOCK TABLES `user_certification` WRITE;
/*!40000 ALTER TABLE `user_certification` DISABLE KEYS */;
INSERT INTO `user_certification` VALUES (27,114,'Apply the certification for the transfer business team.',1,1,'','2015-12-14 08:24:32','2015-12-14 08:27:50',0),(28,114,'Apply the certification for the siting business team.',2,1,'','2015-12-14 08:24:32','2015-12-14 08:27:51',0),(29,114,'Apply the certification for the recruitment business team.',3,1,'','2015-12-14 08:24:32','2015-12-14 08:27:52',0),(30,114,'Apply the certification for the comsuption business team.',4,1,'','2015-12-14 08:24:32','2015-12-14 08:27:54',0),(31,115,'Apply the certification for the transfer business team.',1,1,'','2015-12-14 08:24:32','2015-12-14 08:27:55',0),(32,115,'Apply the certification for the siting business team.',2,1,'','2015-12-14 08:24:32','2015-12-14 08:27:58',0),(33,115,'Apply the certification for the recruitment business team.',3,1,'','2015-12-14 08:24:32','2015-12-14 08:27:59',0),(34,115,'Apply the certification for the comsuption business team.',4,1,'','2015-12-14 08:24:32','2015-12-14 08:28:00',0),(35,119,'Apply the certification for the transfer business team.',1,1,'','2015-12-14 08:24:32','2015-12-14 08:28:01',0),(36,120,'Apply the certification for the siting business team.',2,1,'','2015-12-14 08:24:33','2015-12-14 08:28:02',0),(37,121,'Apply the certification for the recruitment business team.',3,1,'','2015-12-14 08:24:33','2015-12-14 08:28:04',0),(38,122,'Apply the certification for the Comsuption business team.',4,1,'','2015-12-14 08:24:33','2015-12-14 08:28:09',0);
/*!40000 ALTER TABLE `user_certification` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_group`
--

DROP TABLE IF EXISTS `user_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_group` (
  `user_id` int(11) NOT NULL COMMENT '用户 ID',
  `group_id` int(11) NOT NULL COMMENT '组 ID',
  PRIMARY KEY (`user_id`,`group_id`),
  KEY `fk_ug_group_idx` (`group_id`),
  KEY `fk_ug_user_idx` (`user_id`),
  CONSTRAINT `fk_ug_group` FOREIGN KEY (`group_id`) REFERENCES `group` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_ug_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='组用户关系表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_group`
--

LOCK TABLES `user_group` WRITE;
/*!40000 ALTER TABLE `user_group` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_message`
--

DROP TABLE IF EXISTS `user_message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_message` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '消息ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `content` varchar(1024) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '内容',
  `uri` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '消息跳转地址,如page://bizteam.list或http://www.xw.com,其中page协议表示跳转到站内，http协议表示跳转到一个URL',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `user_type` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1=普通用户, 2=商户',
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `fk_userMessage_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=116 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='用户消息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_message`
--

LOCK TABLES `user_message` WRITE;
/*!40000 ALTER TABLE `user_message` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_profile`
--

DROP TABLE IF EXISTS `user_profile`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_profile` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `gender` tinyint(4) NOT NULL DEFAULT '0' COMMENT '性别，0为未知，1为男，2为女',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id` (`user_id`),
  CONSTRAINT `fk_profile_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=123 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='用户基本信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_profile`
--

LOCK TABLES `user_profile` WRITE;
/*!40000 ALTER TABLE `user_profile` DISABLE KEYS */;
INSERT INTO `user_profile` VALUES (114,114,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(115,115,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(116,116,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(117,117,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(118,118,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(119,119,0,'2015-12-14 08:24:32','2015-12-14 08:24:32'),(120,120,0,'2015-12-14 08:24:33','2015-12-14 08:24:33'),(121,121,0,'2015-12-14 08:24:33','2015-12-14 08:24:33'),(122,122,0,'2015-12-14 08:24:33','2015-12-14 08:24:33');
/*!40000 ALTER TABLE `user_profile` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `valid_recommendation`
--

DROP TABLE IF EXISTS `valid_recommendation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `valid_recommendation` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `requirement_id` int(11) NOT NULL DEFAULT '0' COMMENT '需求ID',
  `resource_id` int(11) NOT NULL DEFAULT '0' COMMENT '资源ID',
  `resource_mobile` char(11) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '资源手机号',
  `middleman_id` int(11) NOT NULL DEFAULT '0' COMMENT '推荐人',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `requirement_id` (`requirement_id`,`resource_mobile`),
  KEY `middleman_id` (`middleman_id`),
  KEY `fk_validRecommendation_resource` (`resource_id`),
  CONSTRAINT `fk_validRecommendation_requirement` FOREIGN KEY (`requirement_id`) REFERENCES `requirement` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `fk_validRecommendation_resource` FOREIGN KEY (`resource_id`) REFERENCES `resource` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='有效推荐表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `valid_recommendation`
--

LOCK TABLES `valid_recommendation` WRITE;
/*!40000 ALTER TABLE `valid_recommendation` DISABLE KEYS */;
/*!40000 ALTER TABLE `valid_recommendation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `wallet`
--

DROP TABLE IF EXISTS `wallet`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `wallet` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `amount` int(11) NOT NULL DEFAULT '0' COMMENT '金额',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id` (`user_id`),
  CONSTRAINT `fk_wallet_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=123 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='钱包表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `wallet`
--

LOCK TABLES `wallet` WRITE;
/*!40000 ALTER TABLE `wallet` DISABLE KEYS */;
INSERT INTO `wallet` VALUES (114,114,0),(115,115,0),(116,116,0),(117,117,0),(118,118,0),(119,119,0),(120,120,0),(121,121,0),(122,122,0);
/*!40000 ALTER TABLE `wallet` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-12-14 16:36:55
